TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:25:57 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("c1brom_init_pie_vect_table")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_c1brom_init_pie_vect_table")

    2873                      .dwattr $C$DW$156, DW_AT_TI_call
    2874 000004d3 7640!         LCR       #_sysctl_wdog_enable  ; [CPU_] |815| 
         000004d4 0000 
    2875                      ; call occurs [#_sysctl_wdog_enable] ; [] |815| 
    2876 000004d5       $C$L69:    
    2877                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    2878 000004d5 7625     ESTOP0
    2879 000004d6       $C$L70:    
    2880 000004d6       $C$DW$L$_WaitBoot$6$B:
    2881                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    2882 000004d6 6F00          B         $C$L70,UNC            ; [CPU_] |826| 
    2883                      ; branch occurs ; [] |826| 
    2884              $C$DW$L$_WaitBoot$6$E:
    2885              
    2886              $C$DW$157       .dwtag  DW_TAG_TI_loop
    2887                      .dwattr $C$DW$157, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0913210:$C$L70:1:1391099158
    2888                      .dwattr $C$DW$157, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bo
    2889                      .dwattr $C$DW$157, DW_AT_TI_begin_line(0x338)
    2890                      .dwattr $C$DW$157, DW_AT_TI_end_line(0x33a)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   58

    2891              $C$DW$158       .dwtag  DW_TAG_TI_loop_range
    2892                      .dwattr $C$DW$158, DW_AT_low_pc($C$DW$L$_WaitBoot$6$B)
    2893                      .dwattr $C$DW$158, DW_AT_high_pc($C$DW$L$_WaitBoot$6$E)
    2894                      .dwendtag $C$DW$157
    2895              
    2896                      .dwattr $C$DW$154, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boot
    2897                      .dwattr $C$DW$154, DW_AT_TI_end_line(0x33b)
    2898                      .dwattr $C$DW$154, DW_AT_TI_end_column(0x01)
    2899                      .dwendentry
    2900                      .dwendtag $C$DW$154
    2901              
    2902              ;**************************************************************
    2903              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2904              ;**************************************************************
    2905                      .global _c1brom_init_pie_vect_table
    2906                      .global _c1brom_init_pie_control
    2907                      .global _c1brom_handle_nmi_at_start
    2908                      .global _c1brom_c2c1_ipc_int1_isr
    2909                      .global _c1brom_handle_nmi
    2910                      .global _c1brom_itrap_isr
    2911                      .global _sysctl_wdog_enable
    2912                      .global _SelectBootMode
    2913                      .global _Parallel_Boot
    2914                      .global _USB_Boot
    2915                      .global _iTrap_addr
    2916                      .global _I2C_Boot
    2917                      .global _SCI_Boot
    2918                      .global _SPI_Boot
    2919                      .global _DCAN_Boot
    2920                      .global _NmiIntruptRegs
    2921                      .global _PieCtrlRegs
    2922                      .global _DcsmRegsZ1
    2923                      .global _DcsmRegsZ2
    2924                      .global _GpioDataRegs
    2925                      .global _ClkCfgRegs
    2926                      .global _AnalogSubsysRegs
    2927                      .global _CpuSysRegs
    2928                      .global _DevCfgRegs
    2929                      .global _GpioCtrlRegs
    2930                      .global _FlashCtrlRegs
    2931                      .global _PieVectTable
    2932              
    2933              ;***************************************************************
    2934              ;* TYPE INFORMATION                                            *
    2935              ;***************************************************************
    2936              
    2937              $C$DW$T$683     .dwtag  DW_TAG_enumeration_type
    2938                      .dwattr $C$DW$T$683, DW_AT_byte_size(0x01)
    2939              $C$DW$159       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
    2940              $C$DW$160       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
    2941              $C$DW$161       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
    2942              $C$DW$162       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
    2943                      .dwendtag $C$DW$T$683
    2944              
    2945              $C$DW$T$684     .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   59

    2946                      .dwattr $C$DW$T$684, DW_AT_type(*$C$DW$T$683)
    2947                      .dwattr $C$DW$T$684, DW_AT_language(DW_LANG_C)
    2948              
    2949              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2950                      .dwattr $C$DW$T$23, DW_AT_name("ANALOG_SUBSYS_REGS")
    2951                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x66)
    2952              $C$DW$163       .dwtag  DW_TAG_member
    2953                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    2954                      .dwattr $C$DW$163, DW_AT_name("rsvd1")
    2955                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd1")
    2956                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2957                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2958              $C$DW$164       .dwtag  DW_TAG_member
    2959                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$440)
    2960                      .dwattr $C$DW$164, DW_AT_name("INTOSC1TRIM")
    2961                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2962                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2963                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2964              $C$DW$165       .dwtag  DW_TAG_member
    2965                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$444)
    2966                      .dwattr $C$DW$165, DW_AT_name("INTOSC2TRIM")
    2967                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2968                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2969                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2970              $C$DW$166       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    2972                      .dwattr $C$DW$166, DW_AT_name("INTERNALTESTCTL")
    2973                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_INTERNALTESTCTL")
    2974                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2975                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2976              $C$DW$167       .dwtag  DW_TAG_member
    2977                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$630)
    2978                      .dwattr $C$DW$167, DW_AT_name("TSNSCTL")
    2979                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_TSNSCTL")
    2980                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2981                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2982              $C$DW$168       .dwtag  DW_TAG_member
    2983                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$25)
    2984                      .dwattr $C$DW$168, DW_AT_name("ANAREFCTL")
    2985                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ANAREFCTL")
    2986                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2987                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2988              $C$DW$169       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$634)
    2990                      .dwattr $C$DW$169, DW_AT_name("VMONCTL")
    2991                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_VMONCTL")
    2992                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2993                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2994              $C$DW$170       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$636)
    2996                      .dwattr $C$DW$170, DW_AT_name("VMONSTS")
    2997                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_VMONSTS")
    2998                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2999                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3000              $C$DW$171       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   60

    3001                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$632)
    3002                      .dwattr $C$DW$171, DW_AT_name("VMONCLR")
    3003                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_VMONCLR")
    3004                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3005                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3006              $C$DW$172       .dwtag  DW_TAG_member
    3007                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$638)
    3008                      .dwattr $C$DW$172, DW_AT_name("VREGCTL")
    3009                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_VREGCTL")
    3010                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    3011                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3012              $C$DW$173       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$448)
    3014                      .dwattr $C$DW$173, DW_AT_name("LOCK")
    3015                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_LOCK")
    3016                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3017                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3018              $C$DW$174       .dwtag  DW_TAG_member
    3019                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$438)
    3020                      .dwattr $C$DW$174, DW_AT_name("INTOSC1CSR")
    3021                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INTOSC1CSR")
    3022                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3023                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3024              $C$DW$175       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$442)
    3026                      .dwattr $C$DW$175, DW_AT_name("INTOSC2CSR")
    3027                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_INTOSC2CSR")
    3028                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    3029                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3030              $C$DW$176       .dwtag  DW_TAG_member
    3031                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    3032                      .dwattr $C$DW$176, DW_AT_name("TSNSCFG")
    3033                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_TSNSCFG")
    3034                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3035                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3036              $C$DW$177       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$469)
    3038                      .dwattr $C$DW$177, DW_AT_name("OSCREFTRIM")
    3039                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_OSCREFTRIM")
    3040                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3041                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3042              $C$DW$178       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$27)
    3044                      .dwattr $C$DW$178, DW_AT_name("ANAREFTRIM1")
    3045                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ANAREFTRIM1")
    3046                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3047                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3048              $C$DW$179       .dwtag  DW_TAG_member
    3049                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$29)
    3050                      .dwattr $C$DW$179, DW_AT_name("ANAREFTRIM2")
    3051                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ANAREFTRIM2")
    3052                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3053                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3054              $C$DW$180       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   61

    3056                      .dwattr $C$DW$180, DW_AT_name("ANAREFTRIM3")
    3057                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ANAREFTRIM3")
    3058                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3059                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3060              $C$DW$181       .dwtag  DW_TAG_member
    3061                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$33)
    3062                      .dwattr $C$DW$181, DW_AT_name("ANAREFTRIM4")
    3063                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ANAREFTRIM4")
    3064                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3065                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3066              $C$DW$182       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$570)
    3068                      .dwattr $C$DW$182, DW_AT_name("PMMREFTRIM")
    3069                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PMMREFTRIM")
    3070                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3071                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3072              $C$DW$183       .dwtag  DW_TAG_member
    3073                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$574)
    3074                      .dwattr $C$DW$183, DW_AT_name("PMMVREGTRIM")
    3075                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PMMVREGTRIM")
    3076                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3077                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3078              $C$DW$184       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$572)
    3080                      .dwattr $C$DW$184, DW_AT_name("PMMVMONTRIM")
    3081                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PMMVMONTRIM")
    3082                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3083                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3084              $C$DW$185       .dwtag  DW_TAG_member
    3085                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$568)
    3086                      .dwattr $C$DW$185, DW_AT_name("PMMCSR")
    3087                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PMMCSR")
    3088                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3089                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3090              $C$DW$186       .dwtag  DW_TAG_member
    3091                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$626)
    3092                      .dwattr $C$DW$186, DW_AT_name("TESTANACTL")
    3093                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_TESTANACTL")
    3094                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    3095                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$187       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$22)
    3098                      .dwattr $C$DW$187, DW_AT_name("rsvd")
    3099                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd")
    3100                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3101                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3102                      .dwendtag $C$DW$T$23
    3103              
    3104              $C$DW$188       .dwtag  DW_TAG_TI_far_type
    3105                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$23)
    3106              $C$DW$T$687     .dwtag  DW_TAG_volatile_type
    3107                      .dwattr $C$DW$T$687, DW_AT_type(*$C$DW$188)
    3108              
    3109              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3110                      .dwattr $C$DW$T$24, DW_AT_name("ANAREFCTL_BITS")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   62

    3111                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    3112              $C$DW$189       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3114                      .dwattr $C$DW$189, DW_AT_name("ANAREF1SEL")
    3115                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_ANAREF1SEL")
    3116                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3117                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3118                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3119              $C$DW$190       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3121                      .dwattr $C$DW$190, DW_AT_name("ANAREF2SEL")
    3122                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_ANAREF2SEL")
    3123                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3124                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3125                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3126              $C$DW$191       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3128                      .dwattr $C$DW$191, DW_AT_name("ANAREF3SEL")
    3129                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_ANAREF3SEL")
    3130                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3131                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3132                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3133              $C$DW$192       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3135                      .dwattr $C$DW$192, DW_AT_name("ANAREF4SEL")
    3136                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_ANAREF4SEL")
    3137                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3138                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3139                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3140              $C$DW$193       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3142                      .dwattr $C$DW$193, DW_AT_name("rsvd1")
    3143                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd1")
    3144                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    3145                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3146                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3147                      .dwendtag $C$DW$T$24
    3148              
    3149              
    3150              $C$DW$T$25      .dwtag  DW_TAG_union_type
    3151                      .dwattr $C$DW$T$25, DW_AT_name("ANAREFCTL_REG")
    3152                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    3153              $C$DW$194       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3155                      .dwattr $C$DW$194, DW_AT_name("all")
    3156                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    3157                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3159              $C$DW$195       .dwtag  DW_TAG_member
    3160                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$24)
    3161                      .dwattr $C$DW$195, DW_AT_name("bit")
    3162                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    3163                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3164                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3165                      .dwendtag $C$DW$T$25
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   63

    3166              
    3167              
    3168              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3169                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIM1_BITS")
    3170                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    3171              $C$DW$196       .dwtag  DW_TAG_member
    3172                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3173                      .dwattr $C$DW$196, DW_AT_name("BGVALTRIM")
    3174                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_BGVALTRIM")
    3175                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    3176                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3177                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3178              $C$DW$197       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    3180                      .dwattr $C$DW$197, DW_AT_name("BGSLOPETRIM")
    3181                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    3182                      .dwattr $C$DW$197, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    3183                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3184                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3185              $C$DW$198       .dwtag  DW_TAG_member
    3186                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    3187                      .dwattr $C$DW$198, DW_AT_name("IREFTRIM")
    3188                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_IREFTRIM")
    3189                      .dwattr $C$DW$198, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    3190                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3191                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3192              $C$DW$199       .dwtag  DW_TAG_member
    3193                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3194                      .dwattr $C$DW$199, DW_AT_name("CONFIG")
    3195                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CONFIG")
    3196                      .dwattr $C$DW$199, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3197                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3198                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3199              $C$DW$200       .dwtag  DW_TAG_member
    3200                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3201                      .dwattr $C$DW$200, DW_AT_name("rsvd1")
    3202                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd1")
    3203                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3204                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3205                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3206                      .dwendtag $C$DW$T$26
    3207              
    3208              
    3209              $C$DW$T$27      .dwtag  DW_TAG_union_type
    3210                      .dwattr $C$DW$T$27, DW_AT_name("ANAREFTRIM1_REG")
    3211                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    3212              $C$DW$201       .dwtag  DW_TAG_member
    3213                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    3214                      .dwattr $C$DW$201, DW_AT_name("all")
    3215                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    3216                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3217                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3218              $C$DW$202       .dwtag  DW_TAG_member
    3219                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$26)
    3220                      .dwattr $C$DW$202, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   64

    3221                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    3222                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3223                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3224                      .dwendtag $C$DW$T$27
    3225              
    3226              
    3227              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3228                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIM2_BITS")
    3229                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    3230              $C$DW$203       .dwtag  DW_TAG_member
    3231                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3232                      .dwattr $C$DW$203, DW_AT_name("BGVALTRIM")
    3233                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_BGVALTRIM")
    3234                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    3235                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3236                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3237              $C$DW$204       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3239                      .dwattr $C$DW$204, DW_AT_name("BGSLOPETRIM")
    3240                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    3241                      .dwattr $C$DW$204, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    3242                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3243                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3244              $C$DW$205       .dwtag  DW_TAG_member
    3245                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3246                      .dwattr $C$DW$205, DW_AT_name("IREFTRIM")
    3247                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_IREFTRIM")
    3248                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    3249                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3250                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3251              $C$DW$206       .dwtag  DW_TAG_member
    3252                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3253                      .dwattr $C$DW$206, DW_AT_name("CONFIG")
    3254                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CONFIG")
    3255                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3256                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3257                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3258              $C$DW$207       .dwtag  DW_TAG_member
    3259                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3260                      .dwattr $C$DW$207, DW_AT_name("rsvd1")
    3261                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd1")
    3262                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3263                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3264                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3265                      .dwendtag $C$DW$T$28
    3266              
    3267              
    3268              $C$DW$T$29      .dwtag  DW_TAG_union_type
    3269                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIM2_REG")
    3270                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    3271              $C$DW$208       .dwtag  DW_TAG_member
    3272                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    3273                      .dwattr $C$DW$208, DW_AT_name("all")
    3274                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    3275                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   65

    3276                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3277              $C$DW$209       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$28)
    3279                      .dwattr $C$DW$209, DW_AT_name("bit")
    3280                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    3281                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3282                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3283                      .dwendtag $C$DW$T$29
    3284              
    3285              
    3286              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3287                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIM3_BITS")
    3288                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    3289              $C$DW$210       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3291                      .dwattr $C$DW$210, DW_AT_name("BGVALTRIM")
    3292                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_BGVALTRIM")
    3293                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    3294                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3295                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3296              $C$DW$211       .dwtag  DW_TAG_member
    3297                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3298                      .dwattr $C$DW$211, DW_AT_name("BGSLOPETRIM")
    3299                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    3300                      .dwattr $C$DW$211, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    3301                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3302                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3303              $C$DW$212       .dwtag  DW_TAG_member
    3304                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3305                      .dwattr $C$DW$212, DW_AT_name("IREFTRIM")
    3306                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_IREFTRIM")
    3307                      .dwattr $C$DW$212, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    3308                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3309                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3310              $C$DW$213       .dwtag  DW_TAG_member
    3311                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3312                      .dwattr $C$DW$213, DW_AT_name("CONFIG")
    3313                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_CONFIG")
    3314                      .dwattr $C$DW$213, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3315                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3316                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3317              $C$DW$214       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3319                      .dwattr $C$DW$214, DW_AT_name("rsvd1")
    3320                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_rsvd1")
    3321                      .dwattr $C$DW$214, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3322                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3323                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3324                      .dwendtag $C$DW$T$30
    3325              
    3326              
    3327              $C$DW$T$31      .dwtag  DW_TAG_union_type
    3328                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIM3_REG")
    3329                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    3330              $C$DW$215       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   66

    3331                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
    3332                      .dwattr $C$DW$215, DW_AT_name("all")
    3333                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_all")
    3334                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3335                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3336              $C$DW$216       .dwtag  DW_TAG_member
    3337                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$30)
    3338                      .dwattr $C$DW$216, DW_AT_name("bit")
    3339                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_bit")
    3340                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3341                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3342                      .dwendtag $C$DW$T$31
    3343              
    3344              
    3345              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3346                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIM4_BITS")
    3347                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    3348              $C$DW$217       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3350                      .dwattr $C$DW$217, DW_AT_name("BGVALTRIM")
    3351                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_BGVALTRIM")
    3352                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    3353                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3354                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3355              $C$DW$218       .dwtag  DW_TAG_member
    3356                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3357                      .dwattr $C$DW$218, DW_AT_name("BGSLOPETRIM")
    3358                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    3359                      .dwattr $C$DW$218, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    3360                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3361                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3362              $C$DW$219       .dwtag  DW_TAG_member
    3363                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3364                      .dwattr $C$DW$219, DW_AT_name("IREFTRIM")
    3365                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_IREFTRIM")
    3366                      .dwattr $C$DW$219, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    3367                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3368                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3369              $C$DW$220       .dwtag  DW_TAG_member
    3370                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3371                      .dwattr $C$DW$220, DW_AT_name("CONFIG")
    3372                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_CONFIG")
    3373                      .dwattr $C$DW$220, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3374                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3375                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3376              $C$DW$221       .dwtag  DW_TAG_member
    3377                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3378                      .dwattr $C$DW$221, DW_AT_name("rsvd1")
    3379                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd1")
    3380                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3381                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3382                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3383                      .dwendtag $C$DW$T$32
    3384              
    3385              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   67

    3386              $C$DW$T$33      .dwtag  DW_TAG_union_type
    3387                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIM4_REG")
    3388                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    3389              $C$DW$222       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$21)
    3391                      .dwattr $C$DW$222, DW_AT_name("all")
    3392                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_all")
    3393                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3394                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3395              $C$DW$223       .dwtag  DW_TAG_member
    3396                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$32)
    3397                      .dwattr $C$DW$223, DW_AT_name("bit")
    3398                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_bit")
    3399                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3400                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3401                      .dwendtag $C$DW$T$33
    3402              
    3403              
    3404              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3405                      .dwattr $C$DW$T$34, DW_AT_name("AUXCLKDIVSEL_BITS")
    3406                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    3407              $C$DW$224       .dwtag  DW_TAG_member
    3408                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3409                      .dwattr $C$DW$224, DW_AT_name("AUXPLLDIV")
    3410                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_AUXPLLDIV")
    3411                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3412                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3413                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3414              $C$DW$225       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3416                      .dwattr $C$DW$225, DW_AT_name("rsvd1")
    3417                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd1")
    3418                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3419                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3420                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3421              $C$DW$226       .dwtag  DW_TAG_member
    3422                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3423                      .dwattr $C$DW$226, DW_AT_name("rsvd2")
    3424                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_rsvd2")
    3425                      .dwattr $C$DW$226, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3426                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3427                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3428                      .dwendtag $C$DW$T$34
    3429              
    3430              
    3431              $C$DW$T$35      .dwtag  DW_TAG_union_type
    3432                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_REG")
    3433                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3434              $C$DW$227       .dwtag  DW_TAG_member
    3435                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$21)
    3436                      .dwattr $C$DW$227, DW_AT_name("all")
    3437                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_all")
    3438                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3439                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$228       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   68

    3441                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$34)
    3442                      .dwattr $C$DW$228, DW_AT_name("bit")
    3443                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_bit")
    3444                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3445                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3446                      .dwendtag $C$DW$T$35
    3447              
    3448              
    3449              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3450                      .dwattr $C$DW$T$36, DW_AT_name("AUXPLLCTL1_BITS")
    3451                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3452              $C$DW$229       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3454                      .dwattr $C$DW$229, DW_AT_name("PLLEN")
    3455                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PLLEN")
    3456                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3457                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3458                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3459              $C$DW$230       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3461                      .dwattr $C$DW$230, DW_AT_name("PLLCLKEN")
    3462                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_PLLCLKEN")
    3463                      .dwattr $C$DW$230, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3464                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3465                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3466              $C$DW$231       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3468                      .dwattr $C$DW$231, DW_AT_name("rsvd1")
    3469                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd1")
    3470                      .dwattr $C$DW$231, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3471                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3472                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3473              $C$DW$232       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3475                      .dwattr $C$DW$232, DW_AT_name("rsvd2")
    3476                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd2")
    3477                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3478                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3479                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3480                      .dwendtag $C$DW$T$36
    3481              
    3482              
    3483              $C$DW$T$37      .dwtag  DW_TAG_union_type
    3484                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_REG")
    3485                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    3486              $C$DW$233       .dwtag  DW_TAG_member
    3487                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$21)
    3488                      .dwattr $C$DW$233, DW_AT_name("all")
    3489                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_all")
    3490                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3491                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3492              $C$DW$234       .dwtag  DW_TAG_member
    3493                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$36)
    3494                      .dwattr $C$DW$234, DW_AT_name("bit")
    3495                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   69

    3496                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3497                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3498                      .dwendtag $C$DW$T$37
    3499              
    3500              
    3501              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3502                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLMULT_BITS")
    3503                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    3504              $C$DW$235       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    3506                      .dwattr $C$DW$235, DW_AT_name("IMULT")
    3507                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_IMULT")
    3508                      .dwattr $C$DW$235, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    3509                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3510                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3511              $C$DW$236       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3513                      .dwattr $C$DW$236, DW_AT_name("rsvd1")
    3514                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd1")
    3515                      .dwattr $C$DW$236, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3516                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3517                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3518              $C$DW$237       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3520                      .dwattr $C$DW$237, DW_AT_name("FMULT")
    3521                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_FMULT")
    3522                      .dwattr $C$DW$237, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3523                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3525              $C$DW$238       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3527                      .dwattr $C$DW$238, DW_AT_name("rsvd2")
    3528                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd2")
    3529                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    3530                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3531                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3532              $C$DW$239       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    3534                      .dwattr $C$DW$239, DW_AT_name("rsvd3")
    3535                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd3")
    3536                      .dwattr $C$DW$239, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3537                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3538                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3539                      .dwendtag $C$DW$T$38
    3540              
    3541              
    3542              $C$DW$T$39      .dwtag  DW_TAG_union_type
    3543                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_REG")
    3544                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    3545              $C$DW$240       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$21)
    3547                      .dwattr $C$DW$240, DW_AT_name("all")
    3548                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_all")
    3549                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3550                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   70

    3551              $C$DW$241       .dwtag  DW_TAG_member
    3552                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$38)
    3553                      .dwattr $C$DW$241, DW_AT_name("bit")
    3554                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_bit")
    3555                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3556                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3557                      .dwendtag $C$DW$T$39
    3558              
    3559              
    3560              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3561                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLSTS_BITS")
    3562                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    3563              $C$DW$242       .dwtag  DW_TAG_member
    3564                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3565                      .dwattr $C$DW$242, DW_AT_name("LOCKS")
    3566                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_LOCKS")
    3567                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3568                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3569                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3570              $C$DW$243       .dwtag  DW_TAG_member
    3571                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3572                      .dwattr $C$DW$243, DW_AT_name("SLIPS")
    3573                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_SLIPS")
    3574                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3575                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3576                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3577              $C$DW$244       .dwtag  DW_TAG_member
    3578                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3579                      .dwattr $C$DW$244, DW_AT_name("rsvd1")
    3580                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_rsvd1")
    3581                      .dwattr $C$DW$244, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3582                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3583                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3584              $C$DW$245       .dwtag  DW_TAG_member
    3585                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3586                      .dwattr $C$DW$245, DW_AT_name("rsvd2")
    3587                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_rsvd2")
    3588                      .dwattr $C$DW$245, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3589                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3590                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3591                      .dwendtag $C$DW$T$40
    3592              
    3593              
    3594              $C$DW$T$41      .dwtag  DW_TAG_union_type
    3595                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_REG")
    3596                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    3597              $C$DW$246       .dwtag  DW_TAG_member
    3598                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    3599                      .dwattr $C$DW$246, DW_AT_name("all")
    3600                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_all")
    3601                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3602                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3603              $C$DW$247       .dwtag  DW_TAG_member
    3604                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$40)
    3605                      .dwattr $C$DW$247, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   71

    3606                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_bit")
    3607                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3608                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3609                      .dwendtag $C$DW$T$41
    3610              
    3611              
    3612              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3613                      .dwattr $C$DW$T$42, DW_AT_name("CCR_BITS")
    3614                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3615              $C$DW$248       .dwtag  DW_TAG_member
    3616                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3617                      .dwattr $C$DW$248, DW_AT_name("VMAPS")
    3618                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_VMAPS")
    3619                      .dwattr $C$DW$248, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3620                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3621                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3622              $C$DW$249       .dwtag  DW_TAG_member
    3623                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3624                      .dwattr $C$DW$249, DW_AT_name("MONPRIV")
    3625                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_MONPRIV")
    3626                      .dwattr $C$DW$249, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3627                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3628                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3629              $C$DW$250       .dwtag  DW_TAG_member
    3630                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    3631                      .dwattr $C$DW$250, DW_AT_name("ENPROT")
    3632                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_ENPROT")
    3633                      .dwattr $C$DW$250, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3634                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3635                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3636              $C$DW$251       .dwtag  DW_TAG_member
    3637                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3638                      .dwattr $C$DW$251, DW_AT_name("rsvd1")
    3639                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_rsvd1")
    3640                      .dwattr $C$DW$251, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    3641                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3642                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3643              $C$DW$252       .dwtag  DW_TAG_member
    3644                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3645                      .dwattr $C$DW$252, DW_AT_name("rsvd2")
    3646                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_rsvd2")
    3647                      .dwattr $C$DW$252, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3648                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3649                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3650                      .dwendtag $C$DW$T$42
    3651              
    3652              
    3653              $C$DW$T$43      .dwtag  DW_TAG_union_type
    3654                      .dwattr $C$DW$T$43, DW_AT_name("CCR_REG")
    3655                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3656              $C$DW$253       .dwtag  DW_TAG_member
    3657                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$21)
    3658                      .dwattr $C$DW$253, DW_AT_name("all")
    3659                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_all")
    3660                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   72

    3661                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3662              $C$DW$254       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$42)
    3664                      .dwattr $C$DW$254, DW_AT_name("bit")
    3665                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_bit")
    3666                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3667                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3668                      .dwendtag $C$DW$T$43
    3669              
    3670              
    3671              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3672                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_BITS")
    3673                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3674              $C$DW$255       .dwtag  DW_TAG_member
    3675                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    3676                      .dwattr $C$DW$255, DW_AT_name("CLKSRCCTL1")
    3677                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3678                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3679                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3680                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3681              $C$DW$256       .dwtag  DW_TAG_member
    3682                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3683                      .dwattr $C$DW$256, DW_AT_name("CLKSRCCTL2")
    3684                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3685                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3686                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3687                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3688              $C$DW$257       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3690                      .dwattr $C$DW$257, DW_AT_name("CLKSRCCTL3")
    3691                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3692                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3693                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3694                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3695              $C$DW$258       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3697                      .dwattr $C$DW$258, DW_AT_name("SYSPLLCTL1")
    3698                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3699                      .dwattr $C$DW$258, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3700                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3701                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3702              $C$DW$259       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3704                      .dwattr $C$DW$259, DW_AT_name("SYSPLLCTL2")
    3705                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    3706                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3707                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3708                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3709              $C$DW$260       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3711                      .dwattr $C$DW$260, DW_AT_name("SYSPLLCTL3")
    3712                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    3713                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3714                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3715                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   73

    3716              $C$DW$261       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3718                      .dwattr $C$DW$261, DW_AT_name("SYSPLLMULT")
    3719                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3720                      .dwattr $C$DW$261, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3721                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3722                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3723              $C$DW$262       .dwtag  DW_TAG_member
    3724                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3725                      .dwattr $C$DW$262, DW_AT_name("AUXPLLCTL1")
    3726                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3727                      .dwattr $C$DW$262, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3728                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3729                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$263       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3732                      .dwattr $C$DW$263, DW_AT_name("rsvd1")
    3733                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_rsvd1")
    3734                      .dwattr $C$DW$263, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3735                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3736                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3737              $C$DW$264       .dwtag  DW_TAG_member
    3738                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3739                      .dwattr $C$DW$264, DW_AT_name("AUXPLLMULT")
    3740                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3741                      .dwattr $C$DW$264, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3742                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3743                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3744              $C$DW$265       .dwtag  DW_TAG_member
    3745                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3746                      .dwattr $C$DW$265, DW_AT_name("SYSCLKDIVSEL")
    3747                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3748                      .dwattr $C$DW$265, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3749                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3750                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3751              $C$DW$266       .dwtag  DW_TAG_member
    3752                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3753                      .dwattr $C$DW$266, DW_AT_name("AUXCLKDIVSEL")
    3754                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3755                      .dwattr $C$DW$266, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3756                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3757                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3758              $C$DW$267       .dwtag  DW_TAG_member
    3759                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3760                      .dwattr $C$DW$267, DW_AT_name("PERCLKDIVSEL")
    3761                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3762                      .dwattr $C$DW$267, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3763                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3764                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3765              $C$DW$268       .dwtag  DW_TAG_member
    3766                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3767                      .dwattr $C$DW$268, DW_AT_name("rsvd2")
    3768                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_rsvd2")
    3769                      .dwattr $C$DW$268, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3770                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   74

    3771                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3772              $C$DW$269       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3774                      .dwattr $C$DW$269, DW_AT_name("LOSPCP")
    3775                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_LOSPCP")
    3776                      .dwattr $C$DW$269, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3777                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3778                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3779              $C$DW$270       .dwtag  DW_TAG_member
    3780                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3781                      .dwattr $C$DW$270, DW_AT_name("rsvd3")
    3782                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd3")
    3783                      .dwattr $C$DW$270, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3784                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3785                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3786                      .dwendtag $C$DW$T$44
    3787              
    3788              
    3789              $C$DW$T$45      .dwtag  DW_TAG_union_type
    3790                      .dwattr $C$DW$T$45, DW_AT_name("CLKCFGLOCK1_REG")
    3791                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    3792              $C$DW$271       .dwtag  DW_TAG_member
    3793                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    3794                      .dwattr $C$DW$271, DW_AT_name("all")
    3795                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_all")
    3796                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3797                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3798              $C$DW$272       .dwtag  DW_TAG_member
    3799                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$44)
    3800                      .dwattr $C$DW$272, DW_AT_name("bit")
    3801                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_bit")
    3802                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3803                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3804                      .dwendtag $C$DW$T$45
    3805              
    3806              
    3807              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3808                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_BITS")
    3809                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3810              $C$DW$273       .dwtag  DW_TAG_member
    3811                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    3812                      .dwattr $C$DW$273, DW_AT_name("SEM")
    3813                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_SEM")
    3814                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3815                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3816                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3817              $C$DW$274       .dwtag  DW_TAG_member
    3818                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3819                      .dwattr $C$DW$274, DW_AT_name("rsvd1")
    3820                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_rsvd1")
    3821                      .dwattr $C$DW$274, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3822                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3823                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3824              $C$DW$275       .dwtag  DW_TAG_member
    3825                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   75

    3826                      .dwattr $C$DW$275, DW_AT_name("KEY")
    3827                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_KEY")
    3828                      .dwattr $C$DW$275, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3829                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3830                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3831                      .dwendtag $C$DW$T$46
    3832              
    3833              
    3834              $C$DW$T$47      .dwtag  DW_TAG_union_type
    3835                      .dwattr $C$DW$T$47, DW_AT_name("CLKSEM_REG")
    3836                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3837              $C$DW$276       .dwtag  DW_TAG_member
    3838                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$21)
    3839                      .dwattr $C$DW$276, DW_AT_name("all")
    3840                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_all")
    3841                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3843              $C$DW$277       .dwtag  DW_TAG_member
    3844                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$46)
    3845                      .dwattr $C$DW$277, DW_AT_name("bit")
    3846                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_bit")
    3847                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3848                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3849                      .dwendtag $C$DW$T$47
    3850              
    3851              
    3852              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3853                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_BITS")
    3854                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3855              $C$DW$278       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    3857                      .dwattr $C$DW$278, DW_AT_name("OSCCLKSRCSEL")
    3858                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    3859                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3860                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3862              $C$DW$279       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    3864                      .dwattr $C$DW$279, DW_AT_name("rsvd1")
    3865                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_rsvd1")
    3866                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3867                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3868                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3869              $C$DW$280       .dwtag  DW_TAG_member
    3870                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    3871                      .dwattr $C$DW$280, DW_AT_name("INTOSC2OFF")
    3872                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_INTOSC2OFF")
    3873                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3874                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3875                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$281       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    3878                      .dwattr $C$DW$281, DW_AT_name("XTALOFF")
    3879                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_XTALOFF")
    3880                      .dwattr $C$DW$281, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   76

    3881                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3882                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$282       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    3885                      .dwattr $C$DW$282, DW_AT_name("WDHALTI")
    3886                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_WDHALTI")
    3887                      .dwattr $C$DW$282, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3888                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3889                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$283       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    3892                      .dwattr $C$DW$283, DW_AT_name("rsvd2")
    3893                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_rsvd2")
    3894                      .dwattr $C$DW$283, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    3895                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3896                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$284       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    3899                      .dwattr $C$DW$284, DW_AT_name("rsvd3")
    3900                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_rsvd3")
    3901                      .dwattr $C$DW$284, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3902                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3903                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3904                      .dwendtag $C$DW$T$48
    3905              
    3906              
    3907              $C$DW$T$49      .dwtag  DW_TAG_union_type
    3908                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL1_REG")
    3909                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3910              $C$DW$285       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$21)
    3912                      .dwattr $C$DW$285, DW_AT_name("all")
    3913                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_all")
    3914                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3915                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3916              $C$DW$286       .dwtag  DW_TAG_member
    3917                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$48)
    3918                      .dwattr $C$DW$286, DW_AT_name("bit")
    3919                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_bit")
    3920                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3921                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3922                      .dwendtag $C$DW$T$49
    3923              
    3924              
    3925              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3926                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_BITS")
    3927                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3928              $C$DW$287       .dwtag  DW_TAG_member
    3929                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    3930                      .dwattr $C$DW$287, DW_AT_name("AUXOSCCLKSRCSEL")
    3931                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3932                      .dwattr $C$DW$287, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3933                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3934                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3935              $C$DW$288       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   77

    3936                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3937                      .dwattr $C$DW$288, DW_AT_name("CANABCLKSEL")
    3938                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3939                      .dwattr $C$DW$288, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3940                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3941                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3942              $C$DW$289       .dwtag  DW_TAG_member
    3943                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    3944                      .dwattr $C$DW$289, DW_AT_name("CANBBCLKSEL")
    3945                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3946                      .dwattr $C$DW$289, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    3947                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3948                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3949              $C$DW$290       .dwtag  DW_TAG_member
    3950                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    3951                      .dwattr $C$DW$290, DW_AT_name("rsvd1")
    3952                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_rsvd1")
    3953                      .dwattr $C$DW$290, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    3954                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3955                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3956              $C$DW$291       .dwtag  DW_TAG_member
    3957                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    3958                      .dwattr $C$DW$291, DW_AT_name("rsvd2")
    3959                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_rsvd2")
    3960                      .dwattr $C$DW$291, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3961                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3962                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3963                      .dwendtag $C$DW$T$50
    3964              
    3965              
    3966              $C$DW$T$51      .dwtag  DW_TAG_union_type
    3967                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL2_REG")
    3968                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3969              $C$DW$292       .dwtag  DW_TAG_member
    3970                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$21)
    3971                      .dwattr $C$DW$292, DW_AT_name("all")
    3972                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_all")
    3973                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3974                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3975              $C$DW$293       .dwtag  DW_TAG_member
    3976                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$50)
    3977                      .dwattr $C$DW$293, DW_AT_name("bit")
    3978                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_bit")
    3979                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3980                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3981                      .dwendtag $C$DW$T$51
    3982              
    3983              
    3984              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3985                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_BITS")
    3986                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3987              $C$DW$294       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    3989                      .dwattr $C$DW$294, DW_AT_name("XCLKOUTSEL")
    3990                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_XCLKOUTSEL")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   78

    3991                      .dwattr $C$DW$294, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    3992                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3993                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3994              $C$DW$295       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    3996                      .dwattr $C$DW$295, DW_AT_name("rsvd1")
    3997                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_rsvd1")
    3998                      .dwattr $C$DW$295, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    3999                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4000                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4001              $C$DW$296       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    4003                      .dwattr $C$DW$296, DW_AT_name("rsvd2")
    4004                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_rsvd2")
    4005                      .dwattr $C$DW$296, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    4006                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4007                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4008                      .dwendtag $C$DW$T$52
    4009              
    4010              
    4011              $C$DW$T$53      .dwtag  DW_TAG_union_type
    4012                      .dwattr $C$DW$T$53, DW_AT_name("CLKSRCCTL3_REG")
    4013                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    4014              $C$DW$297       .dwtag  DW_TAG_member
    4015                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$21)
    4016                      .dwattr $C$DW$297, DW_AT_name("all")
    4017                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_all")
    4018                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4019                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4020              $C$DW$298       .dwtag  DW_TAG_member
    4021                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$52)
    4022                      .dwattr $C$DW$298, DW_AT_name("bit")
    4023                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_bit")
    4024                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4025                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4026                      .dwendtag $C$DW$T$53
    4027              
    4028              
    4029              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4030                      .dwattr $C$DW$T$56, DW_AT_name("CLK_CFG_REGS")
    4031                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x32)
    4032              $C$DW$299       .dwtag  DW_TAG_member
    4033                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$47)
    4034                      .dwattr $C$DW$299, DW_AT_name("CLKSEM")
    4035                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_CLKSEM")
    4036                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4037                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4038              $C$DW$300       .dwtag  DW_TAG_member
    4039                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$45)
    4040                      .dwattr $C$DW$300, DW_AT_name("CLKCFGLOCK1")
    4041                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    4042                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4043                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4044              $C$DW$301       .dwtag  DW_TAG_member
    4045                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$54)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   79

    4046                      .dwattr $C$DW$301, DW_AT_name("rsvd1")
    4047                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_rsvd1")
    4048                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4049                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4050              $C$DW$302       .dwtag  DW_TAG_member
    4051                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$49)
    4052                      .dwattr $C$DW$302, DW_AT_name("CLKSRCCTL1")
    4053                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    4054                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4055                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4056              $C$DW$303       .dwtag  DW_TAG_member
    4057                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$51)
    4058                      .dwattr $C$DW$303, DW_AT_name("CLKSRCCTL2")
    4059                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    4060                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4061                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4062              $C$DW$304       .dwtag  DW_TAG_member
    4063                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$53)
    4064                      .dwattr $C$DW$304, DW_AT_name("CLKSRCCTL3")
    4065                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    4066                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4067                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$305       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$616)
    4070                      .dwattr $C$DW$305, DW_AT_name("SYSPLLCTL1")
    4071                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    4072                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4073                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4074              $C$DW$306       .dwtag  DW_TAG_member
    4075                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$618)
    4076                      .dwattr $C$DW$306, DW_AT_name("SYSPLLCTL2")
    4077                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    4078                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4079                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4080              $C$DW$307       .dwtag  DW_TAG_member
    4081                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$620)
    4082                      .dwattr $C$DW$307, DW_AT_name("SYSPLLCTL3")
    4083                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    4084                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4085                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4086              $C$DW$308       .dwtag  DW_TAG_member
    4087                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$622)
    4088                      .dwattr $C$DW$308, DW_AT_name("SYSPLLMULT")
    4089                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_SYSPLLMULT")
    4090                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4091                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4092              $C$DW$309       .dwtag  DW_TAG_member
    4093                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$624)
    4094                      .dwattr $C$DW$309, DW_AT_name("SYSPLLSTS")
    4095                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_SYSPLLSTS")
    4096                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4097                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4098              $C$DW$310       .dwtag  DW_TAG_member
    4099                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$37)
    4100                      .dwattr $C$DW$310, DW_AT_name("AUXPLLCTL1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:59 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0913210                         PAGE   80

    4101                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    4102                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4103                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4104              $C$DW$311       .dwtag  DW_TAG_member
    4105                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$54)
    4106                      .dwattr $C$DW$311, DW_AT_name("rsvd2")
    4107                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_rsvd2")
    4108                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4109                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$312       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$39)
    4112                      .dwattr $C$DW$312, DW_AT_name("AUXPLLMULT")
    4113                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_AUXPLLMULT")
    4114                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4115                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4116              $C$DW$313       .dwtag  DW_TAG_member
    4117                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$41)
    4118                      .dwattr $C$DW$313, DW_AT_name("AUXPLLSTS")
    4119                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_AUXPLLSTS")
    4120                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4121                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4122              $C$DW$314       .dwtag  DW_TAG_member
    4123                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$612)
    4124                      .dwattr $C$DW$314, DW_AT_name("SYSCLKDIVSEL")
