TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:26:19 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("IpcRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_IpcRegs")

     855                      .dwattr $C$DW$32, DW_AT_TI_begin_line(0xda)
     856                      .dwattr $C$DW$32, DW_AT_TI_begin_column(0x12)
     857                      .dwattr $C$DW$32, DW_AT_TI_max_frame_size(-2)
     858                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     859              
     860                      .dwfde $C$DW$CIE, _c1brom_c2c1_ipc_read_data_protected_32
     861              
     862              ;***************************************************************
     863              ;* FNAME: _c1brom_c2c1_ipc_read_data_protected_32 FR SIZE:   0           *
     864              ;*                                                             *
     865              ;* FUNCTION ENVIRONMENT                                        *
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   17

     866              ;*                                                             *
     867              ;* FUNCTION PROPERTIES                                         *
     868              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     869              ;***************************************************************
     870              
     871 000000aa       _c1brom_c2c1_ipc_read_data_protected_32:
     872                      .dwcfi  cfa_offset, -2
     873                      .dwcfi  save_reg_to_mem, 26, 0
     874                      .dwcfi  save_reg_to_reg, 78, 26
     875                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     876 000000aa 7622   EALLOW
     877                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     878 000000ab 761F!         MOVW      DP,#_IpcRegs+26       ; [CPU_U] 
         000000ac 0000 
     879 000000ad 8A1A!         MOVL      XAR4,@_IpcRegs+26     ; [CPU_] |221| 
     880 000000ae 06C4          MOVL      ACC,*+XAR4[0]         ; [CPU_] |221| 
     881 000000af 1E1E!         MOVL      @_IpcRegs+30,ACC      ; [CPU_] |221| 
     882                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     883 000000b0 761A   EDIS
     884                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     885 000000b1 9A02          MOVB      AL,#2                 ; [CPU_] |223| 
     886                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     887 000000b2 FF69          SPM       #0                    ; [CPU_] 
     888              $C$DW$33        .dwtag  DW_TAG_TI_branch
     889                      .dwattr $C$DW$33, DW_AT_low_pc(0x00)
     890                      .dwattr $C$DW$33, DW_AT_TI_return
     891 000000b3 0006          LRETR     ; [CPU_] 
     892                      ; return occurs ; [] 
     893                      .dwattr $C$DW$32, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     894                      .dwattr $C$DW$32, DW_AT_TI_end_line(0xe0)
     895                      .dwattr $C$DW$32, DW_AT_TI_end_column(0x01)
     896                      .dwendentry
     897                      .dwendtag $C$DW$32
     898              
     899              ;**************************************************************
     900              ;* UNDEFINED EXTERNAL REFERENCES                              *
     901              ;**************************************************************
     902                      .global _IpcRegs
     903              
     904              ;***************************************************************
     905              ;* TYPE INFORMATION                                            *
     906              ;***************************************************************
     907              
     908              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
     909                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     910              $C$DW$34        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
     911              $C$DW$35        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
     912              $C$DW$36        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
     913              $C$DW$37        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
     914                      .dwendtag $C$DW$T$35
     915              
     916              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
     917                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
     918                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
     919              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   18

     920              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     921                      .dwattr $C$DW$T$20, DW_AT_name("IPCACK_BITS")
     922                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     923              $C$DW$38        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$38, DW_AT_name("IPC0")
     926                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_IPC0")
     927                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     928                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$39        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$39, DW_AT_name("IPC1")
     933                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_IPC1")
     934                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     935                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$40        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$40, DW_AT_name("IPC2")
     940                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_IPC2")
     941                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     942                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     944              $C$DW$41        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$41, DW_AT_name("IPC3")
     947                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_IPC3")
     948                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     949                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     951              $C$DW$42        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$42, DW_AT_name("IPC4")
     954                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_IPC4")
     955                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     956                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     958              $C$DW$43        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$43, DW_AT_name("IPC5")
     961                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_IPC5")
     962                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     963                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     964                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     965              $C$DW$44        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$44, DW_AT_name("IPC6")
     968                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_IPC6")
     969                      .dwattr $C$DW$44, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     970                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     971                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     972              $C$DW$45        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$45, DW_AT_name("IPC7")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   19

     975                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_IPC7")
     976                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     977                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$46        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$46, DW_AT_name("IPC8")
     982                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_IPC8")
     983                      .dwattr $C$DW$46, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     984                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     986              $C$DW$47        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$47, DW_AT_name("IPC9")
     989                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_IPC9")
     990                      .dwattr $C$DW$47, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     991                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     993              $C$DW$48        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     995                      .dwattr $C$DW$48, DW_AT_name("IPC10")
     996                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_IPC10")
     997                      .dwattr $C$DW$48, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1000              $C$DW$49        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$49, DW_AT_name("IPC11")
    1003                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_IPC11")
    1004                      .dwattr $C$DW$49, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1005                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1007              $C$DW$50        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$50, DW_AT_name("IPC12")
    1010                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_IPC12")
    1011                      .dwattr $C$DW$50, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1012                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1014              $C$DW$51        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$51, DW_AT_name("IPC13")
    1017                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_IPC13")
    1018                      .dwattr $C$DW$51, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1019                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$52        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$52, DW_AT_name("IPC14")
    1024                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_IPC14")
    1025                      .dwattr $C$DW$52, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1026                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1028              $C$DW$53        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   20

    1030                      .dwattr $C$DW$53, DW_AT_name("IPC15")
    1031                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_IPC15")
    1032                      .dwattr $C$DW$53, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1033                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1035              $C$DW$54        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$54, DW_AT_name("IPC16")
    1038                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_IPC16")
    1039                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1040                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1041                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$55        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1044                      .dwattr $C$DW$55, DW_AT_name("IPC17")
    1045                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_IPC17")
    1046                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1047                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1048                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1049              $C$DW$56        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1051                      .dwattr $C$DW$56, DW_AT_name("IPC18")
    1052                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_IPC18")
    1053                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1054                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1055                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1056              $C$DW$57        .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1058                      .dwattr $C$DW$57, DW_AT_name("IPC19")
    1059                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_IPC19")
    1060                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1061                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1062                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$58        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$58, DW_AT_name("IPC20")
    1066                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_IPC20")
    1067                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1068                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1069                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1070              $C$DW$59        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$59, DW_AT_name("IPC21")
    1073                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_IPC21")
    1074                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1076                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$60        .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$60, DW_AT_name("IPC22")
    1080                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_IPC22")
    1081                      .dwattr $C$DW$60, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1082                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1083                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$61        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   21

    1085                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$61, DW_AT_name("IPC23")
    1087                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_IPC23")
    1088                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1090                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$62        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$62, DW_AT_name("IPC24")
    1094                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_IPC24")
    1095                      .dwattr $C$DW$62, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1096                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1097                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$63        .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$63, DW_AT_name("IPC25")
    1101                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_IPC25")
    1102                      .dwattr $C$DW$63, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1103                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1104                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$64        .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$64, DW_AT_name("IPC26")
    1108                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_IPC26")
    1109                      .dwattr $C$DW$64, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1110                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1111                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1112              $C$DW$65        .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1114                      .dwattr $C$DW$65, DW_AT_name("IPC27")
    1115                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_IPC27")
    1116                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1117                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1118                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$66        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$66, DW_AT_name("IPC28")
    1122                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_IPC28")
    1123                      .dwattr $C$DW$66, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1125                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1126              $C$DW$67        .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$67, DW_AT_name("IPC29")
    1129                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_IPC29")
    1130                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1131                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1132                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1133              $C$DW$68        .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1135                      .dwattr $C$DW$68, DW_AT_name("IPC30")
    1136                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_IPC30")
    1137                      .dwattr $C$DW$68, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1138                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1139                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   22

    1140              $C$DW$69        .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1142                      .dwattr $C$DW$69, DW_AT_name("IPC31")
    1143                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_IPC31")
    1144                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1145                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1146                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1147                      .dwendtag $C$DW$T$20
    1148              
    1149              
    1150              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1151                      .dwattr $C$DW$T$22, DW_AT_name("IPCACK_REG")
    1152                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1153              $C$DW$70        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1155                      .dwattr $C$DW$70, DW_AT_name("all")
    1156                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
    1157                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$71        .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
    1161                      .dwattr $C$DW$71, DW_AT_name("bit")
    1162                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
    1163                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1165                      .dwendtag $C$DW$T$22
    1166              
    1167              
    1168              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1169                      .dwattr $C$DW$T$23, DW_AT_name("IPCCLR_BITS")
    1170                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1171              $C$DW$72        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1173                      .dwattr $C$DW$72, DW_AT_name("IPC0")
    1174                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_IPC0")
    1175                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1176                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1178              $C$DW$73        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1180                      .dwattr $C$DW$73, DW_AT_name("IPC1")
    1181                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_IPC1")
    1182                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1183                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1184                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1185              $C$DW$74        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1187                      .dwattr $C$DW$74, DW_AT_name("IPC2")
    1188                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_IPC2")
    1189                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1190                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1191                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1192              $C$DW$75        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1194                      .dwattr $C$DW$75, DW_AT_name("IPC3")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   23

    1195                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_IPC3")
    1196                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1197                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1198                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1199              $C$DW$76        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1201                      .dwattr $C$DW$76, DW_AT_name("IPC4")
    1202                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_IPC4")
    1203                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1204                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1206              $C$DW$77        .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$77, DW_AT_name("IPC5")
    1209                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_IPC5")
    1210                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1211                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1213              $C$DW$78        .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$78, DW_AT_name("IPC6")
    1216                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_IPC6")
    1217                      .dwattr $C$DW$78, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1218                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1220              $C$DW$79        .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$79, DW_AT_name("IPC7")
    1223                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_IPC7")
    1224                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1225                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1227              $C$DW$80        .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1229                      .dwattr $C$DW$80, DW_AT_name("IPC8")
    1230                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_IPC8")
    1231                      .dwattr $C$DW$80, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1232                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1234              $C$DW$81        .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$81, DW_AT_name("IPC9")
    1237                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_IPC9")
    1238                      .dwattr $C$DW$81, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1239                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$82        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$82, DW_AT_name("IPC10")
    1244                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_IPC10")
    1245                      .dwattr $C$DW$82, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1246                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1248              $C$DW$83        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   24

    1250                      .dwattr $C$DW$83, DW_AT_name("IPC11")
    1251                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_IPC11")
    1252                      .dwattr $C$DW$83, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1253                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1255              $C$DW$84        .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$84, DW_AT_name("IPC12")
    1258                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_IPC12")
    1259                      .dwattr $C$DW$84, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1260                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$85        .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$85, DW_AT_name("IPC13")
    1265                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_IPC13")
    1266                      .dwattr $C$DW$85, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1267                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1269              $C$DW$86        .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$86, DW_AT_name("IPC14")
    1272                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_IPC14")
    1273                      .dwattr $C$DW$86, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1274                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$87        .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$87, DW_AT_name("IPC15")
    1279                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_IPC15")
    1280                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1281                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1283              $C$DW$88        .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1285                      .dwattr $C$DW$88, DW_AT_name("IPC16")
    1286                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_IPC16")
    1287                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1288                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1289                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1290              $C$DW$89        .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$89, DW_AT_name("IPC17")
    1293                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_IPC17")
    1294                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1295                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1296                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1297              $C$DW$90        .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$90, DW_AT_name("IPC18")
    1300                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_IPC18")
    1301                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1302                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1303                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1304              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   25

    1305                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$91, DW_AT_name("IPC19")
    1307                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_IPC19")
    1308                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1309                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1310                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1311              $C$DW$92        .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$92, DW_AT_name("IPC20")
    1314                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_IPC20")
    1315                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1316                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1317                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1318              $C$DW$93        .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$93, DW_AT_name("IPC21")
    1321                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_IPC21")
    1322                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1323                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1324                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1325              $C$DW$94        .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1327                      .dwattr $C$DW$94, DW_AT_name("IPC22")
    1328                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_IPC22")
    1329                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1330                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1331                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1332              $C$DW$95        .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1334                      .dwattr $C$DW$95, DW_AT_name("IPC23")
    1335                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_IPC23")
    1336                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1337                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1338                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1339              $C$DW$96        .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1341                      .dwattr $C$DW$96, DW_AT_name("IPC24")
    1342                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_IPC24")
    1343                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1344                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1345                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1346              $C$DW$97        .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1348                      .dwattr $C$DW$97, DW_AT_name("IPC25")
    1349                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_IPC25")
    1350                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1351                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1352                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1353              $C$DW$98        .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1355                      .dwattr $C$DW$98, DW_AT_name("IPC26")
    1356                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_IPC26")
    1357                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1358                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1359                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   26

    1360              $C$DW$99        .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$99, DW_AT_name("IPC27")
    1363                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_IPC27")
    1364                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1366                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$100       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$100, DW_AT_name("IPC28")
    1370                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_IPC28")
    1371                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1373                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$101       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1376                      .dwattr $C$DW$101, DW_AT_name("IPC29")
    1377                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_IPC29")
    1378                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1379                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1380                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$102       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1383                      .dwattr $C$DW$102, DW_AT_name("IPC30")
    1384                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_IPC30")
    1385                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1386                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1387                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1388              $C$DW$103       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$103, DW_AT_name("IPC31")
    1391                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_IPC31")
    1392                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1393                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1394                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1395                      .dwendtag $C$DW$T$23
    1396              
    1397              
    1398              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1399                      .dwattr $C$DW$T$24, DW_AT_name("IPCCLR_REG")
    1400                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1401              $C$DW$104       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
    1403                      .dwattr $C$DW$104, DW_AT_name("all")
    1404                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1405                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$105       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$23)
    1409                      .dwattr $C$DW$105, DW_AT_name("bit")
    1410                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1411                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1413                      .dwendtag $C$DW$T$24
    1414              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   27

    1415              
    1416              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1417                      .dwattr $C$DW$T$25, DW_AT_name("IPCFLG_BITS")
    1418                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1419              $C$DW$106       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1421                      .dwattr $C$DW$106, DW_AT_name("IPC0")
    1422                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_IPC0")
    1423                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1424                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1425                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$107       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1428                      .dwattr $C$DW$107, DW_AT_name("IPC1")
    1429                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_IPC1")
    1430                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1431                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1432                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1433              $C$DW$108       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$108, DW_AT_name("IPC2")
    1436                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_IPC2")
    1437                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1438                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1439                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1440              $C$DW$109       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$109, DW_AT_name("IPC3")
    1443                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_IPC3")
    1444                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1445                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1446                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$110       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$110, DW_AT_name("IPC4")
    1450                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_IPC4")
    1451                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1452                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$111       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$111, DW_AT_name("IPC5")
    1457                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_IPC5")
    1458                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1459                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$112       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$112, DW_AT_name("IPC6")
    1464                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_IPC6")
    1465                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1466                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$113       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   28

    1470                      .dwattr $C$DW$113, DW_AT_name("IPC7")
    1471                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IPC7")
    1472                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1473                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1475              $C$DW$114       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$114, DW_AT_name("IPC8")
    1478                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_IPC8")
    1479                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1480                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1482              $C$DW$115       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$115, DW_AT_name("IPC9")
    1485                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_IPC9")
    1486                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1487                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1489              $C$DW$116       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$116, DW_AT_name("IPC10")
    1492                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_IPC10")
    1493                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1494                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$117       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$117, DW_AT_name("IPC11")
    1499                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IPC11")
    1500                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1501                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$118       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$118, DW_AT_name("IPC12")
    1506                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IPC12")
    1507                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$119       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$119, DW_AT_name("IPC13")
    1513                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_IPC13")
    1514                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$120       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$120, DW_AT_name("IPC14")
    1520                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_IPC14")
    1521                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1522                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$121       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   29

    1525                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$121, DW_AT_name("IPC15")
    1527                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_IPC15")
    1528                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1529                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$122       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$122, DW_AT_name("IPC16")
    1534                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IPC16")
    1535                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1537                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$123       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$123, DW_AT_name("IPC17")
    1541                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IPC17")
    1542                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1544                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$124       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$124, DW_AT_name("IPC18")
    1548                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_IPC18")
    1549                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1550                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1551                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$125       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$125, DW_AT_name("IPC19")
    1555                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IPC19")
    1556                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1558                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$126       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$126, DW_AT_name("IPC20")
    1562                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IPC20")
    1563                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1564                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1565                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$127       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1568                      .dwattr $C$DW$127, DW_AT_name("IPC21")
    1569                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IPC21")
    1570                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1571                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1572                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$128       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$128, DW_AT_name("IPC22")
    1576                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IPC22")
    1577                      .dwattr $C$DW$128, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1578                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1579                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   30

    1580              $C$DW$129       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$129, DW_AT_name("IPC23")
    1583                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IPC23")
    1584                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1585                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1586                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$130       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$130, DW_AT_name("IPC24")
    1590                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IPC24")
    1591                      .dwattr $C$DW$130, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1593                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$131       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$131, DW_AT_name("IPC25")
    1597                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IPC25")
    1598                      .dwattr $C$DW$131, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1600                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$132       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$132, DW_AT_name("IPC26")
    1604                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_IPC26")
    1605                      .dwattr $C$DW$132, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1607                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$133       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$133, DW_AT_name("IPC27")
    1611                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IPC27")
    1612                      .dwattr $C$DW$133, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1614                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$134       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$134, DW_AT_name("IPC28")
    1618                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IPC28")
    1619                      .dwattr $C$DW$134, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1621                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$135       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$135, DW_AT_name("IPC29")
    1625                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_IPC29")
    1626                      .dwattr $C$DW$135, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1627                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1628                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$136       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$136, DW_AT_name("IPC30")
    1632                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_IPC30")
    1633                      .dwattr $C$DW$136, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1634                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   31

    1635                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$137       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$137, DW_AT_name("IPC31")
    1639                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IPC31")
    1640                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1642                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1643                      .dwendtag $C$DW$T$25
    1644              
    1645              
    1646              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1647                      .dwattr $C$DW$T$26, DW_AT_name("IPCFLG_REG")
    1648                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1649              $C$DW$138       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    1651                      .dwattr $C$DW$138, DW_AT_name("all")
    1652                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1653                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1655              $C$DW$139       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$25)
    1657                      .dwattr $C$DW$139, DW_AT_name("bit")
    1658                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1659                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1661                      .dwendtag $C$DW$T$26
    1662              
    1663              
    1664              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1665                      .dwattr $C$DW$T$27, DW_AT_name("IPCSET_BITS")
    1666                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1667              $C$DW$140       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$140, DW_AT_name("IPC0")
    1670                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_IPC0")
    1671                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1672                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1674              $C$DW$141       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$141, DW_AT_name("IPC1")
    1677                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_IPC1")
    1678                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1679                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$142       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$142, DW_AT_name("IPC2")
    1684                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IPC2")
    1685                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1686                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1688              $C$DW$143       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   32

    1690                      .dwattr $C$DW$143, DW_AT_name("IPC3")
    1691                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_IPC3")
    1692                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1693                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1694                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1695              $C$DW$144       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1697                      .dwattr $C$DW$144, DW_AT_name("IPC4")
    1698                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_IPC4")
    1699                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1700                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1702              $C$DW$145       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$145, DW_AT_name("IPC5")
    1705                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_IPC5")
    1706                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1707                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1709              $C$DW$146       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$146, DW_AT_name("IPC6")
    1712                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_IPC6")
    1713                      .dwattr $C$DW$146, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1714                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1716              $C$DW$147       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$147, DW_AT_name("IPC7")
    1719                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_IPC7")
    1720                      .dwattr $C$DW$147, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1721                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$148       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$148, DW_AT_name("IPC8")
    1726                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_IPC8")
    1727                      .dwattr $C$DW$148, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1728                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1730              $C$DW$149       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$149, DW_AT_name("IPC9")
    1733                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_IPC9")
    1734                      .dwattr $C$DW$149, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1735                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$150       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$150, DW_AT_name("IPC10")
    1740                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_IPC10")
    1741                      .dwattr $C$DW$150, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1742                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$151       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   33

    1745                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$151, DW_AT_name("IPC11")
    1747                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_IPC11")
    1748                      .dwattr $C$DW$151, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$152       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$152, DW_AT_name("IPC12")
    1754                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_IPC12")
    1755                      .dwattr $C$DW$152, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1756                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$153       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$153, DW_AT_name("IPC13")
    1761                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_IPC13")
    1762                      .dwattr $C$DW$153, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1763                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$154       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$154, DW_AT_name("IPC14")
    1768                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_IPC14")
    1769                      .dwattr $C$DW$154, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1770                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$155       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$155, DW_AT_name("IPC15")
    1775                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_IPC15")
    1776                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1777                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$156       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$156, DW_AT_name("IPC16")
    1782                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_IPC16")
    1783                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1784                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1785                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$157       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$157, DW_AT_name("IPC17")
    1789                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_IPC17")
    1790                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1791                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1792                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1793              $C$DW$158       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$158, DW_AT_name("IPC18")
    1796                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_IPC18")
    1797                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1798                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1799                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   34

    1800              $C$DW$159       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$159, DW_AT_name("IPC19")
    1803                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_IPC19")
    1804                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1805                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1806                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$160       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1809                      .dwattr $C$DW$160, DW_AT_name("IPC20")
    1810                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_IPC20")
    1811                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1812                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1813                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1814              $C$DW$161       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$161, DW_AT_name("IPC21")
    1817                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IPC21")
    1818                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1819                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1820                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$162       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$162, DW_AT_name("IPC22")
    1824                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_IPC22")
    1825                      .dwattr $C$DW$162, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1826                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1827                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$163       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$163, DW_AT_name("IPC23")
    1831                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_IPC23")
    1832                      .dwattr $C$DW$163, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1833                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1834                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$164       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$164, DW_AT_name("IPC24")
    1838                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_IPC24")
    1839                      .dwattr $C$DW$164, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1840                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1841                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$165       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$165, DW_AT_name("IPC25")
    1845                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_IPC25")
    1846                      .dwattr $C$DW$165, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1847                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1848                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$166       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1851                      .dwattr $C$DW$166, DW_AT_name("IPC26")
    1852                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_IPC26")
    1853                      .dwattr $C$DW$166, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1854                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   35

    1855                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1856              $C$DW$167       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$167, DW_AT_name("IPC27")
    1859                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_IPC27")
    1860                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1861                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1862                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$168       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1865                      .dwattr $C$DW$168, DW_AT_name("IPC28")
    1866                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_IPC28")
    1867                      .dwattr $C$DW$168, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1868                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1869                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1870              $C$DW$169       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1872                      .dwattr $C$DW$169, DW_AT_name("IPC29")
    1873                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_IPC29")
    1874                      .dwattr $C$DW$169, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1875                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1876                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1877              $C$DW$170       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$170, DW_AT_name("IPC30")
    1880                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_IPC30")
    1881                      .dwattr $C$DW$170, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1882                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1883                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1884              $C$DW$171       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1886                      .dwattr $C$DW$171, DW_AT_name("IPC31")
    1887                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_IPC31")
    1888                      .dwattr $C$DW$171, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1889                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1890                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1891                      .dwendtag $C$DW$T$27
    1892              
    1893              
    1894              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1895                      .dwattr $C$DW$T$28, DW_AT_name("IPCSET_REG")
    1896                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1897              $C$DW$172       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$21)
    1899                      .dwattr $C$DW$172, DW_AT_name("all")
    1900                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_all")
    1901                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1902                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$173       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$27)
    1905                      .dwattr $C$DW$173, DW_AT_name("bit")
    1906                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_bit")
    1907                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1909                      .dwendtag $C$DW$T$28
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   36

    1910              
    1911              
    1912              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1913                      .dwattr $C$DW$T$29, DW_AT_name("IPCSTS_BITS")
    1914                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1915              $C$DW$174       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1917                      .dwattr $C$DW$174, DW_AT_name("IPC0")
    1918                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_IPC0")
    1919                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1920                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1921                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1922              $C$DW$175       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$175, DW_AT_name("IPC1")
    1925                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_IPC1")
    1926                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1927                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$176       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1931                      .dwattr $C$DW$176, DW_AT_name("IPC2")
    1932                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_IPC2")
    1933                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1934                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1936              $C$DW$177       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1938                      .dwattr $C$DW$177, DW_AT_name("IPC3")
    1939                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_IPC3")
    1940                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1941                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1943              $C$DW$178       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1945                      .dwattr $C$DW$178, DW_AT_name("IPC4")
    1946                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_IPC4")
    1947                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1948                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$179       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1952                      .dwattr $C$DW$179, DW_AT_name("IPC5")
    1953                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_IPC5")
    1954                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1955                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$180       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1959                      .dwattr $C$DW$180, DW_AT_name("IPC6")
    1960                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_IPC6")
    1961                      .dwattr $C$DW$180, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1962                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$181       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   37

    1965                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1966                      .dwattr $C$DW$181, DW_AT_name("IPC7")
    1967                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_IPC7")
    1968                      .dwattr $C$DW$181, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1969                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$182       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$182, DW_AT_name("IPC8")
    1974                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_IPC8")
    1975                      .dwattr $C$DW$182, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1976                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1978              $C$DW$183       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1980                      .dwattr $C$DW$183, DW_AT_name("IPC9")
    1981                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_IPC9")
    1982                      .dwattr $C$DW$183, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1983                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1985              $C$DW$184       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$184, DW_AT_name("IPC10")
    1988                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_IPC10")
    1989                      .dwattr $C$DW$184, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1990                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$185       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$185, DW_AT_name("IPC11")
    1995                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_IPC11")
    1996                      .dwattr $C$DW$185, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1997                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$186       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$186, DW_AT_name("IPC12")
    2002                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_IPC12")
    2003                      .dwattr $C$DW$186, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2004                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$187       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2008                      .dwattr $C$DW$187, DW_AT_name("IPC13")
    2009                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_IPC13")
    2010                      .dwattr $C$DW$187, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2011                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$188       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2015                      .dwattr $C$DW$188, DW_AT_name("IPC14")
    2016                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_IPC14")
    2017                      .dwattr $C$DW$188, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2018                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:20 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0416410                         PAGE   38

    2020              $C$DW$189       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2022                      .dwattr $C$DW$189, DW_AT_name("IPC15")
    2023                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_IPC15")
    2024                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2025                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2026                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2027              $C$DW$190       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2029                      .dwattr $C$DW$190, DW_AT_name("IPC16")
    2030                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_IPC16")
    2031                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2032                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2033                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2034              $C$DW$191       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$191, DW_AT_name("IPC17")
    2037                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_IPC17")
    2038                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2039                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2040                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$192       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2043                      .dwattr $C$DW$192, DW_AT_name("IPC18")
    2044                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_IPC18")
    2045                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2046                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2047                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$193       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$193, DW_AT_name("IPC19")
    2051                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_IPC19")
    2052                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2053                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2054                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2055              $C$DW$194       .dwtag  DW_TAG_member
