TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:25:04 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ReadReservedFn")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_ReadReservedFn")

     502                      .dwattr $C$DW$37, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     503                      .dwattr $C$DW$37, DW_AT_TI_begin_line(0xdd)
     504                      .dwattr $C$DW$37, DW_AT_TI_begin_column(0x06)
     505                      .dwattr $C$DW$37, DW_AT_TI_max_frame_size(-2)
     506                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     507              
     508                      .dwfde $C$DW$CIE, _SCI_Pinmux_Option2
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   11

     509              
     510              ;***************************************************************
     511              ;* FNAME: _SCI_Pinmux_Option2           FR SIZE:   0           *
     512              ;*                                                             *
     513              ;* FUNCTION ENVIRONMENT                                        *
     514              ;*                                                             *
     515              ;* FUNCTION PROPERTIES                                         *
     516              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     517              ;***************************************************************
     518              
     519 0000009f       _SCI_Pinmux_Option2:
     520                      .dwcfi  cfa_offset, -2
     521                      .dwcfi  save_reg_to_mem, 26, 0
     522                      .dwcfi  save_reg_to_reg, 78, 26
     523                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     524 0000009f 7622   EALLOW
     525                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     526 000000a0 761F!         MOVW      DP,#_GpioCtrlRegs+9   ; [CPU_U] 
         000000a1 0000 
     527 000000a2 CC09!         AND       AL,@_GpioCtrlRegs+9,#0xfcff ; [CPU_] |226| 
         000000a3 FCFF 
     528 000000a4 1AA9          OR        AL,#0x0100            ; [CPU_] |226| 
         000000a5 0100 
     529 000000a6 9609!         MOV       @_GpioCtrlRegs+9,AL   ; [CPU_] |226| 
     530                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     531 000000a7 CC09!         AND       AL,@_GpioCtrlRegs+9,#0xf3ff ; [CPU_] |227| 
         000000a8 F3FF 
     532 000000a9 1AA9          OR        AL,#0x0400            ; [CPU_] |227| 
         000000aa 0400 
     533 000000ab 9609!         MOV       @_GpioCtrlRegs+9,AL   ; [CPU_] |227| 
     534                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     535 000000ac 1A05!         OR        @_GpioCtrlRegs+5,#0x0300 ; [CPU_] |230| 
         000000ad 0300 
     536                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     537 000000ae 761A   EDIS
     538                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     539 000000af FF69          SPM       #0                    ; [CPU_] 
     540              $C$DW$38        .dwtag  DW_TAG_TI_branch
     541                      .dwattr $C$DW$38, DW_AT_low_pc(0x00)
     542                      .dwattr $C$DW$38, DW_AT_TI_return
     543 000000b0 0006          LRETR     ; [CPU_] 
     544                      ; return occurs ; [] 
     545                      .dwattr $C$DW$37, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     546                      .dwattr $C$DW$37, DW_AT_TI_end_line(0xe9)
     547                      .dwattr $C$DW$37, DW_AT_TI_end_column(0x01)
     548                      .dwendentry
     549                      .dwendtag $C$DW$37
     550              
     551              ;**************************************************************
     552              ;* UNDEFINED EXTERNAL REFERENCES                              *
     553              ;**************************************************************
     554                      .global _ReadReservedFn
     555                      .global _CopyData
     556                      .global _GetWordData
     557                      .global _GetLongData
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   12

     558                      .global _SciaRegs
     559                      .global _ClkCfgRegs
     560                      .global _CpuSysRegs
     561                      .global _DevCfgRegs
     562                      .global _GpioCtrlRegs
     563              
     564              ;***************************************************************
     565              ;* TYPE INFORMATION                                            *
     566              ;***************************************************************
     567              
     568              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     569                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
     570                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     571              $C$DW$39        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     573                      .dwattr $C$DW$39, DW_AT_name("AUXPLLDIV")
     574                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_AUXPLLDIV")
     575                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     576                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     578              $C$DW$40        .dwtag  DW_TAG_member
     579                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     580                      .dwattr $C$DW$40, DW_AT_name("rsvd1")
     581                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_rsvd1")
     582                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     583                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     584                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     585              $C$DW$41        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     587                      .dwattr $C$DW$41, DW_AT_name("rsvd2")
     588                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd2")
     589                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     590                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     591                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     592                      .dwendtag $C$DW$T$20
     593              
     594              
     595              $C$DW$T$22      .dwtag  DW_TAG_union_type
     596                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
     597                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     598              $C$DW$42        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$21)
     600                      .dwattr $C$DW$42, DW_AT_name("all")
     601                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_all")
     602                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     603                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     604              $C$DW$43        .dwtag  DW_TAG_member
     605                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     606                      .dwattr $C$DW$43, DW_AT_name("bit")
     607                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_bit")
     608                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     610                      .dwendtag $C$DW$T$22
     611              
     612              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   13

     613              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     614                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
     615                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     616              $C$DW$44        .dwtag  DW_TAG_member
     617                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     618                      .dwattr $C$DW$44, DW_AT_name("PLLEN")
     619                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PLLEN")
     620                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     621                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     623              $C$DW$45        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     625                      .dwattr $C$DW$45, DW_AT_name("PLLCLKEN")
     626                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_PLLCLKEN")
     627                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     628                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     630              $C$DW$46        .dwtag  DW_TAG_member
     631                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     632                      .dwattr $C$DW$46, DW_AT_name("rsvd1")
     633                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd1")
     634                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     635                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     637              $C$DW$47        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     639                      .dwattr $C$DW$47, DW_AT_name("rsvd2")
     640                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd2")
     641                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     642                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     643                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     644                      .dwendtag $C$DW$T$23
     645              
     646              
     647              $C$DW$T$24      .dwtag  DW_TAG_union_type
     648                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
     649                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     650              $C$DW$48        .dwtag  DW_TAG_member
     651                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
     652                      .dwattr $C$DW$48, DW_AT_name("all")
     653                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_all")
     654                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     656              $C$DW$49        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$23)
     658                      .dwattr $C$DW$49, DW_AT_name("bit")
     659                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_bit")
     660                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     661                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     662                      .dwendtag $C$DW$T$24
     663              
     664              
     665              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     666                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
     667                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   14

     668              $C$DW$50        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$50, DW_AT_name("IMULT")
     671                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_IMULT")
     672                      .dwattr $C$DW$50, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
     673                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     675              $C$DW$51        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     677                      .dwattr $C$DW$51, DW_AT_name("rsvd1")
     678                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd1")
     679                      .dwattr $C$DW$51, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     680                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     682              $C$DW$52        .dwtag  DW_TAG_member
     683                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     684                      .dwattr $C$DW$52, DW_AT_name("FMULT")
     685                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_FMULT")
     686                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     687                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     689              $C$DW$53        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$53, DW_AT_name("rsvd2")
     692                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd2")
     693                      .dwattr $C$DW$53, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     694                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     696              $C$DW$54        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$54, DW_AT_name("rsvd3")
     699                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd3")
     700                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     701                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     702                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     703                      .dwendtag $C$DW$T$25
     704              
     705              
     706              $C$DW$T$26      .dwtag  DW_TAG_union_type
     707                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
     708                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     709              $C$DW$55        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     711                      .dwattr $C$DW$55, DW_AT_name("all")
     712                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     713                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$56        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$25)
     717                      .dwattr $C$DW$56, DW_AT_name("bit")
     718                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     719                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     721                      .dwendtag $C$DW$T$26
     722              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   15

     723              
     724              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     725                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
     726                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     727              $C$DW$57        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$57, DW_AT_name("LOCKS")
     730                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_LOCKS")
     731                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     732                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$58        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$58, DW_AT_name("SLIPS")
     737                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_SLIPS")
     738                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     739                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     741              $C$DW$59        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     743                      .dwattr $C$DW$59, DW_AT_name("rsvd1")
     744                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd1")
     745                      .dwattr $C$DW$59, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     746                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     748              $C$DW$60        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$60, DW_AT_name("rsvd2")
     751                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd2")
     752                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     753                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     754                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     755                      .dwendtag $C$DW$T$27
     756              
     757              
     758              $C$DW$T$28      .dwtag  DW_TAG_union_type
     759                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
     760                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     761              $C$DW$61        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     763                      .dwattr $C$DW$61, DW_AT_name("all")
     764                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
     765                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     767              $C$DW$62        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$27)
     769                      .dwattr $C$DW$62, DW_AT_name("bit")
     770                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
     771                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     773                      .dwendtag $C$DW$T$28
     774              
     775              
     776              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     777                      .dwattr $C$DW$T$29, DW_AT_name("CCR_BITS")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   16

     778                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     779              $C$DW$63        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$63, DW_AT_name("VMAPS")
     782                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_VMAPS")
     783                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     784                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     785                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     786              $C$DW$64        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     788                      .dwattr $C$DW$64, DW_AT_name("MONPRIV")
     789                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_MONPRIV")
     790                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     791                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$65        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     795                      .dwattr $C$DW$65, DW_AT_name("ENPROT")
     796                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_ENPROT")
     797                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     798                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     800              $C$DW$66        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     802                      .dwattr $C$DW$66, DW_AT_name("rsvd1")
     803                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd1")
     804                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     805                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     807              $C$DW$67        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     809                      .dwattr $C$DW$67, DW_AT_name("rsvd2")
     810                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd2")
     811                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     812                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     813                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     814                      .dwendtag $C$DW$T$29
     815              
     816              
     817              $C$DW$T$30      .dwtag  DW_TAG_union_type
     818                      .dwattr $C$DW$T$30, DW_AT_name("CCR_REG")
     819                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     820              $C$DW$68        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$21)
     822                      .dwattr $C$DW$68, DW_AT_name("all")
     823                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     824                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     826              $C$DW$69        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$29)
     828                      .dwattr $C$DW$69, DW_AT_name("bit")
     829                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     830                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     832                      .dwendtag $C$DW$T$30
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   17

     833              
     834              
     835              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     836                      .dwattr $C$DW$T$31, DW_AT_name("CLKCFGLOCK1_BITS")
     837                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     838              $C$DW$70        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$70, DW_AT_name("CLKSRCCTL1")
     841                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CLKSRCCTL1")
     842                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     845              $C$DW$71        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$71, DW_AT_name("CLKSRCCTL2")
     848                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CLKSRCCTL2")
     849                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     850                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$72        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$72, DW_AT_name("CLKSRCCTL3")
     855                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CLKSRCCTL3")
     856                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     857                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$73        .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     861                      .dwattr $C$DW$73, DW_AT_name("SYSPLLCTL1")
     862                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_SYSPLLCTL1")
     863                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     865                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     866              $C$DW$74        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     868                      .dwattr $C$DW$74, DW_AT_name("SYSPLLCTL2")
     869                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_SYSPLLCTL2")
     870                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     873              $C$DW$75        .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$75, DW_AT_name("SYSPLLCTL3")
     876                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_SYSPLLCTL3")
     877                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     878                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     880              $C$DW$76        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     882                      .dwattr $C$DW$76, DW_AT_name("SYSPLLMULT")
     883                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_SYSPLLMULT")
     884                      .dwattr $C$DW$76, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     885                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     886                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$77        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   18

     888                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     889                      .dwattr $C$DW$77, DW_AT_name("AUXPLLCTL1")
     890                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_AUXPLLCTL1")
     891                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     892                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     894              $C$DW$78        .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$78, DW_AT_name("rsvd1")
     897                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd1")
     898                      .dwattr $C$DW$78, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     899                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$79        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$79, DW_AT_name("AUXPLLMULT")
     904                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_AUXPLLMULT")
     905                      .dwattr $C$DW$79, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     906                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     908              $C$DW$80        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$80, DW_AT_name("SYSCLKDIVSEL")
     911                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
     912                      .dwattr $C$DW$80, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     913                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     915              $C$DW$81        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$81, DW_AT_name("AUXCLKDIVSEL")
     918                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
     919                      .dwattr $C$DW$81, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     920                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$82        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$82, DW_AT_name("PERCLKDIVSEL")
     925                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
     926                      .dwattr $C$DW$82, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     927                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$83        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
     932                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
     933                      .dwattr $C$DW$83, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     934                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     935                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     936              $C$DW$84        .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     938                      .dwattr $C$DW$84, DW_AT_name("LOSPCP")
     939                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_LOSPCP")
     940                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     941                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   19

     943              $C$DW$85        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$85, DW_AT_name("rsvd3")
     946                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd3")
     947                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     948                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     949                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     950                      .dwendtag $C$DW$T$31
     951              
     952              
     953              $C$DW$T$32      .dwtag  DW_TAG_union_type
     954                      .dwattr $C$DW$T$32, DW_AT_name("CLKCFGLOCK1_REG")
     955                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     956              $C$DW$86        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
     958                      .dwattr $C$DW$86, DW_AT_name("all")
     959                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
     960                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$87        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$31)
     964                      .dwattr $C$DW$87, DW_AT_name("bit")
     965                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
     966                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     968                      .dwendtag $C$DW$T$32
     969              
     970              
     971              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     972                      .dwattr $C$DW$T$33, DW_AT_name("CLKSEM_BITS")
     973                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
     974              $C$DW$88        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$88, DW_AT_name("SEM")
     977                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_SEM")
     978                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     979                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     980                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     981              $C$DW$89        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
     984                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
     985                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     986                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$90        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$90, DW_AT_name("KEY")
     991                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_KEY")
     992                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     993                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     994                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     995                      .dwendtag $C$DW$T$33
     996              
     997              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   20

     998              $C$DW$T$34      .dwtag  DW_TAG_union_type
     999                      .dwattr $C$DW$T$34, DW_AT_name("CLKSEM_REG")
    1000                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1001              $C$DW$91        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1003                      .dwattr $C$DW$91, DW_AT_name("all")
    1004                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
    1005                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1007              $C$DW$92        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$33)
    1009                      .dwattr $C$DW$92, DW_AT_name("bit")
    1010                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
    1011                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1013                      .dwendtag $C$DW$T$34
    1014              
    1015              
    1016              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1017                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL1_BITS")
    1018                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1019              $C$DW$93        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$93, DW_AT_name("OSCCLKSRCSEL")
    1022                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1023                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1024                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1025                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1026              $C$DW$94        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
    1029                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
    1030                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1031                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$95        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1035                      .dwattr $C$DW$95, DW_AT_name("INTOSC2OFF")
    1036                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1037                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1038                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1040              $C$DW$96        .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$96, DW_AT_name("XTALOFF")
    1043                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_XTALOFF")
    1044                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1045                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1047              $C$DW$97        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$97, DW_AT_name("WDHALTI")
    1050                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_WDHALTI")
    1051                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   21

    1053                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1054              $C$DW$98        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    1057                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    1058                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1059                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1061              $C$DW$99        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$99, DW_AT_name("rsvd3")
    1064                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd3")
    1065                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1066                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1067                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1068                      .dwendtag $C$DW$T$35
    1069              
    1070              
    1071              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1072                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL1_REG")
    1073                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1074              $C$DW$100       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1076                      .dwattr $C$DW$100, DW_AT_name("all")
    1077                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_all")
    1078                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1080              $C$DW$101       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$35)
    1082                      .dwattr $C$DW$101, DW_AT_name("bit")
    1083                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_bit")
    1084                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1086                      .dwendtag $C$DW$T$36
    1087              
    1088              
    1089              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1090                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL2_BITS")
    1091                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1092              $C$DW$102       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$102, DW_AT_name("AUXOSCCLKSRCSEL")
    1095                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    1096                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1097                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$103       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$103, DW_AT_name("CANABCLKSEL")
    1102                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_CANABCLKSEL")
    1103                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1104                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1106              $C$DW$104       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   22

    1108                      .dwattr $C$DW$104, DW_AT_name("CANBBCLKSEL")
    1109                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    1110                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1111                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$105       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    1116                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    1117                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1118                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$106       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$106, DW_AT_name("rsvd2")
    1123                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd2")
    1124                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1125                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1126                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1127                      .dwendtag $C$DW$T$37
    1128              
    1129              
    1130              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1131                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL2_REG")
    1132                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1133              $C$DW$107       .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
    1135                      .dwattr $C$DW$107, DW_AT_name("all")
    1136                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    1137                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1139              $C$DW$108       .dwtag  DW_TAG_member
    1140                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$37)
    1141                      .dwattr $C$DW$108, DW_AT_name("bit")
    1142                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    1143                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1145                      .dwendtag $C$DW$T$38
    1146              
    1147              
    1148              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1149                      .dwattr $C$DW$T$39, DW_AT_name("CLKSRCCTL3_BITS")
    1150                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1151              $C$DW$109       .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$109, DW_AT_name("XCLKOUTSEL")
    1154                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    1155                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1156                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1158              $C$DW$110       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1161                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1162                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   23

    1163                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1165              $C$DW$111       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$111, DW_AT_name("rsvd2")
    1168                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd2")
    1169                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1170                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1171                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1172                      .dwendtag $C$DW$T$39
    1173              
    1174              
    1175              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1176                      .dwattr $C$DW$T$40, DW_AT_name("CLKSRCCTL3_REG")
    1177                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1178              $C$DW$112       .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1180                      .dwattr $C$DW$112, DW_AT_name("all")
    1181                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1182                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1184              $C$DW$113       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$39)
    1186                      .dwattr $C$DW$113, DW_AT_name("bit")
    1187                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1188                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1190                      .dwendtag $C$DW$T$40
    1191              
    1192              
    1193              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1194                      .dwattr $C$DW$T$43, DW_AT_name("CLK_CFG_REGS")
    1195                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x32)
    1196              $C$DW$114       .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$34)
    1198                      .dwattr $C$DW$114, DW_AT_name("CLKSEM")
    1199                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_CLKSEM")
    1200                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1202              $C$DW$115       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$32)
    1204                      .dwattr $C$DW$115, DW_AT_name("CLKCFGLOCK1")
    1205                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    1206                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1207                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1208              $C$DW$116       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$41)
    1210                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1211                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1212                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1213                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$117       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$36)
    1216                      .dwattr $C$DW$117, DW_AT_name("CLKSRCCTL1")
    1217                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_CLKSRCCTL1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   24

    1218                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1219                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1220              $C$DW$118       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$38)
    1222                      .dwattr $C$DW$118, DW_AT_name("CLKSRCCTL2")
    1223                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1224                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1225                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$119       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$40)
    1228                      .dwattr $C$DW$119, DW_AT_name("CLKSRCCTL3")
    1229                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1230                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1231                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1232              $C$DW$120       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$459)
    1234                      .dwattr $C$DW$120, DW_AT_name("SYSPLLCTL1")
    1235                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1236                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1237                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1238              $C$DW$121       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$461)
    1240                      .dwattr $C$DW$121, DW_AT_name("SYSPLLCTL2")
    1241                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1242                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1243                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1244              $C$DW$122       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$463)
    1246                      .dwattr $C$DW$122, DW_AT_name("SYSPLLCTL3")
    1247                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1248                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1249                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$123       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$465)
    1252                      .dwattr $C$DW$123, DW_AT_name("SYSPLLMULT")
    1253                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1254                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1255                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$124       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$467)
    1258                      .dwattr $C$DW$124, DW_AT_name("SYSPLLSTS")
    1259                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SYSPLLSTS")
    1260                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1261                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$125       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$24)
    1264                      .dwattr $C$DW$125, DW_AT_name("AUXPLLCTL1")
    1265                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1266                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1267                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$126       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$41)
    1270                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1271                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1272                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   25

    1273                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1274              $C$DW$127       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$26)
    1276                      .dwattr $C$DW$127, DW_AT_name("AUXPLLMULT")
    1277                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1278                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1279                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1280              $C$DW$128       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$28)
    1282                      .dwattr $C$DW$128, DW_AT_name("AUXPLLSTS")
    1283                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_AUXPLLSTS")
    1284                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1285                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$129       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$455)
    1288                      .dwattr $C$DW$129, DW_AT_name("SYSCLKDIVSEL")
    1289                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1290                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1291                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$130       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$22)
    1294                      .dwattr $C$DW$130, DW_AT_name("AUXCLKDIVSEL")
    1295                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1296                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1297                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1298              $C$DW$131       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$394)
    1300                      .dwattr $C$DW$131, DW_AT_name("PERCLKDIVSEL")
    1301                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1302                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1303                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1304              $C$DW$132       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$473)
    1306                      .dwattr $C$DW$132, DW_AT_name("XCLKOUTDIVSEL")
    1307                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    1308                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1309                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$133       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$42)
    1312                      .dwattr $C$DW$133, DW_AT_name("rsvd3")
    1313                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd3")
    1314                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1315                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1316              $C$DW$134       .dwtag  DW_TAG_member
    1317                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$352)
    1318                      .dwattr $C$DW$134, DW_AT_name("LOSPCP")
    1319                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_LOSPCP")
    1320                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1321                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$135       .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$358)
    1324                      .dwattr $C$DW$135, DW_AT_name("MCDCR")
    1325                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_MCDCR")
    1326                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1327                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   26

    1328              $C$DW$136       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$471)
    1330                      .dwattr $C$DW$136, DW_AT_name("X1CNT")
    1331                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_X1CNT")
    1332                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1333                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1334                      .dwendtag $C$DW$T$43
    1335              
    1336              $C$DW$137       .dwtag  DW_TAG_TI_far_type
    1337                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$43)
    1338              $C$DW$T$474     .dwtag  DW_TAG_volatile_type
    1339                      .dwattr $C$DW$T$474, DW_AT_type(*$C$DW$137)
    1340              
    1341              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1342                      .dwattr $C$DW$T$44, DW_AT_name("CPU2RESCTL_BITS")
    1343                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1344              $C$DW$138       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1346                      .dwattr $C$DW$138, DW_AT_name("RESET")
    1347                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_RESET")
    1348                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1349                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1350                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1351              $C$DW$139       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1353                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    1354                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1355                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1356                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1358              $C$DW$140       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1360                      .dwattr $C$DW$140, DW_AT_name("KEY")
    1361                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_KEY")
    1362                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1363                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1364                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1365                      .dwendtag $C$DW$T$44
    1366              
    1367              
    1368              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1369                      .dwattr $C$DW$T$45, DW_AT_name("CPU2RESCTL_REG")
    1370                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1371              $C$DW$141       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    1373                      .dwattr $C$DW$141, DW_AT_name("all")
    1374                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    1375                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1376                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$142       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$44)
    1379                      .dwattr $C$DW$142, DW_AT_name("bit")
    1380                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    1381                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   27

    1383                      .dwendtag $C$DW$T$45
    1384              
    1385              
    1386              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1387                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL0_BITS")
    1388                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1389              $C$DW$143       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$143, DW_AT_name("EPWM1")
    1392                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_EPWM1")
    1393                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1394                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$144       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1398                      .dwattr $C$DW$144, DW_AT_name("EPWM2")
    1399                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_EPWM2")
    1400                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1403              $C$DW$145       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$145, DW_AT_name("EPWM3")
    1406                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_EPWM3")
    1407                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1410              $C$DW$146       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$146, DW_AT_name("EPWM4")
    1413                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_EPWM4")
    1414                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1415                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1417              $C$DW$147       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$147, DW_AT_name("EPWM5")
    1420                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_EPWM5")
    1421                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1422                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$148       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$148, DW_AT_name("EPWM6")
    1427                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_EPWM6")
    1428                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1429                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1431              $C$DW$149       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$149, DW_AT_name("EPWM7")
    1434                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_EPWM7")
    1435                      .dwattr $C$DW$149, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1436                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1437                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   28

    1438              $C$DW$150       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$150, DW_AT_name("EPWM8")
    1441                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_EPWM8")
    1442                      .dwattr $C$DW$150, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1443                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1445              $C$DW$151       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1447                      .dwattr $C$DW$151, DW_AT_name("EPWM9")
    1448                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_EPWM9")
    1449                      .dwattr $C$DW$151, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1450                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1452              $C$DW$152       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$152, DW_AT_name("EPWM10")
    1455                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_EPWM10")
    1456                      .dwattr $C$DW$152, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1457                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1458                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$153       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1461                      .dwattr $C$DW$153, DW_AT_name("EPWM11")
    1462                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_EPWM11")
    1463                      .dwattr $C$DW$153, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1464                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1466              $C$DW$154       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1468                      .dwattr $C$DW$154, DW_AT_name("EPWM12")
    1469                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_EPWM12")
    1470                      .dwattr $C$DW$154, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1471                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1472                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1473              $C$DW$155       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1475                      .dwattr $C$DW$155, DW_AT_name("rsvd1")
    1476                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd1")
    1477                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1478                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1480              $C$DW$156       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1482                      .dwattr $C$DW$156, DW_AT_name("rsvd2")
    1483                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd2")
    1484                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1485                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1486                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1487                      .dwendtag $C$DW$T$46
    1488              
    1489              
    1490              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1491                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL0_REG")
    1492                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   29

    1493              $C$DW$157       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    1495                      .dwattr $C$DW$157, DW_AT_name("all")
    1496                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_all")
    1497                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1499              $C$DW$158       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$46)
    1501                      .dwattr $C$DW$158, DW_AT_name("bit")
    1502                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_bit")
    1503                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1505                      .dwendtag $C$DW$T$47
    1506              
    1507              
    1508              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1509                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL11_BITS")
    1510                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1511              $C$DW$159       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$159, DW_AT_name("ADC1")
    1514                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADC1")
    1515                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1516                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1518              $C$DW$160       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$160, DW_AT_name("ADC2")
    1521                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADC2")
    1522                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1523                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1525              $C$DW$161       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$161, DW_AT_name("ADC3")
    1528                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADC3")
    1529                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1530                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$162       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1534                      .dwattr $C$DW$162, DW_AT_name("ADC4")
    1535                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ADC4")
    1536                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1537                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$163       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1541                      .dwattr $C$DW$163, DW_AT_name("rsvd1")
    1542                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd1")
    1543                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1544                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$164       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   30

    1548                      .dwattr $C$DW$164, DW_AT_name("rsvd2")
    1549                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd2")
    1550                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1551                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1552                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1553                      .dwendtag $C$DW$T$48
    1554              
    1555              
    1556              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1557                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL11_REG")
    1558                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1559              $C$DW$165       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    1561                      .dwattr $C$DW$165, DW_AT_name("all")
    1562                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    1563                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1564                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1565              $C$DW$166       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$48)
    1567                      .dwattr $C$DW$166, DW_AT_name("bit")
    1568                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    1569                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1571                      .dwendtag $C$DW$T$49
    1572              
    1573              
    1574              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1575                      .dwattr $C$DW$T$50, DW_AT_name("CPUSEL12_BITS")
    1576                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1577              $C$DW$167       .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1579                      .dwattr $C$DW$167, DW_AT_name("CMPSS1")
    1580                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_CMPSS1")
    1581                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1582                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1583                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1584              $C$DW$168       .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1586                      .dwattr $C$DW$168, DW_AT_name("CMPSS2")
    1587                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CMPSS2")
    1588                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1589                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1591              $C$DW$169       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$169, DW_AT_name("CMPSS3")
    1594                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_CMPSS3")
    1595                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1596                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1597                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$170       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1600                      .dwattr $C$DW$170, DW_AT_name("CMPSS4")
    1601                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_CMPSS4")
    1602                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   31

    1603                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$171       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$171, DW_AT_name("CMPSS5")
    1608                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_CMPSS5")
    1609                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1610                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1612              $C$DW$172       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1614                      .dwattr $C$DW$172, DW_AT_name("CMPSS6")
    1615                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_CMPSS6")
    1616                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1617                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1618                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1619              $C$DW$173       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1621                      .dwattr $C$DW$173, DW_AT_name("CMPSS7")
    1622                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_CMPSS7")
    1623                      .dwattr $C$DW$173, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1624                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1625                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1626              $C$DW$174       .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1628                      .dwattr $C$DW$174, DW_AT_name("CMPSS8")
    1629                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CMPSS8")
    1630                      .dwattr $C$DW$174, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1631                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$175       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$175, DW_AT_name("rsvd1")
    1636                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd1")
    1637                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1638                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1639                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$176       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1642                      .dwattr $C$DW$176, DW_AT_name("rsvd2")
    1643                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd2")
    1644                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1645                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1646                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1647                      .dwendtag $C$DW$T$50
    1648              
    1649              
    1650              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1651                      .dwattr $C$DW$T$51, DW_AT_name("CPUSEL12_REG")
    1652                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1653              $C$DW$177       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    1655                      .dwattr $C$DW$177, DW_AT_name("all")
    1656                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    1657                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   32

    1658                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1659              $C$DW$178       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$50)
    1661                      .dwattr $C$DW$178, DW_AT_name("bit")
    1662                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    1663                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1665                      .dwendtag $C$DW$T$51
    1666              
    1667              
    1668              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1669                      .dwattr $C$DW$T$52, DW_AT_name("CPUSEL14_BITS")
    1670                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1671              $C$DW$179       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$179, DW_AT_name("rsvd1")
    1674                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd1")
    1675                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1676                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$180       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$180, DW_AT_name("Buffered_DAC12_1")
    1681                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Buffered_DAC12_1")
    1682                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1683                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1684                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1685              $C$DW$181       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1687                      .dwattr $C$DW$181, DW_AT_name("Buffered_DAC12_2")
    1688                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Buffered_DAC12_2")
    1689                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1690                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1691                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1692              $C$DW$182       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$182, DW_AT_name("Buffered_DAC12_3")
    1695                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_Buffered_DAC12_3")
    1696                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1697                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1698                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$183       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$183, DW_AT_name("rsvd2")
    1702                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd2")
    1703                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1704                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1705                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1706                      .dwendtag $C$DW$T$52
    1707              
    1708              
    1709              $C$DW$T$53      .dwtag  DW_TAG_union_type
    1710                      .dwattr $C$DW$T$53, DW_AT_name("CPUSEL14_REG")
    1711                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    1712              $C$DW$184       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:05 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0963610                         PAGE   33

    1713                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    1714                      .dwattr $C$DW$184, DW_AT_name("all")
    1715                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    1716                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1718              $C$DW$185       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$52)
    1720                      .dwattr $C$DW$185, DW_AT_name("bit")
    1721                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    1722                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1724                      .dwendtag $C$DW$T$53
    1725              
    1726              
    1727              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    1728                      .dwattr $C$DW$T$54, DW_AT_name("CPUSEL1_BITS")
    1729                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    1730              $C$DW$186       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$186, DW_AT_name("ECAP1")
    1733                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ECAP1")
    1734                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1735                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$187       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$187, DW_AT_name("ECAP2")
    1740                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ECAP2")
    1741                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1742                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$188       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$188, DW_AT_name("ECAP3")
    1747                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ECAP3")
    1748                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
