TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:27:22 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("CpuSysRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CpuSysRegs")

    1606 000000c0 9A01          MOVB      AL,#1                 ; [CPU_] |353| 
    1607                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1608              $C$DW$98        .dwtag  DW_TAG_TI_branch
    1609                      .dwattr $C$DW$98, DW_AT_low_pc(0x00)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   31

    1610                      .dwattr $C$DW$98, DW_AT_TI_return
    1611 000000c1 0006          LRETR     ; [CPU_] 
    1612                      ; return occurs ; [] 
    1613                      .dwattr $C$DW$94, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
    1614                      .dwattr $C$DW$94, DW_AT_TI_end_line(0x163)
    1615                      .dwattr $C$DW$94, DW_AT_TI_end_column(0x01)
    1616                      .dwendentry
    1617                      .dwendtag $C$DW$94
    1618              
    1619 000000c2               .sect   ".text"
    1620                      .global _sysctl_efuse_autoload_error_status_get
    1621              
    1622              $C$DW$99        .dwtag  DW_TAG_subprogram, DW_AT_name("sysctl_efuse_autoload_error_status_get")
    1623                      .dwattr $C$DW$99, DW_AT_low_pc(_sysctl_efuse_autoload_error_status_get)
    1624                      .dwattr $C$DW$99, DW_AT_high_pc(0x00)
    1625                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_sysctl_efuse_autoload_error_status_get")
    1626                      .dwattr $C$DW$99, DW_AT_external
    1627                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$203)
    1628                      .dwattr $C$DW$99, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
    1629                      .dwattr $C$DW$99, DW_AT_TI_begin_line(0x168)
    1630                      .dwattr $C$DW$99, DW_AT_TI_begin_column(0x0a)
    1631                      .dwattr $C$DW$99, DW_AT_TI_max_frame_size(-2)
    1632                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1633              
    1634                      .dwfde $C$DW$CIE, _sysctl_efuse_autoload_error_status_get
    1635              
    1636              ;***************************************************************
    1637              ;* FNAME: _sysctl_efuse_autoload_error_status_get FR SIZE:   0           *
    1638              ;*                                                             *
    1639              ;* FUNCTION ENVIRONMENT                                        *
    1640              ;*                                                             *
    1641              ;* FUNCTION PROPERTIES                                         *
    1642              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1643              ;***************************************************************
    1644              
    1645 000000c2       _sysctl_efuse_autoload_error_status_get:
    1646                      .dwcfi  cfa_offset, -2
    1647                      .dwcfi  save_reg_to_mem, 26, 0
    1648                      .dwcfi  save_reg_to_reg, 78, 26
    1649                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1650 000000c2 761F!         MOVW      DP,#_DevCfgRegs+116   ; [CPU_U] 
         000000c3 0001 
    1651 000000c4 CC34!         AND       AL,@_DevCfgRegs+116,#0x001f ; [CPU_] |362| 
         000000c5 001F 
    1652                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1653              $C$DW$100       .dwtag  DW_TAG_TI_branch
    1654                      .dwattr $C$DW$100, DW_AT_low_pc(0x00)
    1655                      .dwattr $C$DW$100, DW_AT_TI_return
    1656 000000c6 0006          LRETR     ; [CPU_] 
    1657                      ; return occurs ; [] 
    1658                      .dwattr $C$DW$99, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
    1659                      .dwattr $C$DW$99, DW_AT_TI_end_line(0x16b)
    1660                      .dwattr $C$DW$99, DW_AT_TI_end_column(0x01)
    1661                      .dwendentry
    1662                      .dwendtag $C$DW$99
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   32

    1663              
    1664              ;**************************************************************
    1665              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1666              ;**************************************************************
    1667                      .global _CpuSysRegs
    1668                      .global _DevCfgRegs
    1669              
    1670              ;***************************************************************
    1671              ;* TYPE INFORMATION                                            *
    1672              ;***************************************************************
    1673              
    1674              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1675                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
    1676                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1677              $C$DW$101       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$101, DW_AT_name("VMAPS")
    1680                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_VMAPS")
    1681                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$102       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1686                      .dwattr $C$DW$102, DW_AT_name("MONPRIV")
    1687                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_MONPRIV")
    1688                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1689                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1691              $C$DW$103       .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1693                      .dwattr $C$DW$103, DW_AT_name("ENPROT")
    1694                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_ENPROT")
    1695                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1698              $C$DW$104       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    1701                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    1702                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1703                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$105       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$105, DW_AT_name("rsvd2")
    1708                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd2")
    1709                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1710                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1711                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1712                      .dwendtag $C$DW$T$20
    1713              
    1714              
    1715              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1716                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
    1717                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   33

    1718              $C$DW$106       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1720                      .dwattr $C$DW$106, DW_AT_name("all")
    1721                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1722                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1724              $C$DW$107       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1726                      .dwattr $C$DW$107, DW_AT_name("bit")
    1727                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1728                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1730                      .dwendtag $C$DW$T$22
    1731              
    1732              
    1733              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1734                      .dwattr $C$DW$T$23, DW_AT_name("CPU2RESCTL_BITS")
    1735                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1736              $C$DW$108       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1738                      .dwattr $C$DW$108, DW_AT_name("RESET")
    1739                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_RESET")
    1740                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1741                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$109       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1746                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1747                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1748                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$110       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$110, DW_AT_name("KEY")
    1753                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_KEY")
    1754                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1755                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1756                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1757                      .dwendtag $C$DW$T$23
    1758              
    1759              
    1760              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1761                      .dwattr $C$DW$T$24, DW_AT_name("CPU2RESCTL_REG")
    1762                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1763              $C$DW$111       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1765                      .dwattr $C$DW$111, DW_AT_name("all")
    1766                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1767                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1768                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$112       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$23)
    1771                      .dwattr $C$DW$112, DW_AT_name("bit")
    1772                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   34

    1773                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1774                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1775                      .dwendtag $C$DW$T$24
    1776              
    1777              
    1778              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1779                      .dwattr $C$DW$T$25, DW_AT_name("CPUSEL0_BITS")
    1780                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1781              $C$DW$113       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1783                      .dwattr $C$DW$113, DW_AT_name("EPWM1")
    1784                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_EPWM1")
    1785                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1786                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1787                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1788              $C$DW$114       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$114, DW_AT_name("EPWM2")
    1791                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_EPWM2")
    1792                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1793                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$115       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1797                      .dwattr $C$DW$115, DW_AT_name("EPWM3")
    1798                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_EPWM3")
    1799                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1800                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1801                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1802              $C$DW$116       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$116, DW_AT_name("EPWM4")
    1805                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_EPWM4")
    1806                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1807                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$117       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$117, DW_AT_name("EPWM5")
    1812                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_EPWM5")
    1813                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1814                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1816              $C$DW$118       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1818                      .dwattr $C$DW$118, DW_AT_name("EPWM6")
    1819                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_EPWM6")
    1820                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1823              $C$DW$119       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$119, DW_AT_name("EPWM7")
    1826                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_EPWM7")
    1827                      .dwattr $C$DW$119, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   35

    1828                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1829                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1830              $C$DW$120       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1832                      .dwattr $C$DW$120, DW_AT_name("EPWM8")
    1833                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_EPWM8")
    1834                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1835                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$121       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$121, DW_AT_name("EPWM9")
    1840                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_EPWM9")
    1841                      .dwattr $C$DW$121, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1842                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1844              $C$DW$122       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1846                      .dwattr $C$DW$122, DW_AT_name("EPWM10")
    1847                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_EPWM10")
    1848                      .dwattr $C$DW$122, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1849                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1850                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$123       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$123, DW_AT_name("EPWM11")
    1854                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_EPWM11")
    1855                      .dwattr $C$DW$123, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1856                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1858              $C$DW$124       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1860                      .dwattr $C$DW$124, DW_AT_name("EPWM12")
    1861                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_EPWM12")
    1862                      .dwattr $C$DW$124, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1863                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1865              $C$DW$125       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1868                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1869                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1870                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1872              $C$DW$126       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1874                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1875                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1876                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1877                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1878                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1879                      .dwendtag $C$DW$T$25
    1880              
    1881              
    1882              $C$DW$T$26      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   36

    1883                      .dwattr $C$DW$T$26, DW_AT_name("CPUSEL0_REG")
    1884                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1885              $C$DW$127       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    1887                      .dwattr $C$DW$127, DW_AT_name("all")
    1888                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1889                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$128       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$25)
    1893                      .dwattr $C$DW$128, DW_AT_name("bit")
    1894                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1895                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1897                      .dwendtag $C$DW$T$26
    1898              
    1899              
    1900              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1901                      .dwattr $C$DW$T$27, DW_AT_name("CPUSEL11_BITS")
    1902                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1903              $C$DW$129       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$129, DW_AT_name("ADC1")
    1906                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADC1")
    1907                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1908                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1909                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1910              $C$DW$130       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$130, DW_AT_name("ADC2")
    1913                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADC2")
    1914                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1915                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1916                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$131       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1919                      .dwattr $C$DW$131, DW_AT_name("ADC3")
    1920                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADC3")
    1921                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1922                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1923                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1924              $C$DW$132       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1926                      .dwattr $C$DW$132, DW_AT_name("ADC4")
    1927                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADC4")
    1928                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1929                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1930                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1931              $C$DW$133       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    1934                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    1935                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1936                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   37

    1938              $C$DW$134       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1940                      .dwattr $C$DW$134, DW_AT_name("rsvd2")
    1941                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd2")
    1942                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1943                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1944                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1945                      .dwendtag $C$DW$T$27
    1946              
    1947              
    1948              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1949                      .dwattr $C$DW$T$28, DW_AT_name("CPUSEL11_REG")
    1950                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1951              $C$DW$135       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    1953                      .dwattr $C$DW$135, DW_AT_name("all")
    1954                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    1955                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$136       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    1959                      .dwattr $C$DW$136, DW_AT_name("bit")
    1960                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    1961                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1962                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1963                      .dwendtag $C$DW$T$28
    1964              
    1965              
    1966              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1967                      .dwattr $C$DW$T$29, DW_AT_name("CPUSEL12_BITS")
    1968                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1969              $C$DW$137       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1971                      .dwattr $C$DW$137, DW_AT_name("CMPSS1")
    1972                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_CMPSS1")
    1973                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1974                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1975                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$138       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$138, DW_AT_name("CMPSS2")
    1979                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_CMPSS2")
    1980                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1981                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$139       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$139, DW_AT_name("CMPSS3")
    1986                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CMPSS3")
    1987                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1988                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1990              $C$DW$140       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1992                      .dwattr $C$DW$140, DW_AT_name("CMPSS4")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   38

    1993                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CMPSS4")
    1994                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1995                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1997              $C$DW$141       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1999                      .dwattr $C$DW$141, DW_AT_name("CMPSS5")
    2000                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_CMPSS5")
    2001                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2002                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$142       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2006                      .dwattr $C$DW$142, DW_AT_name("CMPSS6")
    2007                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CMPSS6")
    2008                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2009                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$143       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2013                      .dwattr $C$DW$143, DW_AT_name("CMPSS7")
    2014                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CMPSS7")
    2015                      .dwattr $C$DW$143, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2016                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2017                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$144       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2020                      .dwattr $C$DW$144, DW_AT_name("CMPSS8")
    2021                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CMPSS8")
    2022                      .dwattr $C$DW$144, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2023                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2024                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2025              $C$DW$145       .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$145, DW_AT_name("rsvd1")
    2028                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd1")
    2029                      .dwattr $C$DW$145, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2030                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2031                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2032              $C$DW$146       .dwtag  DW_TAG_member
    2033                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2034                      .dwattr $C$DW$146, DW_AT_name("rsvd2")
    2035                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd2")
    2036                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2037                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2038                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2039                      .dwendtag $C$DW$T$29
    2040              
    2041              
    2042              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2043                      .dwattr $C$DW$T$30, DW_AT_name("CPUSEL12_REG")
    2044                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2045              $C$DW$147       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    2047                      .dwattr $C$DW$147, DW_AT_name("all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   39

    2048                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2049                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2050                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2051              $C$DW$148       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    2053                      .dwattr $C$DW$148, DW_AT_name("bit")
    2054                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2055                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2056                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2057                      .dwendtag $C$DW$T$30
    2058              
    2059              
    2060              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2061                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL14_BITS")
    2062                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2063              $C$DW$149       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2065                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    2066                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    2067                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2068                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2069                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2070              $C$DW$150       .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2072                      .dwattr $C$DW$150, DW_AT_name("Buffered_DAC12_1")
    2073                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Buffered_DAC12_1")
    2074                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2075                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2076                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2077              $C$DW$151       .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2079                      .dwattr $C$DW$151, DW_AT_name("Buffered_DAC12_2")
    2080                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Buffered_DAC12_2")
    2081                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2082                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2083                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2084              $C$DW$152       .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$152, DW_AT_name("Buffered_DAC12_3")
    2087                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Buffered_DAC12_3")
    2088                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2089                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2090                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2091              $C$DW$153       .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2093                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    2094                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    2095                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2096                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2097                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2098                      .dwendtag $C$DW$T$31
    2099              
    2100              
    2101              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2102                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL14_REG")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   40

    2103                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2104              $C$DW$154       .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    2106                      .dwattr $C$DW$154, DW_AT_name("all")
    2107                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_all")
    2108                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2110              $C$DW$155       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
    2112                      .dwattr $C$DW$155, DW_AT_name("bit")
    2113                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_bit")
    2114                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2115                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2116                      .dwendtag $C$DW$T$32
    2117              
    2118              
    2119              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2120                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL1_BITS")
    2121                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2122              $C$DW$156       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$156, DW_AT_name("ECAP1")
    2125                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ECAP1")
    2126                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2127                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2128                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2129              $C$DW$157       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$157, DW_AT_name("ECAP2")
    2132                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ECAP2")
    2133                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$158       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2138                      .dwattr $C$DW$158, DW_AT_name("ECAP3")
    2139                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ECAP3")
    2140                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2141                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2143              $C$DW$159       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$159, DW_AT_name("ECAP4")
    2146                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ECAP4")
    2147                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2148                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2149                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$160       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$160, DW_AT_name("ECAP5")
    2153                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ECAP5")
    2154                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2155                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2157              $C$DW$161       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   41

    2158                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$161, DW_AT_name("ECAP6")
    2160                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ECAP6")
    2161                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2162                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2163                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$162       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    2167                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    2168                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2169                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2171              $C$DW$163       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2173                      .dwattr $C$DW$163, DW_AT_name("rsvd2")
    2174                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd2")
    2175                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2176                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2177                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2178                      .dwendtag $C$DW$T$33
    2179              
    2180              
    2181              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2182                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL1_REG")
    2183                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2184              $C$DW$164       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    2186                      .dwattr $C$DW$164, DW_AT_name("all")
    2187                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    2188                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2189                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2190              $C$DW$165       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$33)
    2192                      .dwattr $C$DW$165, DW_AT_name("bit")
    2193                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    2194                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2196                      .dwendtag $C$DW$T$34
    2197              
    2198              
    2199              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2200                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL2_BITS")
    2201                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2202              $C$DW$166       .dwtag  DW_TAG_member
    2203                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2204                      .dwattr $C$DW$166, DW_AT_name("EQEP1")
    2205                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_EQEP1")
    2206                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2207                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2209              $C$DW$167       .dwtag  DW_TAG_member
    2210                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2211                      .dwattr $C$DW$167, DW_AT_name("EQEP2")
    2212                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_EQEP2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   42

    2213                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2214                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2216              $C$DW$168       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2218                      .dwattr $C$DW$168, DW_AT_name("EQEP3")
    2219                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_EQEP3")
    2220                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2221                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2222                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2223              $C$DW$169       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2225                      .dwattr $C$DW$169, DW_AT_name("rsvd1")
    2226                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd1")
    2227                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2228                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$170       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2232                      .dwattr $C$DW$170, DW_AT_name("rsvd2")
    2233                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd2")
    2234                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2235                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2236                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2237                      .dwendtag $C$DW$T$35
    2238              
    2239              
    2240              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2241                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL2_REG")
    2242                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2243              $C$DW$171       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    2245                      .dwattr $C$DW$171, DW_AT_name("all")
    2246                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    2247                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2248                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2249              $C$DW$172       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$35)
    2251                      .dwattr $C$DW$172, DW_AT_name("bit")
    2252                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_bit")
    2253                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2255                      .dwendtag $C$DW$T$36
    2256              
    2257              
    2258              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2259                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL3_BITS")
    2260                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2261              $C$DW$173       .dwtag  DW_TAG_member
    2262                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2263                      .dwattr $C$DW$173, DW_AT_name("rsvd1")
    2264                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd1")
    2265                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2266                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2267                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   43

    2268              $C$DW$174       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2270                      .dwattr $C$DW$174, DW_AT_name("rsvd2")
    2271                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd2")
    2272                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2273                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2274                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2275                      .dwendtag $C$DW$T$37
    2276              
    2277              
    2278              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2279                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL3_REG")
    2280                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2281              $C$DW$175       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    2283                      .dwattr $C$DW$175, DW_AT_name("all")
    2284                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    2285                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2286                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2287              $C$DW$176       .dwtag  DW_TAG_member
    2288                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$37)
    2289                      .dwattr $C$DW$176, DW_AT_name("bit")
    2290                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    2291                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2293                      .dwendtag $C$DW$T$38
    2294              
    2295              
    2296              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2297                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL4_BITS")
    2298                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2299              $C$DW$177       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2301                      .dwattr $C$DW$177, DW_AT_name("SD1")
    2302                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SD1")
    2303                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2304                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2305                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2306              $C$DW$178       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2308                      .dwattr $C$DW$178, DW_AT_name("SD2")
    2309                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_SD2")
    2310                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2311                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2312                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$179       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2315                      .dwattr $C$DW$179, DW_AT_name("rsvd1")
    2316                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd1")
    2317                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2318                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2319                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2320              $C$DW$180       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2322                      .dwattr $C$DW$180, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   44

    2323                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd2")
    2324                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2325                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2326                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2327                      .dwendtag $C$DW$T$39
    2328              
    2329              
    2330              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2331                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL4_REG")
    2332                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2333              $C$DW$181       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    2335                      .dwattr $C$DW$181, DW_AT_name("all")
    2336                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_all")
    2337                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2338                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2339              $C$DW$182       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$39)
    2341                      .dwattr $C$DW$182, DW_AT_name("bit")
    2342                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_bit")
    2343                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2344                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2345                      .dwendtag $C$DW$T$40
    2346              
    2347              
    2348              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2349                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL5_BITS")
    2350                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2351              $C$DW$183       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2353                      .dwattr $C$DW$183, DW_AT_name("SCI_A")
    2354                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SCI_A")
    2355                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2356                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2357                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$184       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2360                      .dwattr $C$DW$184, DW_AT_name("SCI_B")
    2361                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SCI_B")
    2362                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2363                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2364                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2365              $C$DW$185       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2367                      .dwattr $C$DW$185, DW_AT_name("SCI_C")
    2368                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SCI_C")
    2369                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2370                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2372              $C$DW$186       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2374                      .dwattr $C$DW$186, DW_AT_name("SCI_D")
    2375                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_SCI_D")
    2376                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2377                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   45

    2378                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$187       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2381                      .dwattr $C$DW$187, DW_AT_name("rsvd1")
    2382                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd1")
    2383                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2384                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2385                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2386              $C$DW$188       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2388                      .dwattr $C$DW$188, DW_AT_name("rsvd2")
    2389                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd2")
    2390                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2391                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2392                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2393                      .dwendtag $C$DW$T$41
    2394              
    2395              
    2396              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2397                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL5_REG")
    2398                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2399              $C$DW$189       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    2401                      .dwattr $C$DW$189, DW_AT_name("all")
    2402                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    2403                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2404                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2405              $C$DW$190       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$41)
    2407                      .dwattr $C$DW$190, DW_AT_name("bit")
    2408                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    2409                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2410                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2411                      .dwendtag $C$DW$T$42
    2412              
    2413              
    2414              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2415                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL6_BITS")
    2416                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2417              $C$DW$191       .dwtag  DW_TAG_member
    2418                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2419                      .dwattr $C$DW$191, DW_AT_name("SPI_A")
    2420                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SPI_A")
    2421                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2422                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2424              $C$DW$192       .dwtag  DW_TAG_member
    2425                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2426                      .dwattr $C$DW$192, DW_AT_name("SPI_B")
    2427                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_SPI_B")
    2428                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2429                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2430                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2431              $C$DW$193       .dwtag  DW_TAG_member
    2432                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   46

    2433                      .dwattr $C$DW$193, DW_AT_name("SPI_C")
    2434                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_SPI_C")
    2435                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2436                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2437                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2438              $C$DW$194       .dwtag  DW_TAG_member
    2439                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2440                      .dwattr $C$DW$194, DW_AT_name("rsvd1")
    2441                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd1")
    2442                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2443                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2444                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2445              $C$DW$195       .dwtag  DW_TAG_member
    2446                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2447                      .dwattr $C$DW$195, DW_AT_name("rsvd2")
    2448                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd2")
    2449                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2450                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2451                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2452                      .dwendtag $C$DW$T$43
    2453              
    2454              
    2455              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2456                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL6_REG")
    2457                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2458              $C$DW$196       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    2460                      .dwattr $C$DW$196, DW_AT_name("all")
    2461                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_all")
    2462                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2463                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2464              $C$DW$197       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$43)
    2466                      .dwattr $C$DW$197, DW_AT_name("bit")
    2467                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_bit")
    2468                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2469                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2470                      .dwendtag $C$DW$T$44
    2471              
    2472              
    2473              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2474                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL7_BITS")
    2475                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2476              $C$DW$198       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2478                      .dwattr $C$DW$198, DW_AT_name("I2C_A")
    2479                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_I2C_A")
    2480                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2481                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2483              $C$DW$199       .dwtag  DW_TAG_member
    2484                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2485                      .dwattr $C$DW$199, DW_AT_name("I2C_B")
    2486                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_I2C_B")
    2487                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   47

    2488                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2489                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2490              $C$DW$200       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2492                      .dwattr $C$DW$200, DW_AT_name("rsvd1")
    2493                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd1")
    2494                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2495                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2496                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2497              $C$DW$201       .dwtag  DW_TAG_member
    2498                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2499                      .dwattr $C$DW$201, DW_AT_name("rsvd2")
    2500                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd2")
    2501                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2502                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2503                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2504                      .dwendtag $C$DW$T$45
    2505              
    2506              
    2507              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2508                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL7_REG")
    2509                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2510              $C$DW$202       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    2512                      .dwattr $C$DW$202, DW_AT_name("all")
    2513                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
    2514                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2516              $C$DW$203       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$45)
    2518                      .dwattr $C$DW$203, DW_AT_name("bit")
    2519                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
    2520                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2521                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2522                      .dwendtag $C$DW$T$46
    2523              
    2524              
    2525              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2526                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL8_BITS")
    2527                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2528              $C$DW$204       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$204, DW_AT_name("CAN_A")
    2531                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_CAN_A")
    2532                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2533                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2534                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2535              $C$DW$205       .dwtag  DW_TAG_member
    2536                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2537                      .dwattr $C$DW$205, DW_AT_name("CAN_B")
    2538                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_CAN_B")
    2539                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2540                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$206       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   48

    2543                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2544                      .dwattr $C$DW$206, DW_AT_name("rsvd1")
    2545                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_rsvd1")
    2546                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2547                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2548                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2549              $C$DW$207       .dwtag  DW_TAG_member
    2550                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2551                      .dwattr $C$DW$207, DW_AT_name("rsvd2")
    2552                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd2")
    2553                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2554                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2555                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2556                      .dwendtag $C$DW$T$47
    2557              
    2558              
    2559              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2560                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL8_REG")
    2561                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2562              $C$DW$208       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    2564                      .dwattr $C$DW$208, DW_AT_name("all")
    2565                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    2566                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2567                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2568              $C$DW$209       .dwtag  DW_TAG_member
    2569                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$47)
    2570                      .dwattr $C$DW$209, DW_AT_name("bit")
    2571                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    2572                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2573                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2574                      .dwendtag $C$DW$T$48
    2575              
    2576              
    2577              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2578                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL9_BITS")
    2579                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    2580              $C$DW$210       .dwtag  DW_TAG_member
    2581                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2582                      .dwattr $C$DW$210, DW_AT_name("McBSP_A")
    2583                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_McBSP_A")
    2584                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2585                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2586                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2587              $C$DW$211       .dwtag  DW_TAG_member
    2588                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2589                      .dwattr $C$DW$211, DW_AT_name("McBSP_B")
    2590                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_McBSP_B")
    2591                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2592                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2593                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2594              $C$DW$212       .dwtag  DW_TAG_member
    2595                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2596                      .dwattr $C$DW$212, DW_AT_name("rsvd1")
    2597                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   49

    2598                      .dwattr $C$DW$212, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2599                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2600                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2601              $C$DW$213       .dwtag  DW_TAG_member
    2602                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2603                      .dwattr $C$DW$213, DW_AT_name("rsvd2")
    2604                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_rsvd2")
    2605                      .dwattr $C$DW$213, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2606                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2607                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2608                      .dwendtag $C$DW$T$49
    2609              
    2610              
    2611              $C$DW$T$50      .dwtag  DW_TAG_union_type
    2612                      .dwattr $C$DW$T$50, DW_AT_name("CPUSEL9_REG")
    2613                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    2614              $C$DW$214       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    2616                      .dwattr $C$DW$214, DW_AT_name("all")
    2617                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_all")
    2618                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$215       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$49)
    2622                      .dwattr $C$DW$215, DW_AT_name("bit")
    2623                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_bit")
    2624                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2625                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2626                      .dwendtag $C$DW$T$50
    2627              
    2628              
    2629              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    2630                      .dwattr $C$DW$T$51, DW_AT_name("CPUSYSLOCK1_BITS")
    2631                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    2632              $C$DW$216       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2634                      .dwattr $C$DW$216, DW_AT_name("HIBBOOTMODE")
    2635                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2636                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2637                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2639              $C$DW$217       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2641                      .dwattr $C$DW$217, DW_AT_name("IORESTOREADDR")
    2642                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2643                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2644                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2645                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$218       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2648                      .dwattr $C$DW$218, DW_AT_name("PIEVERRADDR")
    2649                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2650                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2651                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2652                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   50

    2653              $C$DW$219       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$219, DW_AT_name("PCLKCR0")
    2656                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_PCLKCR0")
    2657                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2658                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2659                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$220       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2662                      .dwattr $C$DW$220, DW_AT_name("PCLKCR1")
    2663                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PCLKCR1")
    2664                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2665                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2666                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2667              $C$DW$221       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$221, DW_AT_name("PCLKCR2")
    2670                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PCLKCR2")
    2671                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2672                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$222       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2676                      .dwattr $C$DW$222, DW_AT_name("PCLKCR3")
    2677                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PCLKCR3")
    2678                      .dwattr $C$DW$222, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2679                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2680                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2681              $C$DW$223       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2683                      .dwattr $C$DW$223, DW_AT_name("PCLKCR4")
    2684                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_PCLKCR4")
    2685                      .dwattr $C$DW$223, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2686                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2687                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$224       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$224, DW_AT_name("PCLKCR5")
    2691                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PCLKCR5")
    2692                      .dwattr $C$DW$224, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2693                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2695              $C$DW$225       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$225, DW_AT_name("PCLKCR6")
    2698                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_PCLKCR6")
    2699                      .dwattr $C$DW$225, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2700                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$226       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2704                      .dwattr $C$DW$226, DW_AT_name("PCLKCR7")
    2705                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_PCLKCR7")
    2706                      .dwattr $C$DW$226, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2707                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   51

    2708                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2709              $C$DW$227       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2711                      .dwattr $C$DW$227, DW_AT_name("PCLKCR8")
    2712                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_PCLKCR8")
    2713                      .dwattr $C$DW$227, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2714                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$228       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$228, DW_AT_name("PCLKCR9")
    2719                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_PCLKCR9")
    2720                      .dwattr $C$DW$228, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2721                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2723              $C$DW$229       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2725                      .dwattr $C$DW$229, DW_AT_name("PCLKCR10")
    2726                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_PCLKCR10")
    2727                      .dwattr $C$DW$229, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2728                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2729                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2730              $C$DW$230       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2732                      .dwattr $C$DW$230, DW_AT_name("PCLKCR11")
    2733                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_PCLKCR11")
    2734                      .dwattr $C$DW$230, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2735                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2736                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2737              $C$DW$231       .dwtag  DW_TAG_member
    2738                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2739                      .dwattr $C$DW$231, DW_AT_name("PCLKCR12")
    2740                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_PCLKCR12")
    2741                      .dwattr $C$DW$231, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2742                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2743                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$232       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2746                      .dwattr $C$DW$232, DW_AT_name("PCLKCR13")
    2747                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_PCLKCR13")
    2748                      .dwattr $C$DW$232, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2749                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2750                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2751              $C$DW$233       .dwtag  DW_TAG_member
    2752                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    2753                      .dwattr $C$DW$233, DW_AT_name("PCLKCR14")
    2754                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_PCLKCR14")
    2755                      .dwattr $C$DW$233, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2756                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2757                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2758              $C$DW$234       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2760                      .dwattr $C$DW$234, DW_AT_name("PCLKCR15")
    2761                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_PCLKCR15")
    2762                      .dwattr $C$DW$234, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   52

    2763                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2764                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2765              $C$DW$235       .dwtag  DW_TAG_member
    2766                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2767                      .dwattr $C$DW$235, DW_AT_name("PCLKCR16")
    2768                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_PCLKCR16")
    2769                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2770                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2771                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2772              $C$DW$236       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2774                      .dwattr $C$DW$236, DW_AT_name("SECMSEL")
    2775                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_SECMSEL")
    2776                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2777                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2778                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2779              $C$DW$237       .dwtag  DW_TAG_member
    2780                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2781                      .dwattr $C$DW$237, DW_AT_name("LPMCR")
    2782                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_LPMCR")
    2783                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2784                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2785                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$238       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2788                      .dwattr $C$DW$238, DW_AT_name("GPIOLPMSEL0")
    2789                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2790                      .dwattr $C$DW$238, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2791                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2792                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2793              $C$DW$239       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2795                      .dwattr $C$DW$239, DW_AT_name("GPIOLPMSEL1")
    2796                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    2797                      .dwattr $C$DW$239, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2798                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2799                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2800              $C$DW$240       .dwtag  DW_TAG_member
    2801                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2802                      .dwattr $C$DW$240, DW_AT_name("rsvd1")
    2803                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_rsvd1")
    2804                      .dwattr $C$DW$240, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2805                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2806                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2807                      .dwendtag $C$DW$T$51
    2808              
    2809              
    2810              $C$DW$T$52      .dwtag  DW_TAG_union_type
    2811                      .dwattr $C$DW$T$52, DW_AT_name("CPUSYSLOCK1_REG")
    2812                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    2813              $C$DW$241       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
    2815                      .dwattr $C$DW$241, DW_AT_name("all")
    2816                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_all")
    2817                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:27:23 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0673610                         PAGE   53

    2818                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2819              $C$DW$242       .dwtag  DW_TAG_member
    2820                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$51)
    2821                      .dwattr $C$DW$242, DW_AT_name("bit")
    2822                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_bit")
    2823                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2825                      .dwendtag $C$DW$T$52
    2826              
    2827              
    2828              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    2829                      .dwattr $C$DW$T$57, DW_AT_name("CPU_SYS_REGS")
    2830                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x82)
    2831              $C$DW$243       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$52)
    2833                      .dwattr $C$DW$243, DW_AT_name("CPUSYSLOCK1")
    2834                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    2835                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2836                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2837              $C$DW$244       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$53)
    2839                      .dwattr $C$DW$244, DW_AT_name("rsvd1")
    2840                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_rsvd1")
    2841                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2842                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2843              $C$DW$245       .dwtag  DW_TAG_member
    2844                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$21)
    2845                      .dwattr $C$DW$245, DW_AT_name("HIBBOOTMODE")
    2846                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2847                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2848                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2849              $C$DW$246       .dwtag  DW_TAG_member
    2850                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$112)
    2851                      .dwattr $C$DW$246, DW_AT_name("IORESTOREADDR")
    2852                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2853                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
