TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:12 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ReadReservedFn")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_ReadReservedFn")

     677                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     678 00000101 9A02          MOV       AL,#2                 ; [CPU_] |231| 
     679 00000102 9B87          MOV       AH,#135               ; [CPU_] |231| 
     680 00000103 1E20!         MOVL      @_DcanaRegs+288,ACC   ; [CPU_] |231| 
     681                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     682 00000104       $C$L14:    
     683 00000104       $C$DW$L$_DCAN_SendWordData$2$B:
     684 00000104 4F20!         TBIT      @_DcanaRegs+288,#15   ; [CPU_] |232| 
     685 00000105 EEFF          BF        $C$L14,TC             ; [CPU_] |232| 
     686                      ; branchcc occurs ; [] |232| 
     687 00000106       $C$DW$L$_DCAN_SendWordData$2$E:
     688                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     689 00000106       $C$L15:    
     690 00000106       $C$DW$L$_DCAN_SendWordData$4$B:
     691 00000106 761F!         MOVW      DP,#_DcanaRegs+136    ; [CPU_U] 
         00000107 0002 
     692 00000108 4108!         TBIT      @_DcanaRegs+136,#1    ; [CPU_] |233| 
     693 00000109 EEFD          BF        $C$L15,TC             ; [CPU_] |233| 
     694                      ; branchcc occurs ; [] |233| 
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   15

     695 0000010a       $C$DW$L$_DCAN_SendWordData$4$E:
     696                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     697 0000010a FE82          SUBB      SP,#2                 ; [CPU_U] 
     698                      .dwcfi  cfa_offset, -2
     699              $C$DW$44        .dwtag  DW_TAG_TI_branch
     700                      .dwattr $C$DW$44, DW_AT_low_pc(0x00)
     701                      .dwattr $C$DW$44, DW_AT_TI_return
     702 0000010b 0006          LRETR     ; [CPU_] 
     703                      ; return occurs ; [] 
     704              
     705              $C$DW$45        .dwtag  DW_TAG_TI_loop
     706                      .dwattr $C$DW$45, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0987610:$C$L15:1:1380659232"
     707                      .dwattr $C$DW$45, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     708                      .dwattr $C$DW$45, DW_AT_TI_begin_line(0xe9)
     709                      .dwattr $C$DW$45, DW_AT_TI_end_line(0xe9)
     710              $C$DW$46        .dwtag  DW_TAG_TI_loop_range
     711                      .dwattr $C$DW$46, DW_AT_low_pc($C$DW$L$_DCAN_SendWordData$4$B)
     712                      .dwattr $C$DW$46, DW_AT_high_pc($C$DW$L$_DCAN_SendWordData$4$E)
     713                      .dwendtag $C$DW$45
     714              
     715              
     716              $C$DW$47        .dwtag  DW_TAG_TI_loop
     717                      .dwattr $C$DW$47, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0987610:$C$L14:1:1380659232"
     718                      .dwattr $C$DW$47, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     719                      .dwattr $C$DW$47, DW_AT_TI_begin_line(0xe8)
     720                      .dwattr $C$DW$47, DW_AT_TI_end_line(0xe8)
     721              $C$DW$48        .dwtag  DW_TAG_TI_loop_range
     722                      .dwattr $C$DW$48, DW_AT_low_pc($C$DW$L$_DCAN_SendWordData$2$B)
     723                      .dwattr $C$DW$48, DW_AT_high_pc($C$DW$L$_DCAN_SendWordData$2$E)
     724                      .dwendtag $C$DW$47
     725              
     726                      .dwattr $C$DW$41, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
     727                      .dwattr $C$DW$41, DW_AT_TI_end_line(0xea)
     728                      .dwattr $C$DW$41, DW_AT_TI_end_column(0x01)
     729                      .dwendentry
     730                      .dwendtag $C$DW$41
     731              
     732              ;**************************************************************
     733              ;* UNDEFINED EXTERNAL REFERENCES                              *
     734              ;**************************************************************
     735                      .global _ReadReservedFn
     736                      .global _CopyData
     737                      .global _GetLongData
     738                      .global _GetWordData
     739                      .global _ClkCfgRegs
     740                      .global _CpuSysRegs
     741                      .global _DevCfgRegs
     742                      .global _GpioCtrlRegs
     743                      .global _DcanaRegs
     744              
     745              ;***************************************************************
     746              ;* TYPE INFORMATION                                            *
     747              ;***************************************************************
     748              
     749              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   16

     750                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
     751                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     752              $C$DW$49        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$49, DW_AT_name("AUXPLLDIV")
     755                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_AUXPLLDIV")
     756                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     757                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     759              $C$DW$50        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$50, DW_AT_name("rsvd1")
     762                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd1")
     763                      .dwattr $C$DW$50, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     764                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     765                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     766              $C$DW$51        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$51, DW_AT_name("rsvd2")
     769                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd2")
     770                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     771                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     772                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     773                      .dwendtag $C$DW$T$20
     774              
     775              
     776              $C$DW$T$22      .dwtag  DW_TAG_union_type
     777                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
     778                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     779              $C$DW$52        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     781                      .dwattr $C$DW$52, DW_AT_name("all")
     782                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     783                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     785              $C$DW$53        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     787                      .dwattr $C$DW$53, DW_AT_name("bit")
     788                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     789                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     791                      .dwendtag $C$DW$T$22
     792              
     793              
     794              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     795                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
     796                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     797              $C$DW$54        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$54, DW_AT_name("PLLEN")
     800                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PLLEN")
     801                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     802                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     804              $C$DW$55        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   17

     805                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$55, DW_AT_name("PLLCLKEN")
     807                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PLLCLKEN")
     808                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     809                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$56        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$56, DW_AT_name("rsvd1")
     814                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd1")
     815                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     816                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$57        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$57, DW_AT_name("rsvd2")
     821                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd2")
     822                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     823                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     824                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     825                      .dwendtag $C$DW$T$23
     826              
     827              
     828              $C$DW$T$24      .dwtag  DW_TAG_union_type
     829                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
     830                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     831              $C$DW$58        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     833                      .dwattr $C$DW$58, DW_AT_name("all")
     834                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     835                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     837              $C$DW$59        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
     839                      .dwattr $C$DW$59, DW_AT_name("bit")
     840                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     841                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     843                      .dwendtag $C$DW$T$24
     844              
     845              
     846              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     847                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
     848                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     849              $C$DW$60        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$60, DW_AT_name("IMULT")
     852                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_IMULT")
     853                      .dwattr $C$DW$60, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
     854                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     856              $C$DW$61        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$61, DW_AT_name("rsvd1")
     859                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   18

     860                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     861                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     863              $C$DW$62        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     865                      .dwattr $C$DW$62, DW_AT_name("FMULT")
     866                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_FMULT")
     867                      .dwattr $C$DW$62, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     868                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     870              $C$DW$63        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$63, DW_AT_name("rsvd2")
     873                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd2")
     874                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     875                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$64        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$64, DW_AT_name("rsvd3")
     880                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd3")
     881                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     882                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     883                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     884                      .dwendtag $C$DW$T$25
     885              
     886              
     887              $C$DW$T$26      .dwtag  DW_TAG_union_type
     888                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
     889                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     890              $C$DW$65        .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     892                      .dwattr $C$DW$65, DW_AT_name("all")
     893                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_all")
     894                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     896              $C$DW$66        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$25)
     898                      .dwattr $C$DW$66, DW_AT_name("bit")
     899                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bit")
     900                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     902                      .dwendtag $C$DW$T$26
     903              
     904              
     905              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     906                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
     907                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     908              $C$DW$67        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$67, DW_AT_name("LOCKS")
     911                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_LOCKS")
     912                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     913                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   19

     915              $C$DW$68        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$68, DW_AT_name("SLIPS")
     918                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_SLIPS")
     919                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     920                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$69        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     924                      .dwattr $C$DW$69, DW_AT_name("rsvd1")
     925                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd1")
     926                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     927                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$70        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     931                      .dwattr $C$DW$70, DW_AT_name("rsvd2")
     932                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd2")
     933                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     934                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     935                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     936                      .dwendtag $C$DW$T$27
     937              
     938              
     939              $C$DW$T$28      .dwtag  DW_TAG_union_type
     940                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
     941                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     942              $C$DW$71        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$21)
     944                      .dwattr $C$DW$71, DW_AT_name("all")
     945                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_all")
     946                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$72        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
     950                      .dwattr $C$DW$72, DW_AT_name("bit")
     951                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_bit")
     952                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     954                      .dwendtag $C$DW$T$28
     955              
     956              
     957              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     958                      .dwattr $C$DW$T$29, DW_AT_name("CAN_BTR_BITS")
     959                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     960              $C$DW$73        .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     962                      .dwattr $C$DW$73, DW_AT_name("BPR")
     963                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_BPR")
     964                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
     965                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$74        .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     969                      .dwattr $C$DW$74, DW_AT_name("SJW")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   20

     970                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_SJW")
     971                      .dwattr $C$DW$74, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     972                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     974              $C$DW$75        .dwtag  DW_TAG_member
     975                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$75, DW_AT_name("TSEG1")
     977                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_TSEG1")
     978                      .dwattr $C$DW$75, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     979                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     980                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     981              $C$DW$76        .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$76, DW_AT_name("TSEG2")
     984                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_TSEG2")
     985                      .dwattr $C$DW$76, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x03)
     986                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$77        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$77, DW_AT_name("rsvd1")
     991                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd1")
     992                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     993                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$78        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$78, DW_AT_name("BRPE")
     998                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_BRPE")
     999                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1000                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1001                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1002              $C$DW$79        .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$79, DW_AT_name("rsvd2")
    1005                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd2")
    1006                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1007                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1008                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1009                      .dwendtag $C$DW$T$29
    1010              
    1011              
    1012              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1013                      .dwattr $C$DW$T$30, DW_AT_name("CAN_BTR_REG")
    1014                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1015              $C$DW$80        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1017                      .dwattr $C$DW$80, DW_AT_name("all")
    1018                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
    1019                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$81        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$29)
    1023                      .dwattr $C$DW$81, DW_AT_name("bit")
    1024                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   21

    1025                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1027                      .dwendtag $C$DW$T$30
    1028              
    1029              
    1030              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1031                      .dwattr $C$DW$T$31, DW_AT_name("CAN_CTL_BITS")
    1032                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1033              $C$DW$82        .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1035                      .dwattr $C$DW$82, DW_AT_name("Init")
    1036                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Init")
    1037                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1038                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1040              $C$DW$83        .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$83, DW_AT_name("IE0")
    1043                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_IE0")
    1044                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1045                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1047              $C$DW$84        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$84, DW_AT_name("SIE")
    1050                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_SIE")
    1051                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1054              $C$DW$85        .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$85, DW_AT_name("EIE")
    1057                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_EIE")
    1058                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1059                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1061              $C$DW$86        .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$86, DW_AT_name("rsvd1")
    1064                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd1")
    1065                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1066                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1068              $C$DW$87        .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$87, DW_AT_name("DAR")
    1071                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_DAR")
    1072                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1073                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1074                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1075              $C$DW$88        .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$88, DW_AT_name("CCE")
    1078                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_CCE")
    1079                      .dwattr $C$DW$88, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   22

    1080                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1081                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1082              $C$DW$89        .dwtag  DW_TAG_member
    1083                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1084                      .dwattr $C$DW$89, DW_AT_name("Test")
    1085                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Test")
    1086                      .dwattr $C$DW$89, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1087                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1089              $C$DW$90        .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$90, DW_AT_name("IDS")
    1092                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_IDS")
    1093                      .dwattr $C$DW$90, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1094                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1095                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1096              $C$DW$91        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$91, DW_AT_name("ABO")
    1099                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ABO")
    1100                      .dwattr $C$DW$91, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1101                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1103              $C$DW$92        .dwtag  DW_TAG_member
    1104                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1105                      .dwattr $C$DW$92, DW_AT_name("PMD")
    1106                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PMD")
    1107                      .dwattr $C$DW$92, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x04)
    1108                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1110              $C$DW$93        .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1112                      .dwattr $C$DW$93, DW_AT_name("rsvd2")
    1113                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd2")
    1114                      .dwattr $C$DW$93, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1115                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$94        .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$94, DW_AT_name("SWR")
    1120                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SWR")
    1121                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1122                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1124              $C$DW$95        .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1126                      .dwattr $C$DW$95, DW_AT_name("INITDBG")
    1127                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_INITDBG")
    1128                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1129                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1130                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1131              $C$DW$96        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1133                      .dwattr $C$DW$96, DW_AT_name("IE1")
    1134                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_IE1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   23

    1135                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1136                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1137                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$97        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$97, DW_AT_name("rsvd3")
    1141                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd3")
    1142                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    1143                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1144                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1145              $C$DW$98        .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$98, DW_AT_name("PDR")
    1148                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PDR")
    1149                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1151                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1152              $C$DW$99        .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$99, DW_AT_name("WUBA")
    1155                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_WUBA")
    1156                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1157                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1158                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$100       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1161                      .dwattr $C$DW$100, DW_AT_name("rsvd4")
    1162                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd4")
    1163                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1164                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1165                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1166                      .dwendtag $C$DW$T$31
    1167              
    1168              
    1169              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1170                      .dwattr $C$DW$T$32, DW_AT_name("CAN_CTL_REG")
    1171                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1172              $C$DW$101       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1174                      .dwattr $C$DW$101, DW_AT_name("all")
    1175                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1176                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1177                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1178              $C$DW$102       .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$31)
    1180                      .dwattr $C$DW$102, DW_AT_name("bit")
    1181                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1182                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1184                      .dwendtag $C$DW$T$32
    1185              
    1186              
    1187              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1188                      .dwattr $C$DW$T$33, DW_AT_name("CAN_ECCDIAG_BITS")
    1189                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   24

    1190              $C$DW$103       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$103, DW_AT_name("ECCDIAG")
    1193                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_ECCDIAG")
    1194                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1195                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1197              $C$DW$104       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    1200                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    1201                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1202                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1204              $C$DW$105       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1206                      .dwattr $C$DW$105, DW_AT_name("rsvd2")
    1207                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd2")
    1208                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1209                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1210                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1211                      .dwendtag $C$DW$T$33
    1212              
    1213              
    1214              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1215                      .dwattr $C$DW$T$34, DW_AT_name("CAN_ECCDIAG_REG")
    1216                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1217              $C$DW$106       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1219                      .dwattr $C$DW$106, DW_AT_name("all")
    1220                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1221                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$107       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$33)
    1225                      .dwattr $C$DW$107, DW_AT_name("bit")
    1226                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1227                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1229                      .dwendtag $C$DW$T$34
    1230              
    1231              
    1232              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1233                      .dwattr $C$DW$T$35, DW_AT_name("CAN_ECCDIAG_STAT_BITS")
    1234                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1235              $C$DW$108       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$108, DW_AT_name("SEFLG")
    1238                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SEFLG")
    1239                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$109       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   25

    1245                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1246                      .dwattr $C$DW$109, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x07)
    1247                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$110       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$110, DW_AT_name("DEFLG")
    1252                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_DEFLG")
    1253                      .dwattr $C$DW$110, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$111       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$111, DW_AT_name("rsvd2")
    1259                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd2")
    1260                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    1261                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$112       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$112, DW_AT_name("rsvd3")
    1266                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd3")
    1267                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1268                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1269                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1270                      .dwendtag $C$DW$T$35
    1271              
    1272              
    1273              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1274                      .dwattr $C$DW$T$36, DW_AT_name("CAN_ECCDIAG_STAT_REG")
    1275                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1276              $C$DW$113       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1278                      .dwattr $C$DW$113, DW_AT_name("all")
    1279                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1280                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$114       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$35)
    1284                      .dwattr $C$DW$114, DW_AT_name("bit")
    1285                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1286                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1287                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1288                      .dwendtag $C$DW$T$36
    1289              
    1290              
    1291              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1292                      .dwattr $C$DW$T$37, DW_AT_name("CAN_ERRC_BITS")
    1293                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1294              $C$DW$115       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$115, DW_AT_name("TEC")
    1297                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_TEC")
    1298                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1299                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   26

    1300                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$116       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1303                      .dwattr $C$DW$116, DW_AT_name("REC")
    1304                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_REC")
    1305                      .dwattr $C$DW$116, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1306                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$117       .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$117, DW_AT_name("RP")
    1311                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_RP")
    1312                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1313                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$118       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    1318                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    1319                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1320                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1321                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1322                      .dwendtag $C$DW$T$37
    1323              
    1324              
    1325              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1326                      .dwattr $C$DW$T$38, DW_AT_name("CAN_ERRC_REG")
    1327                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1328              $C$DW$119       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$21)
    1330                      .dwattr $C$DW$119, DW_AT_name("all")
    1331                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1332                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$120       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$37)
    1336                      .dwattr $C$DW$120, DW_AT_name("bit")
    1337                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1338                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1340                      .dwendtag $C$DW$T$38
    1341              
    1342              
    1343              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1344                      .dwattr $C$DW$T$39, DW_AT_name("CAN_ES_BITS")
    1345                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1346              $C$DW$121       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1348                      .dwattr $C$DW$121, DW_AT_name("LEC")
    1349                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_LEC")
    1350                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1351                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1353              $C$DW$122       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   27

    1355                      .dwattr $C$DW$122, DW_AT_name("TxOk")
    1356                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_TxOk")
    1357                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1358                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1359                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1360              $C$DW$123       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$123, DW_AT_name("RxOk")
    1363                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_RxOk")
    1364                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$124       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$124, DW_AT_name("EPass")
    1370                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_EPass")
    1371                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$125       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1376                      .dwattr $C$DW$125, DW_AT_name("EWarn")
    1377                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_EWarn")
    1378                      .dwattr $C$DW$125, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1379                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$126       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1383                      .dwattr $C$DW$126, DW_AT_name("BOff")
    1384                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_BOff")
    1385                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1386                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1388              $C$DW$127       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$127, DW_AT_name("PER")
    1391                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PER")
    1392                      .dwattr $C$DW$127, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1393                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1395              $C$DW$128       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$128, DW_AT_name("WakeUpPnd")
    1398                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_WakeUpPnd")
    1399                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1400                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$129       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$129, DW_AT_name("PDA")
    1405                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PDA")
    1406                      .dwattr $C$DW$129, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1407                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$130       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   28

    1410                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1411                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1412                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1413                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    1414                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1416              $C$DW$131       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1418                      .dwattr $C$DW$131, DW_AT_name("rsvd2")
    1419                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd2")
    1420                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1421                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1422                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1423                      .dwendtag $C$DW$T$39
    1424              
    1425              
    1426              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1427                      .dwattr $C$DW$T$40, DW_AT_name("CAN_ES_REG")
    1428                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1429              $C$DW$132       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
    1431                      .dwattr $C$DW$132, DW_AT_name("all")
    1432                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_all")
    1433                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$133       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$39)
    1437                      .dwattr $C$DW$133, DW_AT_name("bit")
    1438                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_bit")
    1439                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1441                      .dwendtag $C$DW$T$40
    1442              
    1443              
    1444              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1445                      .dwattr $C$DW$T$41, DW_AT_name("CAN_GLB_INT_CLR_BITS")
    1446                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1447              $C$DW$134       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$134, DW_AT_name("INT0_FLG_CLR")
    1450                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_INT0_FLG_CLR")
    1451                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1452                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$135       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$135, DW_AT_name("INT1_FLG_CLR")
    1457                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_INT1_FLG_CLR")
    1458                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1459                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$136       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    1464                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   29

    1465                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1466                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$137       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1470                      .dwattr $C$DW$137, DW_AT_name("rsvd2")
    1471                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd2")
    1472                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1473                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1474                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1475                      .dwendtag $C$DW$T$41
    1476              
    1477              
    1478              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1479                      .dwattr $C$DW$T$42, DW_AT_name("CAN_GLB_INT_CLR_REG")
    1480                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1481              $C$DW$138       .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    1483                      .dwattr $C$DW$138, DW_AT_name("all")
    1484                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1485                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1487              $C$DW$139       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$41)
    1489                      .dwattr $C$DW$139, DW_AT_name("bit")
    1490                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1491                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1493                      .dwendtag $C$DW$T$42
    1494              
    1495              
    1496              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1497                      .dwattr $C$DW$T$43, DW_AT_name("CAN_GLB_INT_EN_BITS")
    1498                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1499              $C$DW$140       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1501                      .dwattr $C$DW$140, DW_AT_name("GLBINT0_EN")
    1502                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GLBINT0_EN")
    1503                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1504                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1506              $C$DW$141       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$141, DW_AT_name("GLBINT1_EN")
    1509                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GLBINT1_EN")
    1510                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1511                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1513              $C$DW$142       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1515                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    1516                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    1517                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1518                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1519                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   30

    1520              $C$DW$143       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$143, DW_AT_name("rsvd2")
    1523                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd2")
    1524                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1525                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1526                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1527                      .dwendtag $C$DW$T$43
    1528              
    1529              
    1530              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1531                      .dwattr $C$DW$T$44, DW_AT_name("CAN_GLB_INT_EN_REG")
    1532                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1533              $C$DW$144       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    1535                      .dwattr $C$DW$144, DW_AT_name("all")
    1536                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_all")
    1537                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$145       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$43)
    1541                      .dwattr $C$DW$145, DW_AT_name("bit")
    1542                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_bit")
    1543                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1545                      .dwendtag $C$DW$T$44
    1546              
    1547              
    1548              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1549                      .dwattr $C$DW$T$45, DW_AT_name("CAN_GLB_INT_FLG_BITS")
    1550                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1551              $C$DW$146       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1553                      .dwattr $C$DW$146, DW_AT_name("Name")
    1554                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_Name")
    1555                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1556                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1557                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1558              $C$DW$147       .dwtag  DW_TAG_member
    1559                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1560                      .dwattr $C$DW$147, DW_AT_name("INT1_FLG")
    1561                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_INT1_FLG")
    1562                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1563                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1564                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1565              $C$DW$148       .dwtag  DW_TAG_member
    1566                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1567                      .dwattr $C$DW$148, DW_AT_name("rsvd1")
    1568                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd1")
    1569                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1570                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1571                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1572              $C$DW$149       .dwtag  DW_TAG_member
    1573                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1574                      .dwattr $C$DW$149, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   31

    1575                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd2")
    1576                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1577                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1578                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1579                      .dwendtag $C$DW$T$45
    1580              
    1581              
    1582              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1583                      .dwattr $C$DW$T$46, DW_AT_name("CAN_GLB_INT_FLG_REG")
    1584                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1585              $C$DW$150       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    1587                      .dwattr $C$DW$150, DW_AT_name("all")
    1588                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    1589                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1590                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1591              $C$DW$151       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$45)
    1593                      .dwattr $C$DW$151, DW_AT_name("bit")
    1594                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    1595                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1597                      .dwendtag $C$DW$T$46
    1598              
    1599              
    1600              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1601                      .dwattr $C$DW$T$47, DW_AT_name("CAN_IF1ARB_BITS")
    1602                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1603              $C$DW$152       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    1605                      .dwattr $C$DW$152, DW_AT_name("ID")
    1606                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ID")
    1607                      .dwattr $C$DW$152, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x1d)
    1608                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1609                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$153       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1612                      .dwattr $C$DW$153, DW_AT_name("Dir")
    1613                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_Dir")
    1614                      .dwattr $C$DW$153, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1615                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1616                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1617              $C$DW$154       .dwtag  DW_TAG_member
    1618                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1619                      .dwattr $C$DW$154, DW_AT_name("Xtd")
    1620                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_Xtd")
    1621                      .dwattr $C$DW$154, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1622                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1623                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1624              $C$DW$155       .dwtag  DW_TAG_member
    1625                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1626                      .dwattr $C$DW$155, DW_AT_name("MsgVal")
    1627                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_MsgVal")
    1628                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1629                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   32

    1630                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1631                      .dwendtag $C$DW$T$47
    1632              
    1633              
    1634              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1635                      .dwattr $C$DW$T$48, DW_AT_name("CAN_IF1ARB_REG")
    1636                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1637              $C$DW$156       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    1639                      .dwattr $C$DW$156, DW_AT_name("all")
    1640                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_all")
    1641                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1643              $C$DW$157       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$47)
    1645                      .dwattr $C$DW$157, DW_AT_name("bit")
    1646                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_bit")
    1647                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1649                      .dwendtag $C$DW$T$48
    1650              
    1651              
    1652              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1653                      .dwattr $C$DW$T$49, DW_AT_name("CAN_IF1CMD_BITS")
    1654                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1655              $C$DW$158       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1657                      .dwattr $C$DW$158, DW_AT_name("MSG_NUM")
    1658                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_MSG_NUM")
    1659                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1660                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1661                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1662              $C$DW$159       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    1665                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    1666                      .dwattr $C$DW$159, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1667                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1669              $C$DW$160       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$160, DW_AT_name("Busy")
    1672                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_Busy")
    1673                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1674                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1676              $C$DW$161       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1678                      .dwattr $C$DW$161, DW_AT_name("DATA_B")
    1679                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_DATA_B")
    1680                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1681                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1682                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$162       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   33

    1685                      .dwattr $C$DW$162, DW_AT_name("DATA_A")
    1686                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DATA_A")
    1687                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1688                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1689                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$163       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$163, DW_AT_name("TXRQST")
    1693                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_TXRQST")
    1694                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1695                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1696                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1697              $C$DW$164       .dwtag  DW_TAG_member
    1698                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1699                      .dwattr $C$DW$164, DW_AT_name("ClrIntPnd")
    1700                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ClrIntPnd")
    1701                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1702                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1703                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1704              $C$DW$165       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1706                      .dwattr $C$DW$165, DW_AT_name("Control")
    1707                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_Control")
    1708                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1709                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1710                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$166       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1713                      .dwattr $C$DW$166, DW_AT_name("Arb")
    1714                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_Arb")
    1715                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1716                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1717                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1718              $C$DW$167       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1720                      .dwattr $C$DW$167, DW_AT_name("Mask")
    1721                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_Mask")
    1722                      .dwattr $C$DW$167, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1723                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1724                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1725              $C$DW$168       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1727                      .dwattr $C$DW$168, DW_AT_name("DIR")
    1728                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_DIR")
    1729                      .dwattr $C$DW$168, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1730                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1731                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1732              $C$DW$169       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1734                      .dwattr $C$DW$169, DW_AT_name("rsvd2")
    1735                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd2")
    1736                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1737                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1738                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1739                      .dwendtag $C$DW$T$49
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   34

    1740              
    1741              
    1742              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1743                      .dwattr $C$DW$T$50, DW_AT_name("CAN_IF1CMD_REG")
    1744                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1745              $C$DW$170       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    1747                      .dwattr $C$DW$170, DW_AT_name("all")
    1748                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    1749                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$171       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$49)
    1753                      .dwattr $C$DW$171, DW_AT_name("bit")
    1754                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    1755                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1757                      .dwendtag $C$DW$T$50
    1758              
    1759              
    1760              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1761                      .dwattr $C$DW$T$51, DW_AT_name("CAN_IF1DATA_BITS")
    1762                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1763              $C$DW$172       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1765                      .dwattr $C$DW$172, DW_AT_name("Data_0")
    1766                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_Data_0")
    1767                      .dwattr $C$DW$172, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1768                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1769                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1770              $C$DW$173       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$173, DW_AT_name("Data_1")
    1773                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_Data_1")
    1774                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1775                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$174       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1779                      .dwattr $C$DW$174, DW_AT_name("Data_2")
    1780                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_Data_2")
    1781                      .dwattr $C$DW$174, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1782                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1783                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1784              $C$DW$175       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$175, DW_AT_name("Data_3")
    1787                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Data_3")
    1788                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1789                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1790                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1791                      .dwendtag $C$DW$T$51
    1792              
    1793              
    1794              $C$DW$T$52      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   35

    1795                      .dwattr $C$DW$T$52, DW_AT_name("CAN_IF1DATA_REG")
    1796                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1797              $C$DW$176       .dwtag  DW_TAG_member
    1798                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    1799                      .dwattr $C$DW$176, DW_AT_name("all")
    1800                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
    1801                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$177       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$51)
    1805                      .dwattr $C$DW$177, DW_AT_name("bit")
    1806                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
    1807                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1809                      .dwendtag $C$DW$T$52
    1810              
    1811              
    1812              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1813                      .dwattr $C$DW$T$53, DW_AT_name("CAN_IF1DATB_BITS")
    1814                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    1815              $C$DW$178       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$178, DW_AT_name("Data_4")
    1818                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Data_4")
    1819                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1820                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$179       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$179, DW_AT_name("Data_5")
    1825                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_Data_5")
    1826                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1827                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$180       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$180, DW_AT_name("Data_6")
    1832                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Data_6")
    1833                      .dwattr $C$DW$180, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1834                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1835                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$181       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$181, DW_AT_name("Data_7")
    1839                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Data_7")
    1840                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1841                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1842                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1843                      .dwendtag $C$DW$T$53
    1844              
    1845              
    1846              $C$DW$T$54      .dwtag  DW_TAG_union_type
    1847                      .dwattr $C$DW$T$54, DW_AT_name("CAN_IF1DATB_REG")
    1848                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    1849              $C$DW$182       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   36

    1850                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    1851                      .dwattr $C$DW$182, DW_AT_name("all")
    1852                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    1853                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$183       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$53)
    1857                      .dwattr $C$DW$183, DW_AT_name("bit")
    1858                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    1859                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1861                      .dwendtag $C$DW$T$54
    1862              
    1863              
    1864              $C$DW$T$55      .dwtag  DW_TAG_structure_type
    1865                      .dwattr $C$DW$T$55, DW_AT_name("CAN_IF1MCTL_BITS")
    1866                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    1867              $C$DW$184       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1869                      .dwattr $C$DW$184, DW_AT_name("DLC")
    1870                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DLC")
    1871                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1872                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1873                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1874              $C$DW$185       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1876                      .dwattr $C$DW$185, DW_AT_name("rsvd1")
    1877                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd1")
    1878                      .dwattr $C$DW$185, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
    1879                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1881              $C$DW$186       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1883                      .dwattr $C$DW$186, DW_AT_name("EoB")
    1884                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_EoB")
    1885                      .dwattr $C$DW$186, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1886                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1887                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1888              $C$DW$187       .dwtag  DW_TAG_member
    1889                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1890                      .dwattr $C$DW$187, DW_AT_name("TxRqst")
    1891                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_TxRqst")
    1892                      .dwattr $C$DW$187, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1893                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1895              $C$DW$188       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1897                      .dwattr $C$DW$188, DW_AT_name("RmtEn")
    1898                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_RmtEn")
    1899                      .dwattr $C$DW$188, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1900                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1901                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1902              $C$DW$189       .dwtag  DW_TAG_member
    1903                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1904                      .dwattr $C$DW$189, DW_AT_name("RxIE")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0987610                         PAGE   37

    1905                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_RxIE")
    1906                      .dwattr $C$DW$189, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1907                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1908                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$190       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1911                      .dwattr $C$DW$190, DW_AT_name("TxIE")
    1912                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_TxIE")
    1913                      .dwattr $C$DW$190, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1914                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1916              $C$DW$191       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1918                      .dwattr $C$DW$191, DW_AT_name("UMask")
    1919                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_UMask")
    1920                      .dwattr $C$DW$191, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1921                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1922                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1923              $C$DW$192       .dwtag  DW_TAG_member
    1924                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1925                      .dwattr $C$DW$192, DW_AT_name("IntPnd")
    1926                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_IntPnd")
    1927                      .dwattr $C$DW$192, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1928                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1929                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1930              $C$DW$193       .dwtag  DW_TAG_member
    1931                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1932                      .dwattr $C$DW$193, DW_AT_name("MsgLst")
    1933                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_MsgLst")
    1934                      .dwattr $C$DW$193, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1935                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1936                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
