TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:17 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

     833              ;***************************************************************
     834              ;* FNAME: _SPIA_Init                    FR SIZE:   0           *
     835              ;*                                                             *
     836              ;* FUNCTION ENVIRONMENT                                        *
     837              ;*                                                             *
     838              ;* FUNCTION PROPERTIES                                         *
     839              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     840              ;***************************************************************
     841              
     842 000000d0       _SPIA_Init:
     843                      .dwcfi  cfa_offset, -2
     844                      .dwcfi  save_reg_to_mem, 26, 0
     845                      .dwcfi  save_reg_to_reg, 78, 26
     846                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     847 000000d0 7622   EALLOW
     848                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     849 000000d1 761F!         MOVW      DP,#_CpuSysRegs+50    ; [CPU_U] 
         000000d2 0000 
     850 000000d3 1A32!         OR        @_CpuSysRegs+50,#0x0001 ; [CPU_] |322| 
         000000d4 0001 
     851                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     852 000000d5 0202          MOVB      ACC,#2                ; [CPU_] |323| 
     853 000000d6 761F!         MOVW      DP,#_ClkCfgRegs+44    ; [CPU_U] 
         000000d7 0000 
     854 000000d8 1E2C!         MOVL      @_ClkCfgRegs+44,ACC   ; [CPU_] |323| 
     855                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     856 000000d9 761F!         MOVW      DP,#_SpiaRegs+10      ; [CPU_U] 
         000000da 0000 
     857 000000db 280A!         MOV       @_SpiaRegs+10,#32768  ; [CPU_] |326| 
         000000dc 8000 
     858                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     859 000000dd 56BF!         MOVB      @_SpiaRegs,#7,UNC     ; [CPU_] |328| 
         000000de 0700 
     860                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     861 000000df 56BF!         MOVB      @_SpiaRegs+1,#14,UNC  ; [CPU_] |330| 
         000000e0 0E01 
     862                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     863 000000e1 56BF!         MOVB      @_SpiaRegs+4,#127,UNC ; [CPU_] |332| 
         000000e2 7F04 
     864                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     865 000000e3 56BF!         MOVB      @_SpiaRegs,#135,UNC   ; [CPU_] |334| 
         000000e4 8700 
     866                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     867 000000e5 761A   EDIS
     868                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     869 000000e6 FF69          SPM       #0                    ; [CPU_] 
     870              $C$DW$63        .dwtag  DW_TAG_TI_branch
     871                      .dwattr $C$DW$63, DW_AT_low_pc(0x00)
     872                      .dwattr $C$DW$63, DW_AT_TI_return
     873 000000e7 0006          LRETR     ; [CPU_] 
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   18

     874                      ; return occurs ; [] 
     875                      .dwattr $C$DW$62, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
     876                      .dwattr $C$DW$62, DW_AT_TI_end_line(0x150)
     877                      .dwattr $C$DW$62, DW_AT_TI_end_column(0x01)
     878                      .dwendentry
     879                      .dwendtag $C$DW$62
     880              
     881              ;**************************************************************
     882              ;* UNDEFINED EXTERNAL REFERENCES                              *
     883              ;**************************************************************
     884                      .global _CopyData
     885                      .global _GetLongData
     886                      .global _GetWordData
     887                      .global _SpiaRegs
     888                      .global _GpioDataRegs
     889                      .global _ClkCfgRegs
     890                      .global _CpuSysRegs
     891                      .global _DevCfgRegs
     892                      .global _GpioCtrlRegs
     893              
     894              ;***************************************************************
     895              ;* TYPE INFORMATION                                            *
     896              ;***************************************************************
     897              
     898              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     899                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
     900                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     901              $C$DW$64        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$64, DW_AT_name("AUXPLLDIV")
     904                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_AUXPLLDIV")
     905                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     906                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     908              $C$DW$65        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$65, DW_AT_name("rsvd1")
     911                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd1")
     912                      .dwattr $C$DW$65, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     913                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     915              $C$DW$66        .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     917                      .dwattr $C$DW$66, DW_AT_name("rsvd2")
     918                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd2")
     919                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     920                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     921                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     922                      .dwendtag $C$DW$T$20
     923              
     924              
     925              $C$DW$T$22      .dwtag  DW_TAG_union_type
     926                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
     927                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     928              $C$DW$67        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   19

     929                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$21)
     930                      .dwattr $C$DW$67, DW_AT_name("all")
     931                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_all")
     932                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     934              $C$DW$68        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
     936                      .dwattr $C$DW$68, DW_AT_name("bit")
     937                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_bit")
     938                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     940                      .dwendtag $C$DW$T$22
     941              
     942              
     943              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     944                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
     945                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     946              $C$DW$69        .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     948                      .dwattr $C$DW$69, DW_AT_name("PLLEN")
     949                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PLLEN")
     950                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     951                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     953              $C$DW$70        .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     955                      .dwattr $C$DW$70, DW_AT_name("PLLCLKEN")
     956                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PLLCLKEN")
     957                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     958                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     960              $C$DW$71        .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     962                      .dwattr $C$DW$71, DW_AT_name("rsvd1")
     963                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd1")
     964                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     965                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$72        .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     969                      .dwattr $C$DW$72, DW_AT_name("rsvd2")
     970                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd2")
     971                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     972                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     973                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     974                      .dwendtag $C$DW$T$23
     975              
     976              
     977              $C$DW$T$24      .dwtag  DW_TAG_union_type
     978                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
     979                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     980              $C$DW$73        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     982                      .dwattr $C$DW$73, DW_AT_name("all")
     983                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   20

     984                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     986              $C$DW$74        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$23)
     988                      .dwattr $C$DW$74, DW_AT_name("bit")
     989                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
     990                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     991                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     992                      .dwendtag $C$DW$T$24
     993              
     994              
     995              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     996                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
     997                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     998              $C$DW$75        .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1000                      .dwattr $C$DW$75, DW_AT_name("IMULT")
    1001                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_IMULT")
    1002                      .dwattr $C$DW$75, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    1003                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1005              $C$DW$76        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1007                      .dwattr $C$DW$76, DW_AT_name("rsvd1")
    1008                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd1")
    1009                      .dwattr $C$DW$76, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1010                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$77        .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1014                      .dwattr $C$DW$77, DW_AT_name("FMULT")
    1015                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_FMULT")
    1016                      .dwattr $C$DW$77, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1017                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1019              $C$DW$78        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$78, DW_AT_name("rsvd2")
    1022                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd2")
    1023                      .dwattr $C$DW$78, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1024                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1025                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1026              $C$DW$79        .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$79, DW_AT_name("rsvd3")
    1029                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd3")
    1030                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1031                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1032                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1033                      .dwendtag $C$DW$T$25
    1034              
    1035              
    1036              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1037                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
    1038                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   21

    1039              $C$DW$80        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
    1041                      .dwattr $C$DW$80, DW_AT_name("all")
    1042                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
    1043                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$81        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$25)
    1047                      .dwattr $C$DW$81, DW_AT_name("bit")
    1048                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
    1049                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1051                      .dwendtag $C$DW$T$26
    1052              
    1053              
    1054              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1055                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
    1056                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1057              $C$DW$82        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$82, DW_AT_name("LOCKS")
    1060                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_LOCKS")
    1061                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1064              $C$DW$83        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$83, DW_AT_name("SLIPS")
    1067                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_SLIPS")
    1068                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$84        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$84, DW_AT_name("rsvd1")
    1074                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd1")
    1075                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1076                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$85        .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$85, DW_AT_name("rsvd2")
    1081                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd2")
    1082                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1083                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1084                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1085                      .dwendtag $C$DW$T$27
    1086              
    1087              
    1088              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1089                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
    1090                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1091              $C$DW$86        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1093                      .dwattr $C$DW$86, DW_AT_name("all")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   22

    1094                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1095                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$87        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$27)
    1099                      .dwattr $C$DW$87, DW_AT_name("bit")
    1100                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1101                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1103                      .dwendtag $C$DW$T$28
    1104              
    1105              
    1106              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1107                      .dwattr $C$DW$T$29, DW_AT_name("CCR_BITS")
    1108                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1109              $C$DW$88        .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$88, DW_AT_name("VMAPS")
    1112                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_VMAPS")
    1113                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1114                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1116              $C$DW$89        .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1118                      .dwattr $C$DW$89, DW_AT_name("MONPRIV")
    1119                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_MONPRIV")
    1120                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1121                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$90        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$90, DW_AT_name("ENPROT")
    1126                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ENPROT")
    1127                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1128                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1130              $C$DW$91        .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
    1133                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
    1134                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1135                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$92        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$92, DW_AT_name("rsvd2")
    1140                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd2")
    1141                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1142                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1143                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1144                      .dwendtag $C$DW$T$29
    1145              
    1146              
    1147              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1148                      .dwattr $C$DW$T$30, DW_AT_name("CCR_REG")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   23

    1149                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1150              $C$DW$93        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1152                      .dwattr $C$DW$93, DW_AT_name("all")
    1153                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1154                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$94        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$29)
    1158                      .dwattr $C$DW$94, DW_AT_name("bit")
    1159                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1160                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1162                      .dwendtag $C$DW$T$30
    1163              
    1164              
    1165              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1166                      .dwattr $C$DW$T$31, DW_AT_name("CLKCFGLOCK1_BITS")
    1167                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1168              $C$DW$95        .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$95, DW_AT_name("CLKSRCCTL1")
    1171                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1172                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1173                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$96        .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$96, DW_AT_name("CLKSRCCTL2")
    1178                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1179                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1180                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$97        .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$97, DW_AT_name("CLKSRCCTL3")
    1185                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1186                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1187                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$98        .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$98, DW_AT_name("SYSPLLCTL1")
    1192                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1193                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1194                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1196              $C$DW$99        .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$99, DW_AT_name("SYSPLLCTL2")
    1199                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1200                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1201                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$100       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   24

    1204                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$100, DW_AT_name("SYSPLLCTL3")
    1206                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1207                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1208                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1210              $C$DW$101       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$101, DW_AT_name("SYSPLLMULT")
    1213                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1214                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1215                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$102       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$102, DW_AT_name("AUXPLLCTL1")
    1220                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1221                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1222                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1224              $C$DW$103       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$103, DW_AT_name("rsvd1")
    1227                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd1")
    1228                      .dwattr $C$DW$103, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1229                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1230                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1231              $C$DW$104       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$104, DW_AT_name("AUXPLLMULT")
    1234                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1235                      .dwattr $C$DW$104, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1236                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1237                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1238              $C$DW$105       .dwtag  DW_TAG_member
    1239                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1240                      .dwattr $C$DW$105, DW_AT_name("SYSCLKDIVSEL")
    1241                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1242                      .dwattr $C$DW$105, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1243                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1245              $C$DW$106       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1247                      .dwattr $C$DW$106, DW_AT_name("AUXCLKDIVSEL")
    1248                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1249                      .dwattr $C$DW$106, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1250                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1251                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1252              $C$DW$107       .dwtag  DW_TAG_member
    1253                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1254                      .dwattr $C$DW$107, DW_AT_name("PERCLKDIVSEL")
    1255                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1256                      .dwattr $C$DW$107, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1257                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1258                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   25

    1259              $C$DW$108       .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$108, DW_AT_name("rsvd2")
    1262                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd2")
    1263                      .dwattr $C$DW$108, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1264                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1266              $C$DW$109       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$109, DW_AT_name("LOSPCP")
    1269                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_LOSPCP")
    1270                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1271                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1273              $C$DW$110       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1275                      .dwattr $C$DW$110, DW_AT_name("rsvd3")
    1276                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd3")
    1277                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1278                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1279                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1280                      .dwendtag $C$DW$T$31
    1281              
    1282              
    1283              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1284                      .dwattr $C$DW$T$32, DW_AT_name("CLKCFGLOCK1_REG")
    1285                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1286              $C$DW$111       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1288                      .dwattr $C$DW$111, DW_AT_name("all")
    1289                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1290                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$112       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$31)
    1294                      .dwattr $C$DW$112, DW_AT_name("bit")
    1295                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1296                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1298                      .dwendtag $C$DW$T$32
    1299              
    1300              
    1301              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1302                      .dwattr $C$DW$T$33, DW_AT_name("CLKSEM_BITS")
    1303                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1304              $C$DW$113       .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1306                      .dwattr $C$DW$113, DW_AT_name("SEM")
    1307                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SEM")
    1308                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1309                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1310                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1311              $C$DW$114       .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1313                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   26

    1314                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    1315                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1316                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1318              $C$DW$115       .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$115, DW_AT_name("KEY")
    1321                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_KEY")
    1322                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1323                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1324                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1325                      .dwendtag $C$DW$T$33
    1326              
    1327              
    1328              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1329                      .dwattr $C$DW$T$34, DW_AT_name("CLKSEM_REG")
    1330                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1331              $C$DW$116       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    1333                      .dwattr $C$DW$116, DW_AT_name("all")
    1334                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
    1335                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1337              $C$DW$117       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$33)
    1339                      .dwattr $C$DW$117, DW_AT_name("bit")
    1340                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
    1341                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1343                      .dwendtag $C$DW$T$34
    1344              
    1345              
    1346              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1347                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL1_BITS")
    1348                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1349              $C$DW$118       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$118, DW_AT_name("OSCCLKSRCSEL")
    1352                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1353                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1354                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$119       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$119, DW_AT_name("rsvd1")
    1359                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd1")
    1360                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1361                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1363              $C$DW$120       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$120, DW_AT_name("INTOSC2OFF")
    1366                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1367                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1368                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   27

    1369                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$121       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$121, DW_AT_name("XTALOFF")
    1373                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_XTALOFF")
    1374                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1375                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1376                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$122       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$122, DW_AT_name("WDHALTI")
    1380                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_WDHALTI")
    1381                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1382                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$123       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$123, DW_AT_name("rsvd2")
    1387                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd2")
    1388                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1389                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1391              $C$DW$124       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1393                      .dwattr $C$DW$124, DW_AT_name("rsvd3")
    1394                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd3")
    1395                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1396                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1397                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1398                      .dwendtag $C$DW$T$35
    1399              
    1400              
    1401              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1402                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL1_REG")
    1403                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1404              $C$DW$125       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1406                      .dwattr $C$DW$125, DW_AT_name("all")
    1407                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1408                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1410              $C$DW$126       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$35)
    1412                      .dwattr $C$DW$126, DW_AT_name("bit")
    1413                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1414                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1416                      .dwendtag $C$DW$T$36
    1417              
    1418              
    1419              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1420                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL2_BITS")
    1421                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1422              $C$DW$127       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   28

    1424                      .dwattr $C$DW$127, DW_AT_name("AUXOSCCLKSRCSEL")
    1425                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    1426                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1427                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1429              $C$DW$128       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$128, DW_AT_name("CANABCLKSEL")
    1432                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CANABCLKSEL")
    1433                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1434                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$129       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1438                      .dwattr $C$DW$129, DW_AT_name("CANBBCLKSEL")
    1439                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    1440                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1441                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1443              $C$DW$130       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1445                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1446                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1447                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1448                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1450              $C$DW$131       .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1452                      .dwattr $C$DW$131, DW_AT_name("rsvd2")
    1453                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd2")
    1454                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1455                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1456                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1457                      .dwendtag $C$DW$T$37
    1458              
    1459              
    1460              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1461                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL2_REG")
    1462                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1463              $C$DW$132       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
    1465                      .dwattr $C$DW$132, DW_AT_name("all")
    1466                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_all")
    1467                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1468                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1469              $C$DW$133       .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$37)
    1471                      .dwattr $C$DW$133, DW_AT_name("bit")
    1472                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_bit")
    1473                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1475                      .dwendtag $C$DW$T$38
    1476              
    1477              
    1478              $C$DW$T$39      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   29

    1479                      .dwattr $C$DW$T$39, DW_AT_name("CLKSRCCTL3_BITS")
    1480                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1481              $C$DW$134       .dwtag  DW_TAG_member
    1482                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1483                      .dwattr $C$DW$134, DW_AT_name("XCLKOUTSEL")
    1484                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    1485                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1486                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1487                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1488              $C$DW$135       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1490                      .dwattr $C$DW$135, DW_AT_name("rsvd1")
    1491                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd1")
    1492                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1493                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1494                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1495              $C$DW$136       .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1497                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    1498                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    1499                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1500                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1501                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1502                      .dwendtag $C$DW$T$39
    1503              
    1504              
    1505              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1506                      .dwattr $C$DW$T$40, DW_AT_name("CLKSRCCTL3_REG")
    1507                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1508              $C$DW$137       .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    1510                      .dwattr $C$DW$137, DW_AT_name("all")
    1511                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    1512                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$138       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$39)
    1516                      .dwattr $C$DW$138, DW_AT_name("bit")
    1517                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1518                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1519                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1520                      .dwendtag $C$DW$T$40
    1521              
    1522              
    1523              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1524                      .dwattr $C$DW$T$43, DW_AT_name("CLK_CFG_REGS")
    1525                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x32)
    1526              $C$DW$139       .dwtag  DW_TAG_member
    1527                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$34)
    1528                      .dwattr $C$DW$139, DW_AT_name("CLKSEM")
    1529                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_CLKSEM")
    1530                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$140       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   30

    1534                      .dwattr $C$DW$140, DW_AT_name("CLKCFGLOCK1")
    1535                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    1536                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1537                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$141       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$41)
    1540                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1541                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1542                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1543                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1544              $C$DW$142       .dwtag  DW_TAG_member
    1545                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$36)
    1546                      .dwattr $C$DW$142, DW_AT_name("CLKSRCCTL1")
    1547                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1548                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1549                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$143       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$38)
    1552                      .dwattr $C$DW$143, DW_AT_name("CLKSRCCTL2")
    1553                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1554                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1555                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$144       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$40)
    1558                      .dwattr $C$DW$144, DW_AT_name("CLKSRCCTL3")
    1559                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1560                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1561                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$145       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$504)
    1564                      .dwattr $C$DW$145, DW_AT_name("SYSPLLCTL1")
    1565                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1566                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1567                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1568              $C$DW$146       .dwtag  DW_TAG_member
    1569                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$506)
    1570                      .dwattr $C$DW$146, DW_AT_name("SYSPLLCTL2")
    1571                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1572                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1573                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1574              $C$DW$147       .dwtag  DW_TAG_member
    1575                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$508)
    1576                      .dwattr $C$DW$147, DW_AT_name("SYSPLLCTL3")
    1577                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1578                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1579                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$148       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$510)
    1582                      .dwattr $C$DW$148, DW_AT_name("SYSPLLMULT")
    1583                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1584                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1585                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$149       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$512)
    1588                      .dwattr $C$DW$149, DW_AT_name("SYSPLLSTS")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   31

    1589                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SYSPLLSTS")
    1590                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1591                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$150       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$24)
    1594                      .dwattr $C$DW$150, DW_AT_name("AUXPLLCTL1")
    1595                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1596                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1597                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$151       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$41)
    1600                      .dwattr $C$DW$151, DW_AT_name("rsvd2")
    1601                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd2")
    1602                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1603                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$152       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$26)
    1606                      .dwattr $C$DW$152, DW_AT_name("AUXPLLMULT")
    1607                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1608                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1609                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1610              $C$DW$153       .dwtag  DW_TAG_member
    1611                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$28)
    1612                      .dwattr $C$DW$153, DW_AT_name("AUXPLLSTS")
    1613                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_AUXPLLSTS")
    1614                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1615                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$154       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$500)
    1618                      .dwattr $C$DW$154, DW_AT_name("SYSCLKDIVSEL")
    1619                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1620                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1621                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$155       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$22)
    1624                      .dwattr $C$DW$155, DW_AT_name("AUXCLKDIVSEL")
    1625                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1626                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1627                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$156       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$443)
    1630                      .dwattr $C$DW$156, DW_AT_name("PERCLKDIVSEL")
    1631                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1632                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1633                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$157       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$518)
    1636                      .dwattr $C$DW$157, DW_AT_name("XCLKOUTDIVSEL")
    1637                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    1638                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1639                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1640              $C$DW$158       .dwtag  DW_TAG_member
    1641                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$42)
    1642                      .dwattr $C$DW$158, DW_AT_name("rsvd3")
    1643                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd3")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   32

    1644                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1645                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$159       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$401)
    1648                      .dwattr $C$DW$159, DW_AT_name("LOSPCP")
    1649                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_LOSPCP")
    1650                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1651                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1652              $C$DW$160       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$407)
    1654                      .dwattr $C$DW$160, DW_AT_name("MCDCR")
    1655                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_MCDCR")
    1656                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1657                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1658              $C$DW$161       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$516)
    1660                      .dwattr $C$DW$161, DW_AT_name("X1CNT")
    1661                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_X1CNT")
    1662                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1663                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1664                      .dwendtag $C$DW$T$43
    1665              
    1666              $C$DW$162       .dwtag  DW_TAG_TI_far_type
    1667                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$43)
    1668              $C$DW$T$519     .dwtag  DW_TAG_volatile_type
    1669                      .dwattr $C$DW$T$519, DW_AT_type(*$C$DW$162)
    1670              
    1671              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1672                      .dwattr $C$DW$T$44, DW_AT_name("CPU2RESCTL_BITS")
    1673                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1674              $C$DW$163       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$163, DW_AT_name("RESET")
    1677                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_RESET")
    1678                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1679                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$164       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$164, DW_AT_name("rsvd1")
    1684                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd1")
    1685                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1686                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1688              $C$DW$165       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1690                      .dwattr $C$DW$165, DW_AT_name("KEY")
    1691                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_KEY")
    1692                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1693                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1694                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1695                      .dwendtag $C$DW$T$44
    1696              
    1697              
    1698              $C$DW$T$45      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   33

    1699                      .dwattr $C$DW$T$45, DW_AT_name("CPU2RESCTL_REG")
    1700                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1701              $C$DW$166       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    1703                      .dwattr $C$DW$166, DW_AT_name("all")
    1704                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_all")
    1705                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$167       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$44)
    1709                      .dwattr $C$DW$167, DW_AT_name("bit")
    1710                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_bit")
    1711                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1713                      .dwendtag $C$DW$T$45
    1714              
    1715              
    1716              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1717                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL0_BITS")
    1718                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1719              $C$DW$168       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$168, DW_AT_name("EPWM1")
    1722                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_EPWM1")
    1723                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1724                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1726              $C$DW$169       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1728                      .dwattr $C$DW$169, DW_AT_name("EPWM2")
    1729                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_EPWM2")
    1730                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1733              $C$DW$170       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$170, DW_AT_name("EPWM3")
    1736                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_EPWM3")
    1737                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1738                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1739                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1740              $C$DW$171       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$171, DW_AT_name("EPWM4")
    1743                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_EPWM4")
    1744                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1745                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$172       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1749                      .dwattr $C$DW$172, DW_AT_name("EPWM5")
    1750                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_EPWM5")
    1751                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1752                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   34

    1754              $C$DW$173       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1756                      .dwattr $C$DW$173, DW_AT_name("EPWM6")
    1757                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_EPWM6")
    1758                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1759                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$174       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$174, DW_AT_name("EPWM7")
    1764                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_EPWM7")
    1765                      .dwattr $C$DW$174, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1766                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1768              $C$DW$175       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$175, DW_AT_name("EPWM8")
    1771                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_EPWM8")
    1772                      .dwattr $C$DW$175, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1773                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1774                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$176       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$176, DW_AT_name("EPWM9")
    1778                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_EPWM9")
    1779                      .dwattr $C$DW$176, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1780                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1782              $C$DW$177       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1784                      .dwattr $C$DW$177, DW_AT_name("EPWM10")
    1785                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_EPWM10")
    1786                      .dwattr $C$DW$177, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1787                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$178       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1791                      .dwattr $C$DW$178, DW_AT_name("EPWM11")
    1792                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_EPWM11")
    1793                      .dwattr $C$DW$178, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1796              $C$DW$179       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$179, DW_AT_name("EPWM12")
    1799                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_EPWM12")
    1800                      .dwattr $C$DW$179, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1801                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$180       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1805                      .dwattr $C$DW$180, DW_AT_name("rsvd1")
    1806                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd1")
    1807                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1808                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   35

    1809                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1810              $C$DW$181       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1812                      .dwattr $C$DW$181, DW_AT_name("rsvd2")
    1813                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd2")
    1814                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1815                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1816                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1817                      .dwendtag $C$DW$T$46
    1818              
    1819              
    1820              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1821                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL0_REG")
    1822                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1823              $C$DW$182       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    1825                      .dwattr $C$DW$182, DW_AT_name("all")
    1826                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    1827                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$183       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$46)
    1831                      .dwattr $C$DW$183, DW_AT_name("bit")
    1832                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    1833                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1835                      .dwendtag $C$DW$T$47
    1836              
    1837              
    1838              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1839                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL11_BITS")
    1840                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1841              $C$DW$184       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$184, DW_AT_name("ADC1")
    1844                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADC1")
    1845                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1846                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1847                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1848              $C$DW$185       .dwtag  DW_TAG_member
    1849                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1850                      .dwattr $C$DW$185, DW_AT_name("ADC2")
    1851                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ADC2")
    1852                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1853                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1854                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$186       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1857                      .dwattr $C$DW$186, DW_AT_name("ADC3")
    1858                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ADC3")
    1859                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1860                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1862              $C$DW$187       .dwtag  DW_TAG_member
    1863                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   36

    1864                      .dwattr $C$DW$187, DW_AT_name("ADC4")
    1865                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ADC4")
    1866                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1867                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1869              $C$DW$188       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1871                      .dwattr $C$DW$188, DW_AT_name("rsvd1")
    1872                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd1")
    1873                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1874                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1875                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1876              $C$DW$189       .dwtag  DW_TAG_member
    1877                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1878                      .dwattr $C$DW$189, DW_AT_name("rsvd2")
    1879                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd2")
    1880                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1881                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1882                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1883                      .dwendtag $C$DW$T$48
    1884              
    1885              
    1886              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1887                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL11_REG")
    1888                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1889              $C$DW$190       .dwtag  DW_TAG_member
    1890                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    1891                      .dwattr $C$DW$190, DW_AT_name("all")
    1892                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_all")
    1893                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1894                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1895              $C$DW$191       .dwtag  DW_TAG_member
    1896                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$48)
    1897                      .dwattr $C$DW$191, DW_AT_name("bit")
    1898                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_bit")
    1899                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1901                      .dwendtag $C$DW$T$49
    1902              
    1903              
    1904              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1905                      .dwattr $C$DW$T$50, DW_AT_name("CPUSEL12_BITS")
    1906                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1907              $C$DW$192       .dwtag  DW_TAG_member
    1908                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1909                      .dwattr $C$DW$192, DW_AT_name("CMPSS1")
    1910                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CMPSS1")
    1911                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1912                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1913                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1914              $C$DW$193       .dwtag  DW_TAG_member
    1915                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1916                      .dwattr $C$DW$193, DW_AT_name("CMPSS2")
    1917                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CMPSS2")
    1918                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   37

    1919                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1920                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$194       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1923                      .dwattr $C$DW$194, DW_AT_name("CMPSS3")
    1924                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CMPSS3")
    1925                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1926                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1927                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1928              $C$DW$195       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1930                      .dwattr $C$DW$195, DW_AT_name("CMPSS4")
    1931                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_CMPSS4")
    1932                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1933                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1934                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1935              $C$DW$196       .dwtag  DW_TAG_member
    1936                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1937                      .dwattr $C$DW$196, DW_AT_name("CMPSS5")
    1938                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CMPSS5")
    1939                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1940                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1941                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1942              $C$DW$197       .dwtag  DW_TAG_member
    1943                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1944                      .dwattr $C$DW$197, DW_AT_name("CMPSS6")
    1945                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CMPSS6")
    1946                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1947                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1948                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1949              $C$DW$198       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1951                      .dwattr $C$DW$198, DW_AT_name("CMPSS7")
    1952                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CMPSS7")
    1953                      .dwattr $C$DW$198, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1954                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1955                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1956              $C$DW$199       .dwtag  DW_TAG_member
    1957                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1958                      .dwattr $C$DW$199, DW_AT_name("CMPSS8")
    1959                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CMPSS8")
    1960                      .dwattr $C$DW$199, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1961                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1962                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$200       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1965                      .dwattr $C$DW$200, DW_AT_name("rsvd1")
    1966                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd1")
    1967                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1968                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1969                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1970              $C$DW$201       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1972                      .dwattr $C$DW$201, DW_AT_name("rsvd2")
    1973                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   38

    1974                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1975                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1976                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1977                      .dwendtag $C$DW$T$50
    1978              
    1979              
    1980              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1981                      .dwattr $C$DW$T$51, DW_AT_name("CPUSEL12_REG")
    1982                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1983              $C$DW$202       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    1985                      .dwattr $C$DW$202, DW_AT_name("all")
    1986                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
    1987                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1988                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1989              $C$DW$203       .dwtag  DW_TAG_member
    1990                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$50)
    1991                      .dwattr $C$DW$203, DW_AT_name("bit")
    1992                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
    1993                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1995                      .dwendtag $C$DW$T$51
    1996              
    1997              
    1998              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1999                      .dwattr $C$DW$T$52, DW_AT_name("CPUSEL14_BITS")
    2000                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    2001              $C$DW$204       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2003                      .dwattr $C$DW$204, DW_AT_name("rsvd1")
    2004                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd1")
    2005                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2006                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2007                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2008              $C$DW$205       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2010                      .dwattr $C$DW$205, DW_AT_name("Buffered_DAC12_1")
    2011                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Buffered_DAC12_1")
    2012                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2013                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2014                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2015              $C$DW$206       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2017                      .dwattr $C$DW$206, DW_AT_name("Buffered_DAC12_2")
    2018                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Buffered_DAC12_2")
    2019                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2020                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2021                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2022              $C$DW$207       .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2024                      .dwattr $C$DW$207, DW_AT_name("Buffered_DAC12_3")
    2025                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Buffered_DAC12_3")
    2026                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2027                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2028                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0493210                         PAGE   39

    2029              $C$DW$208       .dwtag  DW_TAG_member
    2030                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2031                      .dwattr $C$DW$208, DW_AT_name("rsvd2")
    2032                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd2")
    2033                      .dwattr $C$DW$208, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2034                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2035                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2036                      .dwendtag $C$DW$T$52
    2037              
    2038              
    2039              $C$DW$T$53      .dwtag  DW_TAG_union_type
    2040                      .dwattr $C$DW$T$53, DW_AT_name("CPUSEL14_REG")
    2041                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    2042              $C$DW$209       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    2044                      .dwattr $C$DW$209, DW_AT_name("all")
    2045                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_all")
    2046                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2047                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$210       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$52)
    2050                      .dwattr $C$DW$210, DW_AT_name("bit")
    2051                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_bit")
    2052                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2054                      .dwendtag $C$DW$T$53
    2055              
    2056              
    2057              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    2058                      .dwattr $C$DW$T$54, DW_AT_name("CPUSEL1_BITS")
    2059                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    2060              $C$DW$211       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2062                      .dwattr $C$DW$211, DW_AT_name("ECAP1")
    2063                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_ECAP1")
    2064                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2065                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2066                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2067              $C$DW$212       .dwtag  DW_TAG_member
    2068                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2069                      .dwattr $C$DW$212, DW_AT_name("ECAP2")
    2070                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_ECAP2")
    2071                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2072                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2074              $C$DW$213       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2076                      .dwattr $C$DW$213, DW_AT_name("ECAP3")
    2077                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_ECAP3")
