TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:20 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0965210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:19 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("stringDescriptors")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_stringDescriptors")

    1516                      .dwattr $C$DW$99, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
    1517                      .dwattr $C$DW$99, DW_AT_TI_begin_line(0x15c)
    1518                      .dwattr $C$DW$99, DW_AT_TI_begin_column(0x0d)
    1519                      .dwattr $C$DW$99, DW_AT_TI_max_frame_size(-2)
    1520                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1521              
    1522                      .dwfde $C$DW$CIE, _StallEp0
    1523              
    1524              ;***************************************************************
    1525              ;* FNAME: _StallEp0                     FR SIZE:   0           *
    1526              ;*                                                             *
    1527              ;* FUNCTION ENVIRONMENT                                        *
    1528              ;*                                                             *
    1529              ;* FUNCTION PROPERTIES                                         *
    1530              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1531              ;***************************************************************
    1532              
    1533 000001d5       _StallEp0:
    1534                      .dwcfi  cfa_offset, -2
    1535                      .dwcfi  save_reg_to_mem, 26, 0
    1536                      .dwcfi  save_reg_to_reg, 78, 26
    1537                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1538 000001d5 9A60          MOVB      AL,#96                ; [CPU_] |350| 
    1539 000001d6 8F04          MOVL      XAR4,#262402          ; [CPU_U] |350| 
         000001d7 0102 
    1540 000001d8 3CC4          MOVB      *+XAR4[0],AL.LSB      ; [CPU_] |350| 
    1541                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1542              $C$DW$100       .dwtag  DW_TAG_TI_branch
    1543                      .dwattr $C$DW$100, DW_AT_low_pc(0x00)
    1544                      .dwattr $C$DW$100, DW_AT_TI_return
    1545 000001d9 0006          LRETR     ; [CPU_] 
    1546                      ; return occurs ; [] 
    1547                      .dwattr $C$DW$99, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
    1548                      .dwattr $C$DW$99, DW_AT_TI_end_line(0x15f)
    1549                      .dwattr $C$DW$99, DW_AT_TI_end_column(0x01)
    1550                      .dwendentry
    1551                      .dwendtag $C$DW$99
    1552              
    1553              ;**************************************************************
    1554              ;* UNDEFINED EXTERNAL REFERENCES                              *
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:20 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0965210                         PAGE   31

    1555              ;**************************************************************
    1556                      .global _stringDescriptors
    1557                      .global _AckUsbInterrupt
    1558                      .global _CombineUsbDescriptors
    1559                      .global _dfuDeviceDescriptor
    1560              
    1561              ;***************************************************************
    1562              ;* TYPE INFORMATION                                            *
    1563              ;***************************************************************
    1564              
    1565              $C$DW$T$29      .dwtag  DW_TAG_enumeration_type
    1566                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1567              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_IDLE"), DW_AT_const_value(0x00)
    1568              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_TX"), DW_AT_const_value(0x01)
    1569              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_RX"), DW_AT_const_value(0x02)
    1570              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_STALL"), DW_AT_const_value(0x03)
    1571              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_STATUS"), DW_AT_const_value(0x04)
    1572                      .dwendtag $C$DW$T$29
    1573              
    1574              $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("eEndpointState")
    1575                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1576                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1577              
    1578              $C$DW$T$36      .dwtag  DW_TAG_enumeration_type
    1579                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1580              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_MORE_DATA"), DW_AT_const_value(0x00)
    1581              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_END_DATA"), DW_AT_const_value(0x01)
    1582                      .dwendtag $C$DW$T$36
    1583              
    1584              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("eDataEnd")
    1585                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1586                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1587              
    1588              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1589                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1590              $C$DW$108       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$108, DW_AT_name("recipient")
    1593                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_recipient")
    1594                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    1595                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1597              $C$DW$109       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$109, DW_AT_name("reqType")
    1600                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_reqType")
    1601                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x02)
    1602                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$110       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$110, DW_AT_name("dataDir")
    1607                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_dataDir")
    1608                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1609                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:20 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0965210                         PAGE   32

    1610                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$111       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$111, DW_AT_name("bRequest")
    1614                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bRequest")
    1615                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1616                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1618                      .dwendtag $C$DW$T$20
    1619              
    1620              
    1621              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1622                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1623              $C$DW$112       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1625                      .dwattr $C$DW$112, DW_AT_name("bmRequestType_bRequest")
    1626                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bmRequestType_bRequest")
    1627                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$113       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$113, DW_AT_name("wValue")
    1632                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_wValue")
    1633                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1634                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1635              $C$DW$114       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$114, DW_AT_name("wIndex")
    1638                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_wIndex")
    1639                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1640                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1641              $C$DW$115       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1643                      .dwattr $C$DW$115, DW_AT_name("wLength")
    1644                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_wLength")
    1645                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1646                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1647                      .dwendtag $C$DW$T$21
    1648              
    1649              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbRequestPacket")
    1650                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
    1651                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1652              $C$DW$116       .dwtag  DW_TAG_TI_far_type
    1653                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$31)
    1654              $C$DW$T$32      .dwtag  DW_TAG_const_type
    1655                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$116)
    1656              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1657                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1658                      .dwattr $C$DW$T$33, DW_AT_address_class(0x16)
    1659              
    1660              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1661                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1662              $C$DW$117       .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1664                      .dwattr $C$DW$117, DW_AT_name("bDescriptorType_bLength")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:20 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0965210                         PAGE   33

    1665                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
    1666                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1667                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1668              $C$DW$118       .dwtag  DW_TAG_member
    1669                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$24)
    1670                      .dwattr $C$DW$118, DW_AT_name("bString")
    1671                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bString")
    1672                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1673                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1674                      .dwendtag $C$DW$T$25
    1675              
    1676              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbStringDescriptor")
    1677                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$25)
    1678                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    1679              $C$DW$119       .dwtag  DW_TAG_TI_far_type
    1680                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$40)
    1681              $C$DW$T$41      .dwtag  DW_TAG_const_type
    1682                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$119)
    1683              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1684                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1685                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
    1686              $C$DW$120       .dwtag  DW_TAG_TI_far_type
    1687                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$42)
    1688              $C$DW$T$43      .dwtag  DW_TAG_const_type
    1689                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$120)
    1690              
    1691              $C$DW$T$44      .dwtag  DW_TAG_array_type
    1692                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
    1693                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1694              $C$DW$121       .dwtag  DW_TAG_subrange_type
    1695                      .dwendtag $C$DW$T$44
    1696              
    1697              
    1698              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1699                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x09)
    1700              $C$DW$122       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$122, DW_AT_name("bDescriptorType_bLength")
    1703                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
    1704                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1706              $C$DW$123       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$123, DW_AT_name("bcdUSB")
    1709                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bcdUSB")
    1710                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1711                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1712              $C$DW$124       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$124, DW_AT_name("bDeviceSubClass_bDeviceClass")
    1715                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bDeviceSubClass_bDeviceClass")
    1716                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1717                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1718              $C$DW$125       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:20 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0965210                         PAGE   34

    1720                      .dwattr $C$DW$125, DW_AT_name("bMaxPacketSize_bDeviceProtocol")
    1721                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bMaxPacketSize_bDeviceProtocol")
    1722                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1723                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1724              $C$DW$126       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$126, DW_AT_name("idVendor")
    1727                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_idVendor")
    1728                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1729                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1730              $C$DW$127       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$127, DW_AT_name("idProduct")
    1733                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_idProduct")
    1734                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1735                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1736              $C$DW$128       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1738                      .dwattr $C$DW$128, DW_AT_name("bcdDevice")
    1739                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bcdDevice")
    1740                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1741                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1742              $C$DW$129       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$129, DW_AT_name("iProduct_iManufacturer")
    1745                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_iProduct_iManufacturer")
    1746                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1747                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1748              $C$DW$130       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$130, DW_AT_name("bNumConfigurations_iSerialNumber")
    1751                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bNumConfigurations_iSerialNumber")
    1752                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1753                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1754                      .dwendtag $C$DW$T$26
    1755              
    1756              $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbDeviceDescriptor")
    1757                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$26)
    1758                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    1759              $C$DW$131       .dwtag  DW_TAG_TI_far_type
    1760                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$46)
    1761              $C$DW$T$47      .dwtag  DW_TAG_const_type
    1762                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$131)
    1763              
    1764              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1765                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1766              $C$DW$132       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    1768                      .dwattr $C$DW$132, DW_AT_name("bwPollTimeout_bStatus")
    1769                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bwPollTimeout_bStatus")
    1770                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$133       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$133, DW_AT_name("iString_bState")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:20 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0965210                         PAGE   35

    1775                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_iString_bState")
    1776                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1777                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1778                      .dwendtag $C$DW$T$28
    1779              
    1780              $C$DW$T$49      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbDfuStatusPacket")
    1781                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$28)
    1782                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1783              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1784                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1785                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1786                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1787              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1788                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1789                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1790                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1791              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1792                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1793                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1794                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1795              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1796                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1797                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1798                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1799              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1800                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1801                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1802                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1803              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1804                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1805                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1806                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1807              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1808                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1809                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1810                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1811              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    1812                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$10)
    1813                      .dwattr $C$DW$T$66, DW_AT_address_class(0x16)
    1814              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1815                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1816                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1817                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1818              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1819                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1820                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1821              $C$DW$134       .dwtag  DW_TAG_TI_far_type
    1822                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1823              $C$DW$T$58      .dwtag  DW_TAG_const_type
    1824                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$134)
    1825              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1826                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    1827                      .dwattr $C$DW$T$59, DW_AT_address_class(0x16)
    1828              $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    1829                      .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:20 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
