TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:28:10 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("c2brom_handle_nmi_at_start")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_c2brom_handle_nmi_at_start")

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   31

    1540                      ; call occurs [#_sysctl_wdog_disable] ; [] |502| 
    1541                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1542 00000260 7625   ESTOP0
    1543                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1544 00000261       $C$L42:    
    1545 00000261       $C$DW$L$_c2brom_handle_idle_lpm$2$B:
    1546                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1547 00000261 7621   IDLE
    1548                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1549 00000262 6FFF          B         $C$L42,UNC            ; [CPU_] |506| 
    1550                      ; branch occurs ; [] |506| 
    1551              $C$DW$L$_c2brom_handle_idle_lpm$2$E:
    1552              
    1553              $C$DW$102       .dwtag  DW_TAG_TI_loop
    1554                      .dwattr $C$DW$102, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0801210:$C$L42:1:1380659290
    1555                      .dwattr $C$DW$102, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bo
    1556                      .dwattr $C$DW$102, DW_AT_TI_begin_line(0x1fa)
    1557                      .dwattr $C$DW$102, DW_AT_TI_end_line(0x1fd)
    1558              $C$DW$103       .dwtag  DW_TAG_TI_loop_range
    1559                      .dwattr $C$DW$103, DW_AT_low_pc($C$DW$L$_c2brom_handle_idle_lpm$2$B)
    1560                      .dwattr $C$DW$103, DW_AT_high_pc($C$DW$L$_c2brom_handle_idle_lpm$2$E)
    1561                      .dwendtag $C$DW$102
    1562              
    1563                      .dwattr $C$DW$100, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boot
    1564                      .dwattr $C$DW$100, DW_AT_TI_end_line(0x1fe)
    1565                      .dwattr $C$DW$100, DW_AT_TI_end_column(0x01)
    1566                      .dwendentry
    1567                      .dwendtag $C$DW$100
    1568              
    1569              ;**************************************************************
    1570              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1571              ;**************************************************************
    1572                      .global _c2brom_handle_nmi_at_start
    1573                      .global _c2brom_c1c2_ipc_int1_isr
    1574                      .global _c2brom_handle_nmi
    1575                      .global _c2brom_init_pie_control
    1576                      .global _c2brom_set_c2c1_boot_status
    1577                      .global _c2brom_itrap_isr
    1578                      .global _c2brom_init_pie_vect_table
    1579                      .global _sysctl_wdog_enable
    1580                      .global _sysctl_wdog_disable
    1581                      .global _SelectBootMode
    1582                      .global _c1c2_branch_addr
    1583                      .global _iTrap_addr
    1584                      .global _SPI_Boot
    1585                      .global _Parallel_Boot
    1586                      .global _SCI_Boot
    1587                      .global _DCAN_Boot
    1588                      .global _I2C_Boot
    1589                      .global _NmiIntruptRegs
    1590                      .global _PieCtrlRegs
    1591                      .global _DcsmRegsZ1
    1592                      .global _DcsmRegsZ2
    1593                      .global _CpuSysRegs
    1594                      .global _FlashCtrlRegs
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   32

    1595                      .global _PieVectTable
    1596              
    1597              ;***************************************************************
    1598              ;* TYPE INFORMATION                                            *
    1599              ;***************************************************************
    1600              
    1601              $C$DW$T$212     .dwtag  DW_TAG_enumeration_type
    1602                      .dwattr $C$DW$T$212, DW_AT_byte_size(0x01)
    1603              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
    1604              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
    1605              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
    1606              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
    1607                      .dwendtag $C$DW$T$212
    1608              
    1609              $C$DW$T$213     .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
    1610                      .dwattr $C$DW$T$213, DW_AT_type(*$C$DW$T$212)
    1611                      .dwattr $C$DW$T$213, DW_AT_language(DW_LANG_C)
    1612              
    1613              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1614                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
    1615                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1616              $C$DW$108       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$108, DW_AT_name("VMAPS")
    1619                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_VMAPS")
    1620                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1621                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1623              $C$DW$109       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$109, DW_AT_name("MONPRIV")
    1626                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_MONPRIV")
    1627                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1628                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1630              $C$DW$110       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1632                      .dwattr $C$DW$110, DW_AT_name("ENPROT")
    1633                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ENPROT")
    1634                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1635                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$111       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1639                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1640                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1641                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1642                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1644              $C$DW$112       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$112, DW_AT_name("rsvd2")
    1647                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd2")
    1648                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1649                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   33

    1650                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1651                      .dwendtag $C$DW$T$20
    1652              
    1653              
    1654              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1655                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
    1656                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1657              $C$DW$113       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    1659                      .dwattr $C$DW$113, DW_AT_name("all")
    1660                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    1661                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$114       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1665                      .dwattr $C$DW$114, DW_AT_name("bit")
    1666                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    1667                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1668                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1669                      .dwendtag $C$DW$T$22
    1670              
    1671              
    1672              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1673                      .dwattr $C$DW$T$23, DW_AT_name("CPUSYSLOCK1_BITS")
    1674                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1675              $C$DW$115       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1677                      .dwattr $C$DW$115, DW_AT_name("HIBBOOTMODE")
    1678                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1679                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1680                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1681                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1682              $C$DW$116       .dwtag  DW_TAG_member
    1683                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1684                      .dwattr $C$DW$116, DW_AT_name("IORESTOREADDR")
    1685                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1686                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1687                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1689              $C$DW$117       .dwtag  DW_TAG_member
    1690                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1691                      .dwattr $C$DW$117, DW_AT_name("PIEVERRADDR")
    1692                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1693                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1694                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$118       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$118, DW_AT_name("PCLKCR0")
    1699                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PCLKCR0")
    1700                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1701                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1702                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1703              $C$DW$119       .dwtag  DW_TAG_member
    1704                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   34

    1705                      .dwattr $C$DW$119, DW_AT_name("PCLKCR1")
    1706                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PCLKCR1")
    1707                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1708                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1710              $C$DW$120       .dwtag  DW_TAG_member
    1711                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1712                      .dwattr $C$DW$120, DW_AT_name("PCLKCR2")
    1713                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PCLKCR2")
    1714                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1715                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$121       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$121, DW_AT_name("PCLKCR3")
    1720                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PCLKCR3")
    1721                      .dwattr $C$DW$121, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1722                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1724              $C$DW$122       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$122, DW_AT_name("PCLKCR4")
    1727                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PCLKCR4")
    1728                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1729                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$123       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$123, DW_AT_name("PCLKCR5")
    1734                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PCLKCR5")
    1735                      .dwattr $C$DW$123, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1736                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1738              $C$DW$124       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1740                      .dwattr $C$DW$124, DW_AT_name("PCLKCR6")
    1741                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PCLKCR6")
    1742                      .dwattr $C$DW$124, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1743                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1745              $C$DW$125       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1747                      .dwattr $C$DW$125, DW_AT_name("PCLKCR7")
    1748                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PCLKCR7")
    1749                      .dwattr $C$DW$125, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1750                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1752              $C$DW$126       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$126, DW_AT_name("PCLKCR8")
    1755                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PCLKCR8")
    1756                      .dwattr $C$DW$126, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1757                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$127       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   35

    1760                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$127, DW_AT_name("PCLKCR9")
    1762                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PCLKCR9")
    1763                      .dwattr $C$DW$127, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1764                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1766              $C$DW$128       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$128, DW_AT_name("PCLKCR10")
    1769                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PCLKCR10")
    1770                      .dwattr $C$DW$128, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1771                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$129       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1775                      .dwattr $C$DW$129, DW_AT_name("PCLKCR11")
    1776                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PCLKCR11")
    1777                      .dwattr $C$DW$129, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1778                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$130       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$130, DW_AT_name("PCLKCR12")
    1783                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PCLKCR12")
    1784                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$131       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$131, DW_AT_name("PCLKCR13")
    1790                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PCLKCR13")
    1791                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1792                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1793                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1794              $C$DW$132       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$132, DW_AT_name("PCLKCR14")
    1797                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PCLKCR14")
    1798                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1799                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1800                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$133       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1803                      .dwattr $C$DW$133, DW_AT_name("PCLKCR15")
    1804                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PCLKCR15")
    1805                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1806                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1807                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1808              $C$DW$134       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$134, DW_AT_name("PCLKCR16")
    1811                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PCLKCR16")
    1812                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1813                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1814                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   36

    1815              $C$DW$135       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$135, DW_AT_name("SECMSEL")
    1818                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SECMSEL")
    1819                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1821                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$136       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$136, DW_AT_name("LPMCR")
    1825                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_LPMCR")
    1826                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1827                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1828                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$137       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$137, DW_AT_name("GPIOLPMSEL0")
    1832                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1833                      .dwattr $C$DW$137, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1834                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1835                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$138       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$138, DW_AT_name("GPIOLPMSEL1")
    1839                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1840                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1841                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1842                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$139       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1845                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
    1846                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1847                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1848                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1849                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1850                      .dwendtag $C$DW$T$23
    1851              
    1852              
    1853              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1854                      .dwattr $C$DW$T$24, DW_AT_name("CPUSYSLOCK1_REG")
    1855                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1856              $C$DW$140       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1858                      .dwattr $C$DW$140, DW_AT_name("all")
    1859                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1860                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1861                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1862              $C$DW$141       .dwtag  DW_TAG_member
    1863                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$23)
    1864                      .dwattr $C$DW$141, DW_AT_name("bit")
    1865                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1866                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1868                      .dwendtag $C$DW$T$24
    1869              
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   37

    1870              
    1871              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1872                      .dwattr $C$DW$T$29, DW_AT_name("CPU_SYS_REGS")
    1873                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x82)
    1874              $C$DW$142       .dwtag  DW_TAG_member
    1875                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$24)
    1876                      .dwattr $C$DW$142, DW_AT_name("CPUSYSLOCK1")
    1877                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    1878                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1879                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1880              $C$DW$143       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    1882                      .dwattr $C$DW$143, DW_AT_name("rsvd1")
    1883                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd1")
    1884                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1885                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1886              $C$DW$144       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    1888                      .dwattr $C$DW$144, DW_AT_name("HIBBOOTMODE")
    1889                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1890                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1891                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1892              $C$DW$145       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$61)
    1894                      .dwattr $C$DW$145, DW_AT_name("IORESTOREADDR")
    1895                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1896                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1897                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1898              $C$DW$146       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$160)
    1900                      .dwattr $C$DW$146, DW_AT_name("PIEVERRADDR")
    1901                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1902                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1903                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1904              $C$DW$147       .dwtag  DW_TAG_member
    1905                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$26)
    1906                      .dwattr $C$DW$147, DW_AT_name("rsvd2")
    1907                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd2")
    1908                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1909                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1910              $C$DW$148       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$76)
    1912                      .dwattr $C$DW$148, DW_AT_name("PCLKCR0")
    1913                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PCLKCR0")
    1914                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1915                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1916              $C$DW$149       .dwtag  DW_TAG_member
    1917                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$90)
    1918                      .dwattr $C$DW$149, DW_AT_name("PCLKCR1")
    1919                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PCLKCR1")
    1920                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1921                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1922              $C$DW$150       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$92)
    1924                      .dwattr $C$DW$150, DW_AT_name("PCLKCR2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   38

    1925                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PCLKCR2")
    1926                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1927                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1928              $C$DW$151       .dwtag  DW_TAG_member
    1929                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$94)
    1930                      .dwattr $C$DW$151, DW_AT_name("PCLKCR3")
    1931                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PCLKCR3")
    1932                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1933                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1934              $C$DW$152       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$96)
    1936                      .dwattr $C$DW$152, DW_AT_name("PCLKCR4")
    1937                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PCLKCR4")
    1938                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1939                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1940              $C$DW$153       .dwtag  DW_TAG_member
    1941                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$98)
    1942                      .dwattr $C$DW$153, DW_AT_name("PCLKCR5")
    1943                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PCLKCR5")
    1944                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1945                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1946              $C$DW$154       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$100)
    1948                      .dwattr $C$DW$154, DW_AT_name("PCLKCR6")
    1949                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PCLKCR6")
    1950                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1951                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1952              $C$DW$155       .dwtag  DW_TAG_member
    1953                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$102)
    1954                      .dwattr $C$DW$155, DW_AT_name("PCLKCR7")
    1955                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PCLKCR7")
    1956                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1957                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1958              $C$DW$156       .dwtag  DW_TAG_member
    1959                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$104)
    1960                      .dwattr $C$DW$156, DW_AT_name("PCLKCR8")
    1961                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PCLKCR8")
    1962                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1963                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$157       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$106)
    1966                      .dwattr $C$DW$157, DW_AT_name("PCLKCR9")
    1967                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PCLKCR9")
    1968                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1969                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1970              $C$DW$158       .dwtag  DW_TAG_member
    1971                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$78)
    1972                      .dwattr $C$DW$158, DW_AT_name("PCLKCR10")
    1973                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PCLKCR10")
    1974                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1975                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$159       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$80)
    1978                      .dwattr $C$DW$159, DW_AT_name("PCLKCR11")
    1979                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PCLKCR11")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   39

    1980                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1981                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1982              $C$DW$160       .dwtag  DW_TAG_member
    1983                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$82)
    1984                      .dwattr $C$DW$160, DW_AT_name("PCLKCR12")
    1985                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PCLKCR12")
    1986                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1987                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$161       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$84)
    1990                      .dwattr $C$DW$161, DW_AT_name("PCLKCR13")
    1991                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PCLKCR13")
    1992                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1993                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1994              $C$DW$162       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$86)
    1996                      .dwattr $C$DW$162, DW_AT_name("PCLKCR14")
    1997                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PCLKCR14")
    1998                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1999                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2000              $C$DW$163       .dwtag  DW_TAG_member
    2001                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    2002                      .dwattr $C$DW$163, DW_AT_name("rsvd3")
    2003                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd3")
    2004                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2005                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$164       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$88)
    2008                      .dwattr $C$DW$164, DW_AT_name("PCLKCR16")
    2009                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PCLKCR16")
    2010                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2011                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2012              $C$DW$165       .dwtag  DW_TAG_member
    2013                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$28)
    2014                      .dwattr $C$DW$165, DW_AT_name("rsvd4")
    2015                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd4")
    2016                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2017                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2018              $C$DW$166       .dwtag  DW_TAG_member
    2019                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    2020                      .dwattr $C$DW$166, DW_AT_name("CCR")
    2021                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_CCR")
    2022                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2023                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2024              $C$DW$167       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$169)
    2026                      .dwattr $C$DW$167, DW_AT_name("SECMSEL")
    2027                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_SECMSEL")
    2028                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2029                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2030              $C$DW$168       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$63)
    2032                      .dwattr $C$DW$168, DW_AT_name("LPMCR")
    2033                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_LPMCR")
    2034                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   40

    2035                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2036              $C$DW$169       .dwtag  DW_TAG_member
    2037                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$57)
    2038                      .dwattr $C$DW$169, DW_AT_name("GPIOLPMSEL0")
    2039                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2040                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2041                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$170       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$59)
    2044                      .dwattr $C$DW$170, DW_AT_name("GPIOLPMSEL1")
    2045                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    2046                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2047                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$171       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$171)
    2050                      .dwattr $C$DW$171, DW_AT_name("TMR2CLKCTL")
    2051                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    2052                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2053                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2054              $C$DW$172       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$27)
    2056                      .dwattr $C$DW$172, DW_AT_name("rsvd5")
    2057                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd5")
    2058                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2059                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2060              $C$DW$173       .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$167)
    2062                      .dwattr $C$DW$173, DW_AT_name("RESC")
    2063                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_RESC")
    2064                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2065                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2066                      .dwendtag $C$DW$T$29
    2067              
    2068              $C$DW$174       .dwtag  DW_TAG_TI_far_type
    2069                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$29)
    2070              $C$DW$T$216     .dwtag  DW_TAG_volatile_type
    2071                      .dwattr $C$DW$T$216, DW_AT_type(*$C$DW$174)
    2072              
    2073              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2074                      .dwattr $C$DW$T$31, DW_AT_name("DCSM_REGS_Z1")
    2075                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x24)
    2076              $C$DW$175       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$189)
    2078                      .dwattr $C$DW$175, DW_AT_name("Z1_LINKPOINTER")
    2079                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_Z1_LINKPOINTER")
    2080                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$176       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$191)
    2084                      .dwattr $C$DW$176, DW_AT_name("Z1_OTPSECLOCK")
    2085                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Z1_OTPSECLOCK")
    2086                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2087                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2088              $C$DW$177       .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$173)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   41

    2090                      .dwattr $C$DW$177, DW_AT_name("Z1_BOOTCTRL")
    2091                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Z1_BOOTCTRL")
    2092                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2093                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$178       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    2096                      .dwattr $C$DW$178, DW_AT_name("Z1_LINKPOINTERERR")
    2097                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_Z1_LINKPOINTERERR")
    2098                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2099                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$179       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$30)
    2102                      .dwattr $C$DW$179, DW_AT_name("rsvd1")
    2103                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd1")
    2104                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2105                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2106              $C$DW$180       .dwtag  DW_TAG_member
    2107                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    2108                      .dwattr $C$DW$180, DW_AT_name("Z1_CSMKEY0")
    2109                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_Z1_CSMKEY0")
    2110                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2111                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2112              $C$DW$181       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    2114                      .dwattr $C$DW$181, DW_AT_name("Z1_CSMKEY1")
    2115                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_Z1_CSMKEY1")
    2116                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2117                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2118              $C$DW$182       .dwtag  DW_TAG_member
    2119                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    2120                      .dwattr $C$DW$182, DW_AT_name("Z1_CSMKEY2")
    2121                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_Z1_CSMKEY2")
    2122                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2123                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2124              $C$DW$183       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    2126                      .dwattr $C$DW$183, DW_AT_name("Z1_CSMKEY3")
    2127                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_Z1_CSMKEY3")
    2128                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2129                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2130              $C$DW$184       .dwtag  DW_TAG_member
    2131                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$177)
    2132                      .dwattr $C$DW$184, DW_AT_name("Z1_CSMLOCKSR")
    2133                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_Z1_CSMLOCKSR")
    2134                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2135                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$185       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$175)
    2138                      .dwattr $C$DW$185, DW_AT_name("Z1_CR")
    2139                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_Z1_CR")
    2140                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2141                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2142              $C$DW$186       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$187)
    2144                      .dwattr $C$DW$186, DW_AT_name("Z1_GRABSECTR")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   42

    2145                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_Z1_GRABSECTR")
    2146                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2147                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2148              $C$DW$187       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$185)
    2150                      .dwattr $C$DW$187, DW_AT_name("Z1_GRABRAMR")
    2151                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_Z1_GRABRAMR")
    2152                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2153                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$188       .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$183)
    2156                      .dwattr $C$DW$188, DW_AT_name("Z1_EXEONLYSECTR")
    2157                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_Z1_EXEONLYSECTR")
    2158                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2159                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$189       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$181)
    2162                      .dwattr $C$DW$189, DW_AT_name("Z1_EXEONLYRAMR")
    2163                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_Z1_EXEONLYRAMR")
    2164                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2165                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$190       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$179)
    2168                      .dwattr $C$DW$190, DW_AT_name("Z1_EXEONLYDIS")
    2169                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_Z1_EXEONLYDIS")
    2170                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2171                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2172                      .dwendtag $C$DW$T$31
    2173              
    2174              $C$DW$191       .dwtag  DW_TAG_TI_far_type
    2175                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$31)
    2176              $C$DW$T$217     .dwtag  DW_TAG_volatile_type
    2177                      .dwattr $C$DW$T$217, DW_AT_type(*$C$DW$191)
    2178              
    2179              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2180                      .dwattr $C$DW$T$32, DW_AT_name("DCSM_REGS_Z2")
    2181                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x24)
    2182              $C$DW$192       .dwtag  DW_TAG_member
    2183                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$209)
    2184                      .dwattr $C$DW$192, DW_AT_name("Z2_LINKPOINTER")
    2185                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_Z2_LINKPOINTER")
    2186                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2187                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2188              $C$DW$193       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$211)
    2190                      .dwattr $C$DW$193, DW_AT_name("Z2_OTPSECLOCK")
    2191                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_Z2_OTPSECLOCK")
    2192                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2193                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$194       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$193)
    2196                      .dwattr $C$DW$194, DW_AT_name("Z2_BOOTCTRL")
    2197                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_Z2_BOOTCTRL")
    2198                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2199                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   43

    2200              $C$DW$195       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    2202                      .dwattr $C$DW$195, DW_AT_name("Z2_LINKPOINTERERR")
    2203                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_Z2_LINKPOINTERERR")
    2204                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2205                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$196       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$30)
    2208                      .dwattr $C$DW$196, DW_AT_name("rsvd1")
    2209                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd1")
    2210                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2211                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2212              $C$DW$197       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    2214                      .dwattr $C$DW$197, DW_AT_name("Z2_CSMKEY0")
    2215                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_Z2_CSMKEY0")
    2216                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2217                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2218              $C$DW$198       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    2220                      .dwattr $C$DW$198, DW_AT_name("Z2_CSMKEY1")
    2221                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Z2_CSMKEY1")
    2222                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2223                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2224              $C$DW$199       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    2226                      .dwattr $C$DW$199, DW_AT_name("Z2_CSMKEY2")
    2227                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Z2_CSMKEY2")
    2228                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2229                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2230              $C$DW$200       .dwtag  DW_TAG_member
    2231                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    2232                      .dwattr $C$DW$200, DW_AT_name("Z2_CSMKEY3")
    2233                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Z2_CSMKEY3")
    2234                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2235                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$201       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$197)
    2238                      .dwattr $C$DW$201, DW_AT_name("Z2_CSMLOCKSR")
    2239                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_Z2_CSMLOCKSR")
    2240                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2241                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2242              $C$DW$202       .dwtag  DW_TAG_member
    2243                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$195)
    2244                      .dwattr $C$DW$202, DW_AT_name("Z2_CR")
    2245                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_Z2_CR")
    2246                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2247                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2248              $C$DW$203       .dwtag  DW_TAG_member
    2249                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$207)
    2250                      .dwattr $C$DW$203, DW_AT_name("Z2_GRABSECTR")
    2251                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_Z2_GRABSECTR")
    2252                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2253                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2254              $C$DW$204       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   44

    2255                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$205)
    2256                      .dwattr $C$DW$204, DW_AT_name("Z2_GRABRAMR")
    2257                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_Z2_GRABRAMR")
    2258                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2259                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2260              $C$DW$205       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$203)
    2262                      .dwattr $C$DW$205, DW_AT_name("Z2_EXEONLYSECTR")
    2263                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_Z2_EXEONLYSECTR")
    2264                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2265                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2266              $C$DW$206       .dwtag  DW_TAG_member
    2267                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$201)
    2268                      .dwattr $C$DW$206, DW_AT_name("Z2_EXEONLYRAMR")
    2269                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_Z2_EXEONLYRAMR")
    2270                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2271                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$207       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$199)
    2274                      .dwattr $C$DW$207, DW_AT_name("Z2_EXEONLYDIS")
    2275                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_Z2_EXEONLYDIS")
    2276                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2277                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2278                      .dwendtag $C$DW$T$32
    2279              
    2280              $C$DW$208       .dwtag  DW_TAG_TI_far_type
    2281                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$32)
    2282              $C$DW$T$218     .dwtag  DW_TAG_volatile_type
    2283                      .dwattr $C$DW$T$218, DW_AT_type(*$C$DW$208)
    2284              
    2285              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2286                      .dwattr $C$DW$T$33, DW_AT_name("FBAC_BITS")
    2287                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2288              $C$DW$209       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2290                      .dwattr $C$DW$209, DW_AT_name("VREADST")
    2291                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_VREADST")
    2292                      .dwattr $C$DW$209, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2293                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$210       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$210, DW_AT_name("BAGP")
    2298                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_BAGP")
    2299                      .dwattr $C$DW$210, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2300                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2302              $C$DW$211       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2304                      .dwattr $C$DW$211, DW_AT_name("rsvd1")
    2305                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd1")
    2306                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2307                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2308                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2309                      .dwendtag $C$DW$T$33
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   45

    2310              
    2311              
    2312              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2313                      .dwattr $C$DW$T$34, DW_AT_name("FBAC_REG")
    2314                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2315              $C$DW$212       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$21)
    2317                      .dwattr $C$DW$212, DW_AT_name("all")
    2318                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_all")
    2319                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2321              $C$DW$213       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$33)
    2323                      .dwattr $C$DW$213, DW_AT_name("bit")
    2324                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_bit")
    2325                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2326                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2327                      .dwendtag $C$DW$T$34
    2328              
    2329              
    2330              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2331                      .dwattr $C$DW$T$35, DW_AT_name("FBFALLBACK_BITS")
    2332                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2333              $C$DW$214       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2335                      .dwattr $C$DW$214, DW_AT_name("BNKPWR0")
    2336                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_BNKPWR0")
    2337                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2338                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2339                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2340              $C$DW$215       .dwtag  DW_TAG_member
    2341                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2342                      .dwattr $C$DW$215, DW_AT_name("rsvd1")
    2343                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_rsvd1")
    2344                      .dwattr $C$DW$215, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2345                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2347              $C$DW$216       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2349                      .dwattr $C$DW$216, DW_AT_name("rsvd2")
    2350                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_rsvd2")
    2351                      .dwattr $C$DW$216, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2352                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2353                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2354                      .dwendtag $C$DW$T$35
    2355              
    2356              
    2357              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2358                      .dwattr $C$DW$T$36, DW_AT_name("FBFALLBACK_REG")
    2359                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2360              $C$DW$217       .dwtag  DW_TAG_member
    2361                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$21)
    2362                      .dwattr $C$DW$217, DW_AT_name("all")
    2363                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_all")
    2364                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   46

    2365                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2366              $C$DW$218       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$35)
    2368                      .dwattr $C$DW$218, DW_AT_name("bit")
    2369                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_bit")
    2370                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2372                      .dwendtag $C$DW$T$36
    2373              
    2374              
    2375              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2376                      .dwattr $C$DW$T$37, DW_AT_name("FBPRDY_BITS")
    2377                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2378              $C$DW$219       .dwtag  DW_TAG_member
    2379                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2380                      .dwattr $C$DW$219, DW_AT_name("BANKRDY")
    2381                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_BANKRDY")
    2382                      .dwattr $C$DW$219, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2383                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2384                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2385              $C$DW$220       .dwtag  DW_TAG_member
    2386                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2387                      .dwattr $C$DW$220, DW_AT_name("rsvd1")
    2388                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd1")
    2389                      .dwattr $C$DW$220, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    2390                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2391                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2392              $C$DW$221       .dwtag  DW_TAG_member
    2393                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2394                      .dwattr $C$DW$221, DW_AT_name("PUMPRDY")
    2395                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PUMPRDY")
    2396                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2397                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2398                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2399              $C$DW$222       .dwtag  DW_TAG_member
    2400                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2401                      .dwattr $C$DW$222, DW_AT_name("rsvd2")
    2402                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd2")
    2403                      .dwattr $C$DW$222, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2404                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2405                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2406                      .dwendtag $C$DW$T$37
    2407              
    2408              
    2409              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2410                      .dwattr $C$DW$T$38, DW_AT_name("FBPRDY_REG")
    2411                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2412              $C$DW$223       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$21)
    2414                      .dwattr $C$DW$223, DW_AT_name("all")
    2415                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_all")
    2416                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2418              $C$DW$224       .dwtag  DW_TAG_member
    2419                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   47

    2420                      .dwattr $C$DW$224, DW_AT_name("bit")
    2421                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_bit")
    2422                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2423                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2424                      .dwendtag $C$DW$T$38
    2425              
    2426              
    2427              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2428                      .dwattr $C$DW$T$41, DW_AT_name("FLASH_CTRL_REGS")
    2429                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x182)
    2430              $C$DW$225       .dwtag  DW_TAG_member
    2431                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$51)
    2432                      .dwattr $C$DW$225, DW_AT_name("FRDCNTL")
    2433                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_FRDCNTL")
    2434                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2435                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2436              $C$DW$226       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$55)
    2438                      .dwattr $C$DW$226, DW_AT_name("FSPRD")
    2439                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_FSPRD")
    2440                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2441                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$227       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$39)
    2444                      .dwattr $C$DW$227, DW_AT_name("rsvd1")
    2445                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd1")
    2446                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2447                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2448              $C$DW$228       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$34)
    2450                      .dwattr $C$DW$228, DW_AT_name("FBAC")
    2451                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_FBAC")
    2452                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2453                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$229       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$36)
    2456                      .dwattr $C$DW$229, DW_AT_name("FBFALLBACK")
    2457                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_FBFALLBACK")
    2458                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2459                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2460              $C$DW$230       .dwtag  DW_TAG_member
    2461                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$38)
    2462                      .dwattr $C$DW$230, DW_AT_name("FBPRDY")
    2463                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_FBPRDY")
    2464                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2465                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2466              $C$DW$231       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$47)
    2468                      .dwattr $C$DW$231, DW_AT_name("FPAC1")
    2469                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_FPAC1")
    2470                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2471                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2472              $C$DW$232       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$49)
    2474                      .dwattr $C$DW$232, DW_AT_name("FPAC2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   48

    2475                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_FPAC2")
    2476                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2477                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2478              $C$DW$233       .dwtag  DW_TAG_member
    2479                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$43)
    2480                      .dwattr $C$DW$233, DW_AT_name("FMAC")
    2481                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_FMAC")
    2482                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2483                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$234       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$45)
    2486                      .dwattr $C$DW$234, DW_AT_name("FMSTAT")
    2487                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_FMSTAT")
    2488                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2489                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2490              $C$DW$235       .dwtag  DW_TAG_member
    2491                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$40)
    2492                      .dwattr $C$DW$235, DW_AT_name("rsvd2")
    2493                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_rsvd2")
    2494                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2495                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$236       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$53)
    2498                      .dwattr $C$DW$236, DW_AT_name("FRD_INTF_CTRL")
    2499                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_FRD_INTF_CTRL")
    2500                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x180]
    2501                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2502                      .dwendtag $C$DW$T$41
    2503              
    2504              $C$DW$237       .dwtag  DW_TAG_TI_far_type
    2505                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$41)
    2506              $C$DW$T$219     .dwtag  DW_TAG_volatile_type
    2507                      .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$237)
    2508              
    2509              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2510                      .dwattr $C$DW$T$42, DW_AT_name("FMAC_BITS")
    2511                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2512              $C$DW$238       .dwtag  DW_TAG_member
    2513                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2514                      .dwattr $C$DW$238, DW_AT_name("BANK")
    2515                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_BANK")
    2516                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    2517                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2518                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2519              $C$DW$239       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2521                      .dwattr $C$DW$239, DW_AT_name("rsvd1")
    2522                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_rsvd1")
    2523                      .dwattr $C$DW$239, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2524                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2525                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2526              $C$DW$240       .dwtag  DW_TAG_member
    2527                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    2528                      .dwattr $C$DW$240, DW_AT_name("rsvd2")
    2529                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   49

    2530                      .dwattr $C$DW$240, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2531                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2532                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2533                      .dwendtag $C$DW$T$42
    2534              
    2535              
    2536              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2537                      .dwattr $C$DW$T$43, DW_AT_name("FMAC_REG")
    2538                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2539              $C$DW$241       .dwtag  DW_TAG_member
    2540                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
    2541                      .dwattr $C$DW$241, DW_AT_name("all")
    2542                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_all")
    2543                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2545              $C$DW$242       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$42)
    2547                      .dwattr $C$DW$242, DW_AT_name("bit")
    2548                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_bit")
    2549                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2551                      .dwendtag $C$DW$T$43
    2552              
    2553              
    2554              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2555                      .dwattr $C$DW$T$44, DW_AT_name("FMSTAT_BITS")
    2556                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2557              $C$DW$243       .dwtag  DW_TAG_member
    2558                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2559                      .dwattr $C$DW$243, DW_AT_name("rsvd1")
    2560                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_rsvd1")
    2561                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2562                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2563                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2564              $C$DW$244       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2566                      .dwattr $C$DW$244, DW_AT_name("PSUSP")
    2567                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PSUSP")
    2568                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2569                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2570                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2571              $C$DW$245       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2573                      .dwattr $C$DW$245, DW_AT_name("ESUSP")
    2574                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_ESUSP")
    2575                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2576                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2578              $C$DW$246       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2580                      .dwattr $C$DW$246, DW_AT_name("VOLTSTAT")
    2581                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_VOLTSTAT")
    2582                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2583                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2584                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   50

    2585              $C$DW$247       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2587                      .dwattr $C$DW$247, DW_AT_name("CSTAT")
    2588                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_CSTAT")
    2589                      .dwattr $C$DW$247, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2590                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2592              $C$DW$248       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2594                      .dwattr $C$DW$248, DW_AT_name("INVDAT")
    2595                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_INVDAT")
    2596                      .dwattr $C$DW$248, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2597                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2598                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2599              $C$DW$249       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2601                      .dwattr $C$DW$249, DW_AT_name("PGM")
    2602                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_PGM")
    2603                      .dwattr $C$DW$249, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2604                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2605                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2606              $C$DW$250       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2608                      .dwattr $C$DW$250, DW_AT_name("ERS")
    2609                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_ERS")
    2610                      .dwattr $C$DW$250, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2611                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2613              $C$DW$251       .dwtag  DW_TAG_member
    2614                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    2615                      .dwattr $C$DW$251, DW_AT_name("BUSY")
    2616                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_BUSY")
    2617                      .dwattr $C$DW$251, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2618                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2619                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$252       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    2622                      .dwattr $C$DW$252, DW_AT_name("CV")
    2623                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_CV")
    2624                      .dwattr $C$DW$252, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2625                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2626                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2627              $C$DW$253       .dwtag  DW_TAG_member
    2628                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2629                      .dwattr $C$DW$253, DW_AT_name("EV")
    2630                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_EV")
    2631                      .dwattr $C$DW$253, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2632                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2634              $C$DW$254       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    2636                      .dwattr $C$DW$254, DW_AT_name("PCV")
    2637                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_PCV")
    2638                      .dwattr $C$DW$254, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2639                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   51

    2640                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2641              $C$DW$255       .dwtag  DW_TAG_member
    2642                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    2643                      .dwattr $C$DW$255, DW_AT_name("PGV")
    2644                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_PGV")
    2645                      .dwattr $C$DW$255, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2646                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2647                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2648              $C$DW$256       .dwtag  DW_TAG_member
    2649                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    2650                      .dwattr $C$DW$256, DW_AT_name("DBF")
    2651                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_DBF")
    2652                      .dwattr $C$DW$256, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2653                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2654                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2655              $C$DW$257       .dwtag  DW_TAG_member
    2656                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    2657                      .dwattr $C$DW$257, DW_AT_name("ILA")
    2658                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_ILA")
    2659                      .dwattr $C$DW$257, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2660                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2661                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$258       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    2664                      .dwattr $C$DW$258, DW_AT_name("RVF")
    2665                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_RVF")
    2666                      .dwattr $C$DW$258, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2667                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2668                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2669              $C$DW$259       .dwtag  DW_TAG_member
    2670                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    2671                      .dwattr $C$DW$259, DW_AT_name("RDVER")
    2672                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_RDVER")
    2673                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2674                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2675                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2676              $C$DW$260       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    2678                      .dwattr $C$DW$260, DW_AT_name("RVSUP")
    2679                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_RVSUP")
    2680                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2681                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2682                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2683              $C$DW$261       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    2685                      .dwattr $C$DW$261, DW_AT_name("rsvd2")
    2686                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_rsvd2")
    2687                      .dwattr $C$DW$261, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2688                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2689                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2690                      .dwendtag $C$DW$T$44
    2691              
    2692              
    2693              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2694                      .dwattr $C$DW$T$45, DW_AT_name("FMSTAT_REG")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   52

    2695                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2696              $C$DW$262       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$21)
    2698                      .dwattr $C$DW$262, DW_AT_name("all")
    2699                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_all")
    2700                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$263       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$44)
    2704                      .dwattr $C$DW$263, DW_AT_name("bit")
    2705                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_bit")
    2706                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2707                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2708                      .dwendtag $C$DW$T$45
    2709              
    2710              
    2711              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2712                      .dwattr $C$DW$T$46, DW_AT_name("FPAC1_BITS")
    2713                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2714              $C$DW$264       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    2716                      .dwattr $C$DW$264, DW_AT_name("PMPPWR")
    2717                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_PMPPWR")
    2718                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2719                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2720                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2721              $C$DW$265       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    2723                      .dwattr $C$DW$265, DW_AT_name("rsvd1")
    2724                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_rsvd1")
    2725                      .dwattr $C$DW$265, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    2726                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2727                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2728              $C$DW$266       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    2730                      .dwattr $C$DW$266, DW_AT_name("PSLEEP")
    2731                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_PSLEEP")
    2732                      .dwattr $C$DW$266, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2733                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2734                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    2735              $C$DW$267       .dwtag  DW_TAG_member
    2736                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    2737                      .dwattr $C$DW$267, DW_AT_name("rsvd2")
    2738                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_rsvd2")
    2739                      .dwattr $C$DW$267, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2740                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2741                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    2742                      .dwendtag $C$DW$T$46
    2743              
    2744              
    2745              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2746                      .dwattr $C$DW$T$47, DW_AT_name("FPAC1_REG")
    2747                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2748              $C$DW$268       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:11 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0801210                         PAGE   53

    2750                      .dwattr $C$DW$268, DW_AT_name("all")
    2751                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_all")
    2752                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2753                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    2754              $C$DW$269       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$46)
    2756                      .dwattr $C$DW$269, DW_AT_name("bit")
    2757                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_bit")
    2758                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2759                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    2760                      .dwendtag $C$DW$T$47
    2761              
    2762              
    2763              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2764                      .dwattr $C$DW$T$48, DW_AT_name("FPAC2_BITS")
    2765                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2766              $C$DW$270       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    2768                      .dwattr $C$DW$270, DW_AT_name("PAGP")
    2769                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_PAGP")
    2770                      .dwattr $C$DW$270, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
