TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:28:12 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("c2brom_status")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_c2brom_status")

    1081              ;*                            0 Parameter,  4 Auto,  0 SOE     *
    1082              ;***************************************************************
    1083              
    1084 000000d7       _c2brom_c1c2_ipc_func_call_command:
    1085                      .dwcfi  cfa_offset, -2
    1086                      .dwcfi  save_reg_to_mem, 26, 0
    1087                      .dwcfi  save_reg_to_reg, 78, 26
    1088 000000d7 FE04          ADDB      SP,#4                 ; [CPU_U] 
    1089                      .dwcfi  cfa_offset, -6
    1090              $C$DW$46        .dwtag  DW_TAG_variable, DW_AT_name("param")
    1091                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_param")
    1092                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$21)
    1093                      .dwattr $C$DW$46, DW_AT_location[DW_OP_breg20 -2]
    1094              $C$DW$47        .dwtag  DW_TAG_variable, DW_AT_name("c1c2_func_call")
    1095                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_c1c2_func_call")
    1096                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$52)
    1097                      .dwattr $C$DW$47, DW_AT_location[DW_OP_breg20 -4]
    1098                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1099 000000d8 761F!         MOVW      DP,#_IpcRegs+20       ; [CPU_U] 
         000000d9 0000 
    1100 000000da 0614!         MOVL      ACC,@_IpcRegs+20      ; [CPU_] |269| 
    1101 000000db 1E42          MOVL      *-SP[2],ACC           ; [CPU_] |269| 
    1102                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1103 000000dc 0612!         MOVL      ACC,@_IpcRegs+18      ; [CPU_] |270| 
    1104 000000dd 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |270| 
    1105                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1106 000000de C544          MOVL      XAR7,*-SP[4]          ; [CPU_] |271| 
    1107 000000df 0642          MOVL      ACC,*-SP[2]           ; [CPU_] |271| 
    1108              $C$DW$48        .dwtag  DW_TAG_TI_branch
    1109                      .dwattr $C$DW$48, DW_AT_low_pc(0x00)
    1110                      .dwattr $C$DW$48, DW_AT_TI_call
    1111                      .dwattr $C$DW$48, DW_AT_TI_indirect
    1112 000000e0 3E67          LCR       *XAR7                 ; [CPU_] |271| 
    1113                      ; call occurs [XAR7] ; [] |271| 
    1114                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    1115 000000e1 FE84          SUBB      SP,#4                 ; [CPU_U] 
    1116                      .dwcfi  cfa_offset, -2
    1117              $C$DW$49        .dwtag  DW_TAG_TI_branch
    1118                      .dwattr $C$DW$49, DW_AT_low_pc(0x00)
    1119                      .dwattr $C$DW$49, DW_AT_TI_return
    1120 000000e2 0006          LRETR     ; [CPU_] 
    1121                      ; return occurs ; [] 
    1122                      .dwattr $C$DW$45, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
    1123                      .dwattr $C$DW$45, DW_AT_TI_end_line(0x110)
    1124                      .dwattr $C$DW$45, DW_AT_TI_end_column(0x01)
    1125                      .dwendentry
    1126                      .dwendtag $C$DW$45
    1127              
    1128              ;**************************************************************
    1129              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1130              ;**************************************************************
    1131                      .global _c2brom_status
    1132                      .global _IpcRegs
    1133              
    1134              ;***************************************************************
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   22

    1135              ;* TYPE INFORMATION                                            *
    1136              ;***************************************************************
    1137              
    1138              $C$DW$T$35      .dwtag  DW_TAG_enumeration_type
    1139                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1140              $C$DW$50        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
    1141              $C$DW$51        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
    1142              $C$DW$52        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
    1143              $C$DW$53        .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
    1144                      .dwendtag $C$DW$T$35
    1145              
    1146              $C$DW$T$36      .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
    1147                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    1148                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1149              
    1150              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1151                      .dwattr $C$DW$T$20, DW_AT_name("IPCACK_BITS")
    1152                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1153              $C$DW$54        .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$54, DW_AT_name("IPC0")
    1156                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_IPC0")
    1157                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1158                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1160              $C$DW$55        .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$55, DW_AT_name("IPC1")
    1163                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_IPC1")
    1164                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1165                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1167              $C$DW$56        .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1169                      .dwattr $C$DW$56, DW_AT_name("IPC2")
    1170                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_IPC2")
    1171                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1172                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1174              $C$DW$57        .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1176                      .dwattr $C$DW$57, DW_AT_name("IPC3")
    1177                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_IPC3")
    1178                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1181              $C$DW$58        .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$58, DW_AT_name("IPC4")
    1184                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_IPC4")
    1185                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$59        .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   23

    1190                      .dwattr $C$DW$59, DW_AT_name("IPC5")
    1191                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_IPC5")
    1192                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1193                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$60        .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$60, DW_AT_name("IPC6")
    1198                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_IPC6")
    1199                      .dwattr $C$DW$60, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1200                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1202              $C$DW$61        .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1204                      .dwattr $C$DW$61, DW_AT_name("IPC7")
    1205                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_IPC7")
    1206                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1207                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1209              $C$DW$62        .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1211                      .dwattr $C$DW$62, DW_AT_name("IPC8")
    1212                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_IPC8")
    1213                      .dwattr $C$DW$62, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$63        .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1218                      .dwattr $C$DW$63, DW_AT_name("IPC9")
    1219                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_IPC9")
    1220                      .dwattr $C$DW$63, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1221                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$64        .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$64, DW_AT_name("IPC10")
    1226                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_IPC10")
    1227                      .dwattr $C$DW$64, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1228                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1229                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1230              $C$DW$65        .dwtag  DW_TAG_member
    1231                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1232                      .dwattr $C$DW$65, DW_AT_name("IPC11")
    1233                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_IPC11")
    1234                      .dwattr $C$DW$65, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1235                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1236                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$66        .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$66, DW_AT_name("IPC12")
    1240                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_IPC12")
    1241                      .dwattr $C$DW$66, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1242                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1243                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1244              $C$DW$67        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   24

    1245                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1246                      .dwattr $C$DW$67, DW_AT_name("IPC13")
    1247                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_IPC13")
    1248                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1249                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1251              $C$DW$68        .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$68, DW_AT_name("IPC14")
    1254                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_IPC14")
    1255                      .dwattr $C$DW$68, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1256                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1258              $C$DW$69        .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$69, DW_AT_name("IPC15")
    1261                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_IPC15")
    1262                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$70        .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$70, DW_AT_name("IPC16")
    1268                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_IPC16")
    1269                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1270                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1271                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1272              $C$DW$71        .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$71, DW_AT_name("IPC17")
    1275                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_IPC17")
    1276                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1277                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1278                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$72        .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$72, DW_AT_name("IPC18")
    1282                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_IPC18")
    1283                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1284                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1285                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$73        .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$73, DW_AT_name("IPC19")
    1289                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_IPC19")
    1290                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1291                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1292                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1293              $C$DW$74        .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$74, DW_AT_name("IPC20")
    1296                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_IPC20")
    1297                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1298                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1299                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   25

    1300              $C$DW$75        .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1302                      .dwattr $C$DW$75, DW_AT_name("IPC21")
    1303                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_IPC21")
    1304                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1305                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1306                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$76        .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1309                      .dwattr $C$DW$76, DW_AT_name("IPC22")
    1310                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_IPC22")
    1311                      .dwattr $C$DW$76, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1312                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1313                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1314              $C$DW$77        .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$77, DW_AT_name("IPC23")
    1317                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_IPC23")
    1318                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1319                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1320                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$78        .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$78, DW_AT_name("IPC24")
    1324                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_IPC24")
    1325                      .dwattr $C$DW$78, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1326                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1327                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1328              $C$DW$79        .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$79, DW_AT_name("IPC25")
    1331                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_IPC25")
    1332                      .dwattr $C$DW$79, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1333                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1334                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1335              $C$DW$80        .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$80, DW_AT_name("IPC26")
    1338                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_IPC26")
    1339                      .dwattr $C$DW$80, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1340                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1341                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$81        .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$81, DW_AT_name("IPC27")
    1345                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_IPC27")
    1346                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1348                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1349              $C$DW$82        .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$82, DW_AT_name("IPC28")
    1352                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_IPC28")
    1353                      .dwattr $C$DW$82, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1354                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   26

    1355                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$83        .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$83, DW_AT_name("IPC29")
    1359                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_IPC29")
    1360                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1361                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1362                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1363              $C$DW$84        .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$84, DW_AT_name("IPC30")
    1366                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_IPC30")
    1367                      .dwattr $C$DW$84, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1368                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1369                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$85        .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$85, DW_AT_name("IPC31")
    1373                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_IPC31")
    1374                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1375                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1376                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1377                      .dwendtag $C$DW$T$20
    1378              
    1379              
    1380              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1381                      .dwattr $C$DW$T$22, DW_AT_name("IPCACK_REG")
    1382                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1383              $C$DW$86        .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1385                      .dwattr $C$DW$86, DW_AT_name("all")
    1386                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1387                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1389              $C$DW$87        .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
    1391                      .dwattr $C$DW$87, DW_AT_name("bit")
    1392                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1393                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1395                      .dwendtag $C$DW$T$22
    1396              
    1397              
    1398              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1399                      .dwattr $C$DW$T$23, DW_AT_name("IPCCLR_BITS")
    1400                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1401              $C$DW$88        .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1403                      .dwattr $C$DW$88, DW_AT_name("IPC0")
    1404                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_IPC0")
    1405                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1406                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1408              $C$DW$89        .dwtag  DW_TAG_member
    1409                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   27

    1410                      .dwattr $C$DW$89, DW_AT_name("IPC1")
    1411                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_IPC1")
    1412                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1413                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1414                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1415              $C$DW$90        .dwtag  DW_TAG_member
    1416                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1417                      .dwattr $C$DW$90, DW_AT_name("IPC2")
    1418                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_IPC2")
    1419                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1420                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1422              $C$DW$91        .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1424                      .dwattr $C$DW$91, DW_AT_name("IPC3")
    1425                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_IPC3")
    1426                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1427                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1428                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1429              $C$DW$92        .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1431                      .dwattr $C$DW$92, DW_AT_name("IPC4")
    1432                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_IPC4")
    1433                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1434                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$93        .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1438                      .dwattr $C$DW$93, DW_AT_name("IPC5")
    1439                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_IPC5")
    1440                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1441                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1442                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1443              $C$DW$94        .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1445                      .dwattr $C$DW$94, DW_AT_name("IPC6")
    1446                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_IPC6")
    1447                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1448                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1449                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1450              $C$DW$95        .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1452                      .dwattr $C$DW$95, DW_AT_name("IPC7")
    1453                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_IPC7")
    1454                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1455                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1456                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1457              $C$DW$96        .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$96, DW_AT_name("IPC8")
    1460                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_IPC8")
    1461                      .dwattr $C$DW$96, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1462                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1464              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   28

    1465                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$97, DW_AT_name("IPC9")
    1467                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_IPC9")
    1468                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1469                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1470                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1471              $C$DW$98        .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1473                      .dwattr $C$DW$98, DW_AT_name("IPC10")
    1474                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_IPC10")
    1475                      .dwattr $C$DW$98, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1476                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$99        .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1480                      .dwattr $C$DW$99, DW_AT_name("IPC11")
    1481                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_IPC11")
    1482                      .dwattr $C$DW$99, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1483                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$100       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1487                      .dwattr $C$DW$100, DW_AT_name("IPC12")
    1488                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_IPC12")
    1489                      .dwattr $C$DW$100, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1490                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1491                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1492              $C$DW$101       .dwtag  DW_TAG_member
    1493                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1494                      .dwattr $C$DW$101, DW_AT_name("IPC13")
    1495                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_IPC13")
    1496                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1497                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1498                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1499              $C$DW$102       .dwtag  DW_TAG_member
    1500                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1501                      .dwattr $C$DW$102, DW_AT_name("IPC14")
    1502                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_IPC14")
    1503                      .dwattr $C$DW$102, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1504                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1506              $C$DW$103       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$103, DW_AT_name("IPC15")
    1509                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_IPC15")
    1510                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1511                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1513              $C$DW$104       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1515                      .dwattr $C$DW$104, DW_AT_name("IPC16")
    1516                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_IPC16")
    1517                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1518                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1519                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   29

    1520              $C$DW$105       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$105, DW_AT_name("IPC17")
    1523                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_IPC17")
    1524                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1525                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1526                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$106       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1529                      .dwattr $C$DW$106, DW_AT_name("IPC18")
    1530                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_IPC18")
    1531                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1532                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1533                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1534              $C$DW$107       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1536                      .dwattr $C$DW$107, DW_AT_name("IPC19")
    1537                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_IPC19")
    1538                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1539                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1540                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$108       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$108, DW_AT_name("IPC20")
    1544                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_IPC20")
    1545                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1546                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1547                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1548              $C$DW$109       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$109, DW_AT_name("IPC21")
    1551                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_IPC21")
    1552                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1553                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1554                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1555              $C$DW$110       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$110, DW_AT_name("IPC22")
    1558                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_IPC22")
    1559                      .dwattr $C$DW$110, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1560                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1561                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$111       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$111, DW_AT_name("IPC23")
    1565                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_IPC23")
    1566                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1567                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1568                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1569              $C$DW$112       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$112, DW_AT_name("IPC24")
    1572                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_IPC24")
    1573                      .dwattr $C$DW$112, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1574                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   30

    1575                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$113       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1578                      .dwattr $C$DW$113, DW_AT_name("IPC25")
    1579                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_IPC25")
    1580                      .dwattr $C$DW$113, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1581                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1582                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$114       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$114, DW_AT_name("IPC26")
    1586                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_IPC26")
    1587                      .dwattr $C$DW$114, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1589                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1590              $C$DW$115       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$115, DW_AT_name("IPC27")
    1593                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_IPC27")
    1594                      .dwattr $C$DW$115, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1595                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1596                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1597              $C$DW$116       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$116, DW_AT_name("IPC28")
    1600                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_IPC28")
    1601                      .dwattr $C$DW$116, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1602                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1603                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$117       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$117, DW_AT_name("IPC29")
    1607                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IPC29")
    1608                      .dwattr $C$DW$117, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1609                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1610                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$118       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$118, DW_AT_name("IPC30")
    1614                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IPC30")
    1615                      .dwattr $C$DW$118, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1616                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1617                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1618              $C$DW$119       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$119, DW_AT_name("IPC31")
    1621                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_IPC31")
    1622                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1623                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1624                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1625                      .dwendtag $C$DW$T$23
    1626              
    1627              
    1628              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1629                      .dwattr $C$DW$T$24, DW_AT_name("IPCCLR_REG")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   31

    1630                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1631              $C$DW$120       .dwtag  DW_TAG_member
    1632                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    1633                      .dwattr $C$DW$120, DW_AT_name("all")
    1634                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    1635                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$121       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$23)
    1639                      .dwattr $C$DW$121, DW_AT_name("bit")
    1640                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    1641                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1643                      .dwendtag $C$DW$T$24
    1644              
    1645              
    1646              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1647                      .dwattr $C$DW$T$25, DW_AT_name("IPCFLG_BITS")
    1648                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1649              $C$DW$122       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1651                      .dwattr $C$DW$122, DW_AT_name("IPC0")
    1652                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_IPC0")
    1653                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1654                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1656              $C$DW$123       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1658                      .dwattr $C$DW$123, DW_AT_name("IPC1")
    1659                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_IPC1")
    1660                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1661                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$124       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$124, DW_AT_name("IPC2")
    1666                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_IPC2")
    1667                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1668                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1670              $C$DW$125       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1672                      .dwattr $C$DW$125, DW_AT_name("IPC3")
    1673                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_IPC3")
    1674                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1675                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$126       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$126, DW_AT_name("IPC4")
    1680                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IPC4")
    1681                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$127       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   32

    1685                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1686                      .dwattr $C$DW$127, DW_AT_name("IPC5")
    1687                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IPC5")
    1688                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1689                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1691              $C$DW$128       .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1693                      .dwattr $C$DW$128, DW_AT_name("IPC6")
    1694                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_IPC6")
    1695                      .dwattr $C$DW$128, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1698              $C$DW$129       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$129, DW_AT_name("IPC7")
    1701                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IPC7")
    1702                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1703                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$130       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$130, DW_AT_name("IPC8")
    1708                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IPC8")
    1709                      .dwattr $C$DW$130, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1710                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1711                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1712              $C$DW$131       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$131, DW_AT_name("IPC9")
    1715                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_IPC9")
    1716                      .dwattr $C$DW$131, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1717                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1718                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1719              $C$DW$132       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$132, DW_AT_name("IPC10")
    1722                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_IPC10")
    1723                      .dwattr $C$DW$132, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1724                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1726              $C$DW$133       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1728                      .dwattr $C$DW$133, DW_AT_name("IPC11")
    1729                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IPC11")
    1730                      .dwattr $C$DW$133, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1733              $C$DW$134       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$134, DW_AT_name("IPC12")
    1736                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IPC12")
    1737                      .dwattr $C$DW$134, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1738                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1739                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   33

    1740              $C$DW$135       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$135, DW_AT_name("IPC13")
    1743                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_IPC13")
    1744                      .dwattr $C$DW$135, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1745                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$136       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1749                      .dwattr $C$DW$136, DW_AT_name("IPC14")
    1750                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_IPC14")
    1751                      .dwattr $C$DW$136, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1752                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1754              $C$DW$137       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1756                      .dwattr $C$DW$137, DW_AT_name("IPC15")
    1757                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_IPC15")
    1758                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1759                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1761              $C$DW$138       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$138, DW_AT_name("IPC16")
    1764                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_IPC16")
    1765                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1766                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1767                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1768              $C$DW$139       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$139, DW_AT_name("IPC17")
    1771                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_IPC17")
    1772                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1773                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1774                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$140       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$140, DW_AT_name("IPC18")
    1778                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_IPC18")
    1779                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1780                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1781                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1782              $C$DW$141       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1784                      .dwattr $C$DW$141, DW_AT_name("IPC19")
    1785                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_IPC19")
    1786                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1787                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1788                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$142       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1791                      .dwattr $C$DW$142, DW_AT_name("IPC20")
    1792                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IPC20")
    1793                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1794                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   34

    1795                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1796              $C$DW$143       .dwtag  DW_TAG_member
    1797                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1798                      .dwattr $C$DW$143, DW_AT_name("IPC21")
    1799                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_IPC21")
    1800                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1801                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1802                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1803              $C$DW$144       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1805                      .dwattr $C$DW$144, DW_AT_name("IPC22")
    1806                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_IPC22")
    1807                      .dwattr $C$DW$144, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1808                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1809                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1810              $C$DW$145       .dwtag  DW_TAG_member
    1811                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1812                      .dwattr $C$DW$145, DW_AT_name("IPC23")
    1813                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_IPC23")
    1814                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1815                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1816                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1817              $C$DW$146       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1819                      .dwattr $C$DW$146, DW_AT_name("IPC24")
    1820                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_IPC24")
    1821                      .dwattr $C$DW$146, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1822                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1823                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1824              $C$DW$147       .dwtag  DW_TAG_member
    1825                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1826                      .dwattr $C$DW$147, DW_AT_name("IPC25")
    1827                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_IPC25")
    1828                      .dwattr $C$DW$147, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1829                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1830                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$148       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1833                      .dwattr $C$DW$148, DW_AT_name("IPC26")
    1834                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_IPC26")
    1835                      .dwattr $C$DW$148, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1836                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1837                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1838              $C$DW$149       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1840                      .dwattr $C$DW$149, DW_AT_name("IPC27")
    1841                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_IPC27")
    1842                      .dwattr $C$DW$149, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1843                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1844                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$150       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1847                      .dwattr $C$DW$150, DW_AT_name("IPC28")
    1848                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_IPC28")
    1849                      .dwattr $C$DW$150, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   35

    1850                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1851                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1852              $C$DW$151       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1854                      .dwattr $C$DW$151, DW_AT_name("IPC29")
    1855                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_IPC29")
    1856                      .dwattr $C$DW$151, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1857                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1858                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1859              $C$DW$152       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1861                      .dwattr $C$DW$152, DW_AT_name("IPC30")
    1862                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_IPC30")
    1863                      .dwattr $C$DW$152, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1864                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1865                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1866              $C$DW$153       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1868                      .dwattr $C$DW$153, DW_AT_name("IPC31")
    1869                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_IPC31")
    1870                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1871                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1872                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1873                      .dwendtag $C$DW$T$25
    1874              
    1875              
    1876              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1877                      .dwattr $C$DW$T$26, DW_AT_name("IPCFLG_REG")
    1878                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1879              $C$DW$154       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    1881                      .dwattr $C$DW$154, DW_AT_name("all")
    1882                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_all")
    1883                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1884                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$155       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$25)
    1887                      .dwattr $C$DW$155, DW_AT_name("bit")
    1888                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_bit")
    1889                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1891                      .dwendtag $C$DW$T$26
    1892              
    1893              
    1894              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1895                      .dwattr $C$DW$T$27, DW_AT_name("IPCSET_BITS")
    1896                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1897              $C$DW$156       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1899                      .dwattr $C$DW$156, DW_AT_name("IPC0")
    1900                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_IPC0")
    1901                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1902                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1904              $C$DW$157       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   36

    1905                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1906                      .dwattr $C$DW$157, DW_AT_name("IPC1")
    1907                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_IPC1")
    1908                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1909                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1910                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1911              $C$DW$158       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1913                      .dwattr $C$DW$158, DW_AT_name("IPC2")
    1914                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_IPC2")
    1915                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1916                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1918              $C$DW$159       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$159, DW_AT_name("IPC3")
    1921                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_IPC3")
    1922                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1923                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1924                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1925              $C$DW$160       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1927                      .dwattr $C$DW$160, DW_AT_name("IPC4")
    1928                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_IPC4")
    1929                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1930                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1931                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$161       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1934                      .dwattr $C$DW$161, DW_AT_name("IPC5")
    1935                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IPC5")
    1936                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1937                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$162       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1941                      .dwattr $C$DW$162, DW_AT_name("IPC6")
    1942                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_IPC6")
    1943                      .dwattr $C$DW$162, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1944                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1946              $C$DW$163       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$163, DW_AT_name("IPC7")
    1949                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_IPC7")
    1950                      .dwattr $C$DW$163, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1951                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$164       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$164, DW_AT_name("IPC8")
    1956                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_IPC8")
    1957                      .dwattr $C$DW$164, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1958                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   37

    1960              $C$DW$165       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1962                      .dwattr $C$DW$165, DW_AT_name("IPC9")
    1963                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_IPC9")
    1964                      .dwattr $C$DW$165, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1965                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1967              $C$DW$166       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$166, DW_AT_name("IPC10")
    1970                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_IPC10")
    1971                      .dwattr $C$DW$166, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1972                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$167       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$167, DW_AT_name("IPC11")
    1977                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_IPC11")
    1978                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1979                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1980                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$168       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1983                      .dwattr $C$DW$168, DW_AT_name("IPC12")
    1984                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_IPC12")
    1985                      .dwattr $C$DW$168, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1986                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1987                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$169       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1990                      .dwattr $C$DW$169, DW_AT_name("IPC13")
    1991                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_IPC13")
    1992                      .dwattr $C$DW$169, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1993                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1994                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1995              $C$DW$170       .dwtag  DW_TAG_member
    1996                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1997                      .dwattr $C$DW$170, DW_AT_name("IPC14")
    1998                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_IPC14")
    1999                      .dwattr $C$DW$170, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2000                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2001                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2002              $C$DW$171       .dwtag  DW_TAG_member
    2003                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2004                      .dwattr $C$DW$171, DW_AT_name("IPC15")
    2005                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_IPC15")
    2006                      .dwattr $C$DW$171, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2007                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2008                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2009              $C$DW$172       .dwtag  DW_TAG_member
    2010                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2011                      .dwattr $C$DW$172, DW_AT_name("IPC16")
    2012                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_IPC16")
    2013                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2014                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   38

    2015                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2016              $C$DW$173       .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2018                      .dwattr $C$DW$173, DW_AT_name("IPC17")
    2019                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_IPC17")
    2020                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2021                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2022                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$174       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2025                      .dwattr $C$DW$174, DW_AT_name("IPC18")
    2026                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_IPC18")
    2027                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2028                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2029                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2030              $C$DW$175       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$175, DW_AT_name("IPC19")
    2033                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_IPC19")
    2034                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2035                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2036                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$176       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2039                      .dwattr $C$DW$176, DW_AT_name("IPC20")
    2040                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_IPC20")
    2041                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2042                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2043                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2044              $C$DW$177       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2046                      .dwattr $C$DW$177, DW_AT_name("IPC21")
    2047                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_IPC21")
    2048                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2049                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2050                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2051              $C$DW$178       .dwtag  DW_TAG_member
    2052                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2053                      .dwattr $C$DW$178, DW_AT_name("IPC22")
    2054                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_IPC22")
    2055                      .dwattr $C$DW$178, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2056                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2057                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2058              $C$DW$179       .dwtag  DW_TAG_member
    2059                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2060                      .dwattr $C$DW$179, DW_AT_name("IPC23")
    2061                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_IPC23")
    2062                      .dwattr $C$DW$179, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2063                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2064                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2065              $C$DW$180       .dwtag  DW_TAG_member
    2066                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2067                      .dwattr $C$DW$180, DW_AT_name("IPC24")
    2068                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_IPC24")
    2069                      .dwattr $C$DW$180, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   39

    2070                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2071                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2072              $C$DW$181       .dwtag  DW_TAG_member
    2073                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2074                      .dwattr $C$DW$181, DW_AT_name("IPC25")
    2075                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_IPC25")
    2076                      .dwattr $C$DW$181, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2077                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2078                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2079              $C$DW$182       .dwtag  DW_TAG_member
    2080                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2081                      .dwattr $C$DW$182, DW_AT_name("IPC26")
    2082                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_IPC26")
    2083                      .dwattr $C$DW$182, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2084                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2085                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2086              $C$DW$183       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2088                      .dwattr $C$DW$183, DW_AT_name("IPC27")
    2089                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_IPC27")
    2090                      .dwattr $C$DW$183, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2091                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2092                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2093              $C$DW$184       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$184, DW_AT_name("IPC28")
    2096                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_IPC28")
    2097                      .dwattr $C$DW$184, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2098                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2099                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$185       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2102                      .dwattr $C$DW$185, DW_AT_name("IPC29")
    2103                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_IPC29")
    2104                      .dwattr $C$DW$185, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2105                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2106                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2107              $C$DW$186       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$186, DW_AT_name("IPC30")
    2110                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_IPC30")
    2111                      .dwattr $C$DW$186, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2112                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2113                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$187       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2116                      .dwattr $C$DW$187, DW_AT_name("IPC31")
    2117                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_IPC31")
    2118                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2119                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2120                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2121                      .dwendtag $C$DW$T$27
    2122              
    2123              
    2124              $C$DW$T$28      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   40

    2125                      .dwattr $C$DW$T$28, DW_AT_name("IPCSET_REG")
    2126                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2127              $C$DW$188       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    2129                      .dwattr $C$DW$188, DW_AT_name("all")
    2130                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    2131                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$189       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$27)
    2135                      .dwattr $C$DW$189, DW_AT_name("bit")
    2136                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    2137                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2139                      .dwendtag $C$DW$T$28
    2140              
    2141              
    2142              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2143                      .dwattr $C$DW$T$29, DW_AT_name("IPCSTS_BITS")
    2144                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2145              $C$DW$190       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2147                      .dwattr $C$DW$190, DW_AT_name("IPC0")
    2148                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_IPC0")
    2149                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2150                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$191       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$191, DW_AT_name("IPC1")
    2155                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_IPC1")
    2156                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2157                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2158                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2159              $C$DW$192       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2161                      .dwattr $C$DW$192, DW_AT_name("IPC2")
    2162                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_IPC2")
    2163                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2164                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2165                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$193       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$193, DW_AT_name("IPC3")
    2169                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_IPC3")
    2170                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2171                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$194       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$194, DW_AT_name("IPC4")
    2176                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_IPC4")
    2177                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2178                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2179                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   41

    2180              $C$DW$195       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2182                      .dwattr $C$DW$195, DW_AT_name("IPC5")
    2183                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_IPC5")
    2184                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2185                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$196       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$196, DW_AT_name("IPC6")
    2190                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_IPC6")
    2191                      .dwattr $C$DW$196, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2192                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2193                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$197       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$197, DW_AT_name("IPC7")
    2197                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_IPC7")
    2198                      .dwattr $C$DW$197, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2199                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2201              $C$DW$198       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2203                      .dwattr $C$DW$198, DW_AT_name("IPC8")
    2204                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_IPC8")
    2205                      .dwattr $C$DW$198, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$199       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2210                      .dwattr $C$DW$199, DW_AT_name("IPC9")
    2211                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_IPC9")
    2212                      .dwattr $C$DW$199, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2213                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2214                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2215              $C$DW$200       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$200, DW_AT_name("IPC10")
    2218                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_IPC10")
    2219                      .dwattr $C$DW$200, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2220                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2222              $C$DW$201       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$201, DW_AT_name("IPC11")
    2225                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_IPC11")
    2226                      .dwattr $C$DW$201, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2227                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$202       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$202, DW_AT_name("IPC12")
    2232                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_IPC12")
    2233                      .dwattr $C$DW$202, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2234                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:12 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0716010                         PAGE   42

    2235                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$203       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$203, DW_AT_name("IPC13")
    2239                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_IPC13")
    2240                      .dwattr $C$DW$203, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2243              $C$DW$204       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2245                      .dwattr $C$DW$204, DW_AT_name("IPC14")
    2246                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_IPC14")
    2247                      .dwattr $C$DW$204, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2248                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$205       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2252                      .dwattr $C$DW$205, DW_AT_name("IPC15")
    2253                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_IPC15")
    2254                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2255                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2257              $C$DW$206       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2259                      .dwattr $C$DW$206, DW_AT_name("IPC16")
    2260                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_IPC16")
    2261                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2262                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2263                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2264              $C$DW$207       .dwtag  DW_TAG_member
    2265                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2266                      .dwattr $C$DW$207, DW_AT_name("IPC17")
    2267                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_IPC17")
    2268                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2269                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2270                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$208       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$208, DW_AT_name("IPC18")
    2274                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_IPC18")
    2275                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2276                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2277                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2278              $C$DW$209       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2280                      .dwattr $C$DW$209, DW_AT_name("IPC19")
    2281                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_IPC19")
    2282                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2283                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
