TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:28:07 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

     510 0000007c 1E30!         MOVL      @_DcanaRegs+304,ACC   ; [CPU_] |231| 
     511                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     512 0000007d 9A02          MOV       AL,#2                 ; [CPU_] |232| 
     513 0000007e 9B87          MOV       AH,#135               ; [CPU_] |232| 
     514 0000007f 1E20!         MOVL      @_DcanaRegs+288,ACC   ; [CPU_] |232| 
     515                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     516 00000080       $C$L9:    
     517 00000080       $C$DW$L$_DCAN_SendWordData$2$B:
     518 00000080 4F20!         TBIT      @_DcanaRegs+288,#15   ; [CPU_] |233| 
     519 00000081 EEFF          BF        $C$L9,TC              ; [CPU_] |233| 
     520                      ; branchcc occurs ; [] |233| 
     521 00000082       $C$DW$L$_DCAN_SendWordData$2$E:
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   11

     522                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     523 00000082       $C$L10:    
     524 00000082       $C$DW$L$_DCAN_SendWordData$4$B:
     525 00000082 761F!         MOVW      DP,#_DcanaRegs+136    ; [CPU_U] 
         00000083 0002 
     526 00000084 4108!         TBIT      @_DcanaRegs+136,#1    ; [CPU_] |234| 
     527 00000085 EEFD          BF        $C$L10,TC             ; [CPU_] |234| 
     528                      ; branchcc occurs ; [] |234| 
     529 00000086       $C$DW$L$_DCAN_SendWordData$4$E:
     530                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     531 00000086 FE82          SUBB      SP,#2                 ; [CPU_U] 
     532                      .dwcfi  cfa_offset, -2
     533              $C$DW$39        .dwtag  DW_TAG_TI_branch
     534                      .dwattr $C$DW$39, DW_AT_low_pc(0x00)
     535                      .dwattr $C$DW$39, DW_AT_TI_return
     536 00000087 0006          LRETR     ; [CPU_] 
     537                      ; return occurs ; [] 
     538              
     539              $C$DW$40        .dwtag  DW_TAG_TI_loop
     540                      .dwattr $C$DW$40, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0414810:$C$L10:1:1380659287"
     541                      .dwattr $C$DW$40, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     542                      .dwattr $C$DW$40, DW_AT_TI_begin_line(0xea)
     543                      .dwattr $C$DW$40, DW_AT_TI_end_line(0xea)
     544              $C$DW$41        .dwtag  DW_TAG_TI_loop_range
     545                      .dwattr $C$DW$41, DW_AT_low_pc($C$DW$L$_DCAN_SendWordData$4$B)
     546                      .dwattr $C$DW$41, DW_AT_high_pc($C$DW$L$_DCAN_SendWordData$4$E)
     547                      .dwendtag $C$DW$40
     548              
     549              
     550              $C$DW$42        .dwtag  DW_TAG_TI_loop
     551                      .dwattr $C$DW$42, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0414810:$C$L9:1:1380659287")
     552                      .dwattr $C$DW$42, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     553                      .dwattr $C$DW$42, DW_AT_TI_begin_line(0xe9)
     554                      .dwattr $C$DW$42, DW_AT_TI_end_line(0xe9)
     555              $C$DW$43        .dwtag  DW_TAG_TI_loop_range
     556                      .dwattr $C$DW$43, DW_AT_low_pc($C$DW$L$_DCAN_SendWordData$2$B)
     557                      .dwattr $C$DW$43, DW_AT_high_pc($C$DW$L$_DCAN_SendWordData$2$E)
     558                      .dwendtag $C$DW$42
     559              
     560                      .dwattr $C$DW$36, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
     561                      .dwattr $C$DW$36, DW_AT_TI_end_line(0xeb)
     562                      .dwattr $C$DW$36, DW_AT_TI_end_column(0x01)
     563                      .dwendentry
     564                      .dwendtag $C$DW$36
     565              
     566              ;**************************************************************
     567              ;* UNDEFINED EXTERNAL REFERENCES                              *
     568              ;**************************************************************
     569                      .global _CopyData
     570                      .global _ReadReservedFn
     571                      .global _GetWordData
     572                      .global _GetLongData
     573                      .global _CpuSysRegs
     574                      .global _DcanaRegs
     575              
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   12

     576              ;***************************************************************
     577              ;* TYPE INFORMATION                                            *
     578              ;***************************************************************
     579              
     580              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     581                      .dwattr $C$DW$T$20, DW_AT_name("CAN_BTR_BITS")
     582                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     583              $C$DW$44        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     585                      .dwattr $C$DW$44, DW_AT_name("BPR")
     586                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_BPR")
     587                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
     588                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     590              $C$DW$45        .dwtag  DW_TAG_member
     591                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     592                      .dwattr $C$DW$45, DW_AT_name("SJW")
     593                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_SJW")
     594                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     595                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     597              $C$DW$46        .dwtag  DW_TAG_member
     598                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     599                      .dwattr $C$DW$46, DW_AT_name("TSEG1")
     600                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_TSEG1")
     601                      .dwattr $C$DW$46, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     602                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     603                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     604              $C$DW$47        .dwtag  DW_TAG_member
     605                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     606                      .dwattr $C$DW$47, DW_AT_name("TSEG2")
     607                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_TSEG2")
     608                      .dwattr $C$DW$47, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x03)
     609                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     610                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     611              $C$DW$48        .dwtag  DW_TAG_member
     612                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     613                      .dwattr $C$DW$48, DW_AT_name("rsvd1")
     614                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd1")
     615                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     616                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     617                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     618              $C$DW$49        .dwtag  DW_TAG_member
     619                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     620                      .dwattr $C$DW$49, DW_AT_name("BRPE")
     621                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_BRPE")
     622                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     623                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     624                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     625              $C$DW$50        .dwtag  DW_TAG_member
     626                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     627                      .dwattr $C$DW$50, DW_AT_name("rsvd2")
     628                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd2")
     629                      .dwattr $C$DW$50, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     630                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   13

     631                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     632                      .dwendtag $C$DW$T$20
     633              
     634              
     635              $C$DW$T$22      .dwtag  DW_TAG_union_type
     636                      .dwattr $C$DW$T$22, DW_AT_name("CAN_BTR_REG")
     637                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     638              $C$DW$51        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     640                      .dwattr $C$DW$51, DW_AT_name("all")
     641                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_all")
     642                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     644              $C$DW$52        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
     646                      .dwattr $C$DW$52, DW_AT_name("bit")
     647                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_bit")
     648                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     649                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     650                      .dwendtag $C$DW$T$22
     651              
     652              
     653              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     654                      .dwattr $C$DW$T$23, DW_AT_name("CAN_CTL_BITS")
     655                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     656              $C$DW$53        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$53, DW_AT_name("Init")
     659                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_Init")
     660                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     661                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     663              $C$DW$54        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$54, DW_AT_name("IE0")
     666                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_IE0")
     667                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     668                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     670              $C$DW$55        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$55, DW_AT_name("SIE")
     673                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_SIE")
     674                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     675                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     677              $C$DW$56        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     679                      .dwattr $C$DW$56, DW_AT_name("EIE")
     680                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_EIE")
     681                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     682                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     684              $C$DW$57        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   14

     686                      .dwattr $C$DW$57, DW_AT_name("rsvd1")
     687                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd1")
     688                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     689                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$58        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$58, DW_AT_name("DAR")
     694                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_DAR")
     695                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     696                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$59        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$59, DW_AT_name("CCE")
     701                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CCE")
     702                      .dwattr $C$DW$59, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     703                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     705              $C$DW$60        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$60, DW_AT_name("Test")
     708                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_Test")
     709                      .dwattr $C$DW$60, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     710                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     711                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     712              $C$DW$61        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$61, DW_AT_name("IDS")
     715                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_IDS")
     716                      .dwattr $C$DW$61, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     717                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     718                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     719              $C$DW$62        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$62, DW_AT_name("ABO")
     722                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_ABO")
     723                      .dwattr $C$DW$62, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     724                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     725                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     726              $C$DW$63        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$63, DW_AT_name("PMD")
     729                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PMD")
     730                      .dwattr $C$DW$63, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x04)
     731                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$64        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$64, DW_AT_name("rsvd2")
     736                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd2")
     737                      .dwattr $C$DW$64, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     738                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$65        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   15

     741                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$65, DW_AT_name("SWR")
     743                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SWR")
     744                      .dwattr $C$DW$65, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     745                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     747              $C$DW$66        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$66, DW_AT_name("INITDBG")
     750                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_INITDBG")
     751                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     752                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     753                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     754              $C$DW$67        .dwtag  DW_TAG_member
     755                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$67, DW_AT_name("IE1")
     757                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_IE1")
     758                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     759                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     760                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     761              $C$DW$68        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     763                      .dwattr $C$DW$68, DW_AT_name("rsvd3")
     764                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd3")
     765                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
     766                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     767                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     768              $C$DW$69        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$69, DW_AT_name("PDR")
     771                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PDR")
     772                      .dwattr $C$DW$69, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     773                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     774                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     775              $C$DW$70        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$70, DW_AT_name("WUBA")
     778                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_WUBA")
     779                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     780                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     781                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     782              $C$DW$71        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     784                      .dwattr $C$DW$71, DW_AT_name("rsvd4")
     785                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd4")
     786                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     787                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     788                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     789                      .dwendtag $C$DW$T$23
     790              
     791              
     792              $C$DW$T$24      .dwtag  DW_TAG_union_type
     793                      .dwattr $C$DW$T$24, DW_AT_name("CAN_CTL_REG")
     794                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     795              $C$DW$72        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   16

     796                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     797                      .dwattr $C$DW$72, DW_AT_name("all")
     798                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
     799                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     800                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     801              $C$DW$73        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$23)
     803                      .dwattr $C$DW$73, DW_AT_name("bit")
     804                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
     805                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     806                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     807                      .dwendtag $C$DW$T$24
     808              
     809              
     810              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     811                      .dwattr $C$DW$T$25, DW_AT_name("CAN_ECCDIAG_BITS")
     812                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     813              $C$DW$74        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     815                      .dwattr $C$DW$74, DW_AT_name("ECCDIAG")
     816                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_ECCDIAG")
     817                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     818                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     819                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     820              $C$DW$75        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     822                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
     823                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
     824                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     825                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     826                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     827              $C$DW$76        .dwtag  DW_TAG_member
     828                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     829                      .dwattr $C$DW$76, DW_AT_name("rsvd2")
     830                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd2")
     831                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     832                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     833                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     834                      .dwendtag $C$DW$T$25
     835              
     836              
     837              $C$DW$T$26      .dwtag  DW_TAG_union_type
     838                      .dwattr $C$DW$T$26, DW_AT_name("CAN_ECCDIAG_REG")
     839                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     840              $C$DW$77        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
     842                      .dwattr $C$DW$77, DW_AT_name("all")
     843                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
     844                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$78        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$25)
     848                      .dwattr $C$DW$78, DW_AT_name("bit")
     849                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
     850                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   17

     851                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     852                      .dwendtag $C$DW$T$26
     853              
     854              
     855              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     856                      .dwattr $C$DW$T$27, DW_AT_name("CAN_ECCDIAG_STAT_BITS")
     857                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     858              $C$DW$79        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$79, DW_AT_name("SEFLG")
     861                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_SEFLG")
     862                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     863                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$80        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
     868                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
     869                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x07)
     870                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     872              $C$DW$81        .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     874                      .dwattr $C$DW$81, DW_AT_name("DEFLG")
     875                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_DEFLG")
     876                      .dwattr $C$DW$81, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     877                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     878                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     879              $C$DW$82        .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$82, DW_AT_name("rsvd2")
     882                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd2")
     883                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
     884                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     886              $C$DW$83        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     888                      .dwattr $C$DW$83, DW_AT_name("rsvd3")
     889                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd3")
     890                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     891                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     892                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     893                      .dwendtag $C$DW$T$27
     894              
     895              
     896              $C$DW$T$28      .dwtag  DW_TAG_union_type
     897                      .dwattr $C$DW$T$28, DW_AT_name("CAN_ECCDIAG_STAT_REG")
     898                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     899              $C$DW$84        .dwtag  DW_TAG_member
     900                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
     901                      .dwattr $C$DW$84, DW_AT_name("all")
     902                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
     903                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$85        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   18

     906                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$27)
     907                      .dwattr $C$DW$85, DW_AT_name("bit")
     908                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
     909                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     910                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     911                      .dwendtag $C$DW$T$28
     912              
     913              
     914              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     915                      .dwattr $C$DW$T$29, DW_AT_name("CAN_ERRC_BITS")
     916                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     917              $C$DW$86        .dwtag  DW_TAG_member
     918                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     919                      .dwattr $C$DW$86, DW_AT_name("TEC")
     920                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_TEC")
     921                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     922                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     924              $C$DW$87        .dwtag  DW_TAG_member
     925                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     926                      .dwattr $C$DW$87, DW_AT_name("REC")
     927                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_REC")
     928                      .dwattr $C$DW$87, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
     929                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$88        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     933                      .dwattr $C$DW$88, DW_AT_name("RP")
     934                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_RP")
     935                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     936                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     937                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     938              $C$DW$89        .dwtag  DW_TAG_member
     939                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     940                      .dwattr $C$DW$89, DW_AT_name("rsvd1")
     941                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd1")
     942                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     943                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     944                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     945                      .dwendtag $C$DW$T$29
     946              
     947              
     948              $C$DW$T$30      .dwtag  DW_TAG_union_type
     949                      .dwattr $C$DW$T$30, DW_AT_name("CAN_ERRC_REG")
     950                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     951              $C$DW$90        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
     953                      .dwattr $C$DW$90, DW_AT_name("all")
     954                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
     955                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     956                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     957              $C$DW$91        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$29)
     959                      .dwattr $C$DW$91, DW_AT_name("bit")
     960                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   19

     961                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     963                      .dwendtag $C$DW$T$30
     964              
     965              
     966              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     967                      .dwattr $C$DW$T$31, DW_AT_name("CAN_ES_BITS")
     968                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     969              $C$DW$92        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$92, DW_AT_name("LEC")
     972                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_LEC")
     973                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
     974                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     976              $C$DW$93        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$93, DW_AT_name("TxOk")
     979                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_TxOk")
     980                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     981                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     983              $C$DW$94        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$94, DW_AT_name("RxOk")
     986                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_RxOk")
     987                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     988                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     990              $C$DW$95        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$95, DW_AT_name("EPass")
     993                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_EPass")
     994                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     995                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$96        .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$96, DW_AT_name("EWarn")
    1000                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_EWarn")
    1001                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1002                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$97        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$97, DW_AT_name("BOff")
    1007                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_BOff")
    1008                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1009                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$98        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$98, DW_AT_name("PER")
    1014                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PER")
    1015                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   20

    1016                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$99        .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1020                      .dwattr $C$DW$99, DW_AT_name("WakeUpPnd")
    1021                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_WakeUpPnd")
    1022                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1023                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1025              $C$DW$100       .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$100, DW_AT_name("PDA")
    1028                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PDA")
    1029                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1030                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1032              $C$DW$101       .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$101, DW_AT_name("rsvd1")
    1035                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd1")
    1036                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    1037                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$102       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$102, DW_AT_name("rsvd2")
    1042                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd2")
    1043                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1044                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1045                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1046                      .dwendtag $C$DW$T$31
    1047              
    1048              
    1049              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1050                      .dwattr $C$DW$T$32, DW_AT_name("CAN_ES_REG")
    1051                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1052              $C$DW$103       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1054                      .dwattr $C$DW$103, DW_AT_name("all")
    1055                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1056                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$104       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$31)
    1060                      .dwattr $C$DW$104, DW_AT_name("bit")
    1061                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1062                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1064                      .dwendtag $C$DW$T$32
    1065              
    1066              
    1067              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1068                      .dwattr $C$DW$T$33, DW_AT_name("CAN_GLB_INT_CLR_BITS")
    1069                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1070              $C$DW$105       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   21

    1071                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$105, DW_AT_name("INT0_FLG_CLR")
    1073                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INT0_FLG_CLR")
    1074                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$106       .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$106, DW_AT_name("INT1_FLG_CLR")
    1080                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INT1_FLG_CLR")
    1081                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1082                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$107       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$107, DW_AT_name("rsvd1")
    1087                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd1")
    1088                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1089                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$108       .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$108, DW_AT_name("rsvd2")
    1094                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd2")
    1095                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1096                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1097                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1098                      .dwendtag $C$DW$T$33
    1099              
    1100              
    1101              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1102                      .dwattr $C$DW$T$34, DW_AT_name("CAN_GLB_INT_CLR_REG")
    1103                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1104              $C$DW$109       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1106                      .dwattr $C$DW$109, DW_AT_name("all")
    1107                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    1108                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1110              $C$DW$110       .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$33)
    1112                      .dwattr $C$DW$110, DW_AT_name("bit")
    1113                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    1114                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1116                      .dwendtag $C$DW$T$34
    1117              
    1118              
    1119              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1120                      .dwattr $C$DW$T$35, DW_AT_name("CAN_GLB_INT_EN_BITS")
    1121                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1122              $C$DW$111       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1124                      .dwattr $C$DW$111, DW_AT_name("GLBINT0_EN")
    1125                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GLBINT0_EN")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   22

    1126                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1127                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$112       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1131                      .dwattr $C$DW$112, DW_AT_name("GLBINT1_EN")
    1132                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GLBINT1_EN")
    1133                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1134                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1136              $C$DW$113       .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
    1139                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
    1140                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1141                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$114       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1145                      .dwattr $C$DW$114, DW_AT_name("rsvd2")
    1146                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd2")
    1147                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1148                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1149                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1150                      .dwendtag $C$DW$T$35
    1151              
    1152              
    1153              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1154                      .dwattr $C$DW$T$36, DW_AT_name("CAN_GLB_INT_EN_REG")
    1155                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1156              $C$DW$115       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1158                      .dwattr $C$DW$115, DW_AT_name("all")
    1159                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1160                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1162              $C$DW$116       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$35)
    1164                      .dwattr $C$DW$116, DW_AT_name("bit")
    1165                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    1166                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1168                      .dwendtag $C$DW$T$36
    1169              
    1170              
    1171              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1172                      .dwattr $C$DW$T$37, DW_AT_name("CAN_GLB_INT_FLG_BITS")
    1173                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1174              $C$DW$117       .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1176                      .dwattr $C$DW$117, DW_AT_name("Name")
    1177                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_Name")
    1178                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1179                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   23

    1181              $C$DW$118       .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$118, DW_AT_name("INT1_FLG")
    1184                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INT1_FLG")
    1185                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1186                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$119       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$119, DW_AT_name("rsvd1")
    1191                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd1")
    1192                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1193                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$120       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$120, DW_AT_name("rsvd2")
    1198                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd2")
    1199                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1200                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1201                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1202                      .dwendtag $C$DW$T$37
    1203              
    1204              
    1205              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1206                      .dwattr $C$DW$T$38, DW_AT_name("CAN_GLB_INT_FLG_REG")
    1207                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1208              $C$DW$121       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1210                      .dwattr $C$DW$121, DW_AT_name("all")
    1211                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1212                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$122       .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$37)
    1216                      .dwattr $C$DW$122, DW_AT_name("bit")
    1217                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1218                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1220                      .dwendtag $C$DW$T$38
    1221              
    1222              
    1223              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1224                      .dwattr $C$DW$T$39, DW_AT_name("CAN_IF1ARB_BITS")
    1225                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1226              $C$DW$123       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    1228                      .dwattr $C$DW$123, DW_AT_name("ID")
    1229                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_ID")
    1230                      .dwattr $C$DW$123, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x1d)
    1231                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1233              $C$DW$124       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$124, DW_AT_name("Dir")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   24

    1236                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_Dir")
    1237                      .dwattr $C$DW$124, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1238                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1239                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$125       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$125, DW_AT_name("Xtd")
    1243                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_Xtd")
    1244                      .dwattr $C$DW$125, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1246                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$126       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$126, DW_AT_name("MsgVal")
    1250                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_MsgVal")
    1251                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1252                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1253                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1254                      .dwendtag $C$DW$T$39
    1255              
    1256              
    1257              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1258                      .dwattr $C$DW$T$40, DW_AT_name("CAN_IF1ARB_REG")
    1259                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1260              $C$DW$127       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    1262                      .dwattr $C$DW$127, DW_AT_name("all")
    1263                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1264                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1266              $C$DW$128       .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$39)
    1268                      .dwattr $C$DW$128, DW_AT_name("bit")
    1269                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1270                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1272                      .dwendtag $C$DW$T$40
    1273              
    1274              
    1275              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1276                      .dwattr $C$DW$T$41, DW_AT_name("CAN_IF1CMD_BITS")
    1277                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1278              $C$DW$129       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$129, DW_AT_name("MSG_NUM")
    1281                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_MSG_NUM")
    1282                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1283                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$130       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1288                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1289                      .dwattr $C$DW$130, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1290                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   25

    1291                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$131       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1294                      .dwattr $C$DW$131, DW_AT_name("Busy")
    1295                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_Busy")
    1296                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1297                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$132       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$132, DW_AT_name("DATA_B")
    1302                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_DATA_B")
    1303                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1305                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$133       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$133, DW_AT_name("DATA_A")
    1309                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_DATA_A")
    1310                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1312                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$134       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$134, DW_AT_name("TXRQST")
    1316                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_TXRQST")
    1317                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1319                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$135       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$135, DW_AT_name("ClrIntPnd")
    1323                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ClrIntPnd")
    1324                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1325                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1326                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$136       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$136, DW_AT_name("Control")
    1330                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_Control")
    1331                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$137       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$137, DW_AT_name("Arb")
    1337                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_Arb")
    1338                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1339                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1340                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$138       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$138, DW_AT_name("Mask")
    1344                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_Mask")
    1345                      .dwattr $C$DW$138, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   26

    1346                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1347                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$139       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$139, DW_AT_name("DIR")
    1351                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_DIR")
    1352                      .dwattr $C$DW$139, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1353                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1354                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$140       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$140, DW_AT_name("rsvd2")
    1358                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_rsvd2")
    1359                      .dwattr $C$DW$140, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1360                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1361                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1362                      .dwendtag $C$DW$T$41
    1363              
    1364              
    1365              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1366                      .dwattr $C$DW$T$42, DW_AT_name("CAN_IF1CMD_REG")
    1367                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1368              $C$DW$141       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    1370                      .dwattr $C$DW$141, DW_AT_name("all")
    1371                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_all")
    1372                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$142       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$41)
    1376                      .dwattr $C$DW$142, DW_AT_name("bit")
    1377                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_bit")
    1378                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1379                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1380                      .dwendtag $C$DW$T$42
    1381              
    1382              
    1383              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1384                      .dwattr $C$DW$T$43, DW_AT_name("CAN_IF1DATA_BITS")
    1385                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1386              $C$DW$143       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1388                      .dwattr $C$DW$143, DW_AT_name("Data_0")
    1389                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_Data_0")
    1390                      .dwattr $C$DW$143, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1391                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1392                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1393              $C$DW$144       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$144, DW_AT_name("Data_1")
    1396                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_Data_1")
    1397                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1398                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$145       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   27

    1401                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1402                      .dwattr $C$DW$145, DW_AT_name("Data_2")
    1403                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_Data_2")
    1404                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1405                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1406                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$146       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$146, DW_AT_name("Data_3")
    1410                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_Data_3")
    1411                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1412                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1413                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1414                      .dwendtag $C$DW$T$43
    1415              
    1416              
    1417              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1418                      .dwattr $C$DW$T$44, DW_AT_name("CAN_IF1DATA_REG")
    1419                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1420              $C$DW$147       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    1422                      .dwattr $C$DW$147, DW_AT_name("all")
    1423                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    1424                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1425                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$148       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$43)
    1428                      .dwattr $C$DW$148, DW_AT_name("bit")
    1429                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    1430                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1431                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1432                      .dwendtag $C$DW$T$44
    1433              
    1434              
    1435              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1436                      .dwattr $C$DW$T$45, DW_AT_name("CAN_IF1DATB_BITS")
    1437                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1438              $C$DW$149       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$149, DW_AT_name("Data_4")
    1441                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_Data_4")
    1442                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1443                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1445              $C$DW$150       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1447                      .dwattr $C$DW$150, DW_AT_name("Data_5")
    1448                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_Data_5")
    1449                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1450                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1451                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1452              $C$DW$151       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$151, DW_AT_name("Data_6")
    1455                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_Data_6")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   28

    1456                      .dwattr $C$DW$151, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1457                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1458                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$152       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1461                      .dwattr $C$DW$152, DW_AT_name("Data_7")
    1462                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_Data_7")
    1463                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1464                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1465                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1466                      .dwendtag $C$DW$T$45
    1467              
    1468              
    1469              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1470                      .dwattr $C$DW$T$46, DW_AT_name("CAN_IF1DATB_REG")
    1471                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1472              $C$DW$153       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
    1474                      .dwattr $C$DW$153, DW_AT_name("all")
    1475                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    1476                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1477                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$154       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$45)
    1480                      .dwattr $C$DW$154, DW_AT_name("bit")
    1481                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    1482                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1484                      .dwendtag $C$DW$T$46
    1485              
    1486              
    1487              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1488                      .dwattr $C$DW$T$47, DW_AT_name("CAN_IF1MCTL_BITS")
    1489                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1490              $C$DW$155       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1492                      .dwattr $C$DW$155, DW_AT_name("DLC")
    1493                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_DLC")
    1494                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1495                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$156       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1499                      .dwattr $C$DW$156, DW_AT_name("rsvd1")
    1500                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd1")
    1501                      .dwattr $C$DW$156, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
    1502                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1503                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1504              $C$DW$157       .dwtag  DW_TAG_member
    1505                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1506                      .dwattr $C$DW$157, DW_AT_name("EoB")
    1507                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_EoB")
    1508                      .dwattr $C$DW$157, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1509                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1510                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   29

    1511              $C$DW$158       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1513                      .dwattr $C$DW$158, DW_AT_name("TxRqst")
    1514                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_TxRqst")
    1515                      .dwattr $C$DW$158, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1516                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1517                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1518              $C$DW$159       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1520                      .dwattr $C$DW$159, DW_AT_name("RmtEn")
    1521                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_RmtEn")
    1522                      .dwattr $C$DW$159, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1523                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1525              $C$DW$160       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$160, DW_AT_name("RxIE")
    1528                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_RxIE")
    1529                      .dwattr $C$DW$160, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1530                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$161       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1534                      .dwattr $C$DW$161, DW_AT_name("TxIE")
    1535                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_TxIE")
    1536                      .dwattr $C$DW$161, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1537                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$162       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1541                      .dwattr $C$DW$162, DW_AT_name("UMask")
    1542                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_UMask")
    1543                      .dwattr $C$DW$162, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1544                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$163       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$163, DW_AT_name("IntPnd")
    1549                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_IntPnd")
    1550                      .dwattr $C$DW$163, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1551                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$164       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1555                      .dwattr $C$DW$164, DW_AT_name("MsgLst")
    1556                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_MsgLst")
    1557                      .dwattr $C$DW$164, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1558                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1559                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1560              $C$DW$165       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1562                      .dwattr $C$DW$165, DW_AT_name("NewDat")
    1563                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_NewDat")
    1564                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1565                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   30

    1566                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1567              $C$DW$166       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1569                      .dwattr $C$DW$166, DW_AT_name("rsvd2")
    1570                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd2")
    1571                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1572                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1573                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1574                      .dwendtag $C$DW$T$47
    1575              
    1576              
    1577              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1578                      .dwattr $C$DW$T$48, DW_AT_name("CAN_IF1MCTL_REG")
    1579                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1580              $C$DW$167       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    1582                      .dwattr $C$DW$167, DW_AT_name("all")
    1583                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    1584                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1585                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1586              $C$DW$168       .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$47)
    1588                      .dwattr $C$DW$168, DW_AT_name("bit")
    1589                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    1590                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1592                      .dwendtag $C$DW$T$48
    1593              
    1594              
    1595              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1596                      .dwattr $C$DW$T$49, DW_AT_name("CAN_IF1MSK_BITS")
    1597                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1598              $C$DW$169       .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    1600                      .dwattr $C$DW$169, DW_AT_name("Msk")
    1601                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_Msk")
    1602                      .dwattr $C$DW$169, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x1d)
    1603                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1604                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$170       .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$170, DW_AT_name("rsvd1")
    1608                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd1")
    1609                      .dwattr $C$DW$170, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1610                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1611                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1612              $C$DW$171       .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1614                      .dwattr $C$DW$171, DW_AT_name("MDir")
    1615                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_MDir")
    1616                      .dwattr $C$DW$171, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1617                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1618                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1619              $C$DW$172       .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   31

    1621                      .dwattr $C$DW$172, DW_AT_name("MXtd")
    1622                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_MXtd")
    1623                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1624                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1625                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1626                      .dwendtag $C$DW$T$49
    1627              
    1628              
    1629              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1630                      .dwattr $C$DW$T$50, DW_AT_name("CAN_IF1MSK_REG")
    1631                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1632              $C$DW$173       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    1634                      .dwattr $C$DW$173, DW_AT_name("all")
    1635                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
    1636                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1638              $C$DW$174       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$49)
    1640                      .dwattr $C$DW$174, DW_AT_name("bit")
    1641                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
    1642                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1644                      .dwendtag $C$DW$T$50
    1645              
    1646              
    1647              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1648                      .dwattr $C$DW$T$51, DW_AT_name("CAN_IF2ARB_BITS")
    1649                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1650              $C$DW$175       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    1652                      .dwattr $C$DW$175, DW_AT_name("ID")
    1653                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ID")
    1654                      .dwattr $C$DW$175, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x1d)
    1655                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$176       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1659                      .dwattr $C$DW$176, DW_AT_name("Dir")
    1660                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_Dir")
    1661                      .dwattr $C$DW$176, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1662                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1663                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$177       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1666                      .dwattr $C$DW$177, DW_AT_name("Xtd")
    1667                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_Xtd")
    1668                      .dwattr $C$DW$177, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1670                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$178       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$178, DW_AT_name("MsgVal")
    1674                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_MsgVal")
    1675                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   32

    1676                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1677                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1678                      .dwendtag $C$DW$T$51
    1679              
    1680              
    1681              $C$DW$T$52      .dwtag  DW_TAG_union_type
    1682                      .dwattr $C$DW$T$52, DW_AT_name("CAN_IF2ARB_REG")
    1683                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1684              $C$DW$179       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    1686                      .dwattr $C$DW$179, DW_AT_name("all")
    1687                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    1688                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$180       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$51)
    1692                      .dwattr $C$DW$180, DW_AT_name("bit")
    1693                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    1694                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1696                      .dwendtag $C$DW$T$52
    1697              
    1698              
    1699              $C$DW$T$53      .dwtag  DW_TAG_structure_type
    1700                      .dwattr $C$DW$T$53, DW_AT_name("CAN_IF2CMD_BITS")
    1701                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    1702              $C$DW$181       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$181, DW_AT_name("MSG_NUM")
    1705                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_MSG_NUM")
    1706                      .dwattr $C$DW$181, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1707                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1709              $C$DW$182       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$182, DW_AT_name("rsvd1")
    1712                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd1")
    1713                      .dwattr $C$DW$182, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1714                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1716              $C$DW$183       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$183, DW_AT_name("Busy")
    1719                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_Busy")
    1720                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1721                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$184       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$184, DW_AT_name("DATA_B")
    1726                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DATA_B")
    1727                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1728                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1729                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1730              $C$DW$185       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:07 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0414810                         PAGE   33

    1731                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$185, DW_AT_name("DATA_A")
    1733                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_DATA_A")
    1734                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1735                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1736                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$186       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$186, DW_AT_name("TxRqst")
    1740                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_TxRqst")
    1741                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1742                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1743                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$187       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$187, DW_AT_name("ClrIntPnd")
    1747                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ClrIntPnd")
    1748                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1750                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$188       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$188, DW_AT_name("Control")
    1754                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_Control")
    1755                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1756                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1757                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$189       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$189, DW_AT_name("Arb")
    1761                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_Arb")
    1762                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1763                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1764                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
