TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:28:08 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

     452 0000007c FE02          ADDB      SP,#2                 ; [CPU_U] 
     453                      .dwcfi  cfa_offset, -4
     454              $C$DW$34        .dwtag  DW_TAG_variable, DW_AT_name("LowByte")
     455                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_LowByte")
     456                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     457                      .dwattr $C$DW$34, DW_AT_location[DW_OP_breg20 -1]
     458                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     459 0000007d 761F!         MOVW      DP,#_I2caRegs+5       ; [CPU_U] 
         0000007e 0000 
     460 0000007f 56BF!         MOVB      @_I2caRegs+5,#2,UNC   ; [CPU_] |245| 
         00000080 0205 
     461                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   10

     462 00000081 2809!         MOV       @_I2caRegs+9,#11296   ; [CPU_] |246| 
         00000082 2C20 
     463                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     464 00000083       $C$L9:    
     465 00000083       $C$DW$L$_I2C_GetWord$2$B:
     466                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     467 00000083 CC09!         AND       AL,@_I2caRegs+9,#0x0800 ; [CPU_] |249| 
         00000084 0800 
     468 00000085 FFCA          LSR       AL,11                 ; [CPU_] |249| 
     469 00000086 5201          CMPB      AL,#1                 ; [CPU_] |249| 
     470 00000087 ECFC          BF        $C$L9,EQ              ; [CPU_] |249| 
     471                      ; branchcc occurs ; [] |249| 
     472 00000088       $C$DW$L$_I2C_GetWord$2$E:
     473                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     474 00000088 9206!         MOV       AL,@_I2caRegs+6       ; [CPU_] |252| 
     475 00000089 9641          MOV       *-SP[1],AL            ; [CPU_] |252| 
     476                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     477 0000008a 5603!         MOV       ACC,@_I2caRegs+6 << #8 ; [CPU_] |253| 
         0000008b 0806 
     478 0000008c CA41          OR        AL,*-SP[1]            ; [CPU_] |253| 
     479                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     480 0000008d FE82          SUBB      SP,#2                 ; [CPU_U] 
     481                      .dwcfi  cfa_offset, -2
     482              $C$DW$35        .dwtag  DW_TAG_TI_branch
     483                      .dwattr $C$DW$35, DW_AT_low_pc(0x00)
     484                      .dwattr $C$DW$35, DW_AT_TI_return
     485 0000008e 0006          LRETR     ; [CPU_] 
     486                      ; return occurs ; [] 
     487              
     488              $C$DW$36        .dwtag  DW_TAG_TI_loop
     489                      .dwattr $C$DW$36, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0476010:$C$L9:1:1380659288")
     490                      .dwattr $C$DW$36, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     491                      .dwattr $C$DW$36, DW_AT_TI_begin_line(0xf9)
     492                      .dwattr $C$DW$36, DW_AT_TI_end_line(0xf9)
     493              $C$DW$37        .dwtag  DW_TAG_TI_loop_range
     494                      .dwattr $C$DW$37, DW_AT_low_pc($C$DW$L$_I2C_GetWord$2$B)
     495                      .dwattr $C$DW$37, DW_AT_high_pc($C$DW$L$_I2C_GetWord$2$E)
     496                      .dwendtag $C$DW$36
     497              
     498                      .dwattr $C$DW$33, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
     499                      .dwattr $C$DW$33, DW_AT_TI_end_line(0xfe)
     500                      .dwattr $C$DW$33, DW_AT_TI_end_column(0x01)
     501                      .dwendentry
     502                      .dwendtag $C$DW$33
     503              
     504              ;**************************************************************
     505              ;* UNDEFINED EXTERNAL REFERENCES                              *
     506              ;**************************************************************
     507                      .global _CopyData
     508                      .global _GetLongData
     509                      .global _GetWordData
     510                      .global _I2caRegs
     511                      .global _CpuSysRegs
     512              
     513              ;***************************************************************
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   11

     514              ;* TYPE INFORMATION                                            *
     515              ;***************************************************************
     516              
     517              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     518                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
     519                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     520              $C$DW$38        .dwtag  DW_TAG_member
     521                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     522                      .dwattr $C$DW$38, DW_AT_name("VMAPS")
     523                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_VMAPS")
     524                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     525                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     526                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     527              $C$DW$39        .dwtag  DW_TAG_member
     528                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     529                      .dwattr $C$DW$39, DW_AT_name("MONPRIV")
     530                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_MONPRIV")
     531                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     532                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     533                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     534              $C$DW$40        .dwtag  DW_TAG_member
     535                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     536                      .dwattr $C$DW$40, DW_AT_name("ENPROT")
     537                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_ENPROT")
     538                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     539                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     540                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     541              $C$DW$41        .dwtag  DW_TAG_member
     542                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     543                      .dwattr $C$DW$41, DW_AT_name("rsvd1")
     544                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd1")
     545                      .dwattr $C$DW$41, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     546                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     548              $C$DW$42        .dwtag  DW_TAG_member
     549                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     550                      .dwattr $C$DW$42, DW_AT_name("rsvd2")
     551                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd2")
     552                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     553                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     554                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     555                      .dwendtag $C$DW$T$20
     556              
     557              
     558              $C$DW$T$22      .dwtag  DW_TAG_union_type
     559                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
     560                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     561              $C$DW$43        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$21)
     563                      .dwattr $C$DW$43, DW_AT_name("all")
     564                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     565                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     566                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     567              $C$DW$44        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   12

     569                      .dwattr $C$DW$44, DW_AT_name("bit")
     570                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     571                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     573                      .dwendtag $C$DW$T$22
     574              
     575              
     576              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     577                      .dwattr $C$DW$T$23, DW_AT_name("CPUSYSLOCK1_BITS")
     578                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     579              $C$DW$45        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     581                      .dwattr $C$DW$45, DW_AT_name("HIBBOOTMODE")
     582                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_HIBBOOTMODE")
     583                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     584                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     585                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     586              $C$DW$46        .dwtag  DW_TAG_member
     587                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     588                      .dwattr $C$DW$46, DW_AT_name("IORESTOREADDR")
     589                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_IORESTOREADDR")
     590                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     591                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     593              $C$DW$47        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     595                      .dwattr $C$DW$47, DW_AT_name("PIEVERRADDR")
     596                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_PIEVERRADDR")
     597                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     598                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     600              $C$DW$48        .dwtag  DW_TAG_member
     601                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     602                      .dwattr $C$DW$48, DW_AT_name("PCLKCR0")
     603                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_PCLKCR0")
     604                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     605                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     606                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     607              $C$DW$49        .dwtag  DW_TAG_member
     608                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     609                      .dwattr $C$DW$49, DW_AT_name("PCLKCR1")
     610                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_PCLKCR1")
     611                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     612                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     613                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     614              $C$DW$50        .dwtag  DW_TAG_member
     615                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     616                      .dwattr $C$DW$50, DW_AT_name("PCLKCR2")
     617                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PCLKCR2")
     618                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     619                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     620                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     621              $C$DW$51        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     623                      .dwattr $C$DW$51, DW_AT_name("PCLKCR3")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   13

     624                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PCLKCR3")
     625                      .dwattr $C$DW$51, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     626                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     627                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     628              $C$DW$52        .dwtag  DW_TAG_member
     629                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     630                      .dwattr $C$DW$52, DW_AT_name("PCLKCR4")
     631                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_PCLKCR4")
     632                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     633                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     635              $C$DW$53        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     637                      .dwattr $C$DW$53, DW_AT_name("PCLKCR5")
     638                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PCLKCR5")
     639                      .dwattr $C$DW$53, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     640                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     641                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     642              $C$DW$54        .dwtag  DW_TAG_member
     643                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     644                      .dwattr $C$DW$54, DW_AT_name("PCLKCR6")
     645                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PCLKCR6")
     646                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     647                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$55        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     651                      .dwattr $C$DW$55, DW_AT_name("PCLKCR7")
     652                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PCLKCR7")
     653                      .dwattr $C$DW$55, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     654                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     655                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     656              $C$DW$56        .dwtag  DW_TAG_member
     657                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     658                      .dwattr $C$DW$56, DW_AT_name("PCLKCR8")
     659                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PCLKCR8")
     660                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     661                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     663              $C$DW$57        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     665                      .dwattr $C$DW$57, DW_AT_name("PCLKCR9")
     666                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PCLKCR9")
     667                      .dwattr $C$DW$57, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     668                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     670              $C$DW$58        .dwtag  DW_TAG_member
     671                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     672                      .dwattr $C$DW$58, DW_AT_name("PCLKCR10")
     673                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PCLKCR10")
     674                      .dwattr $C$DW$58, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     675                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     676                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     677              $C$DW$59        .dwtag  DW_TAG_member
     678                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   14

     679                      .dwattr $C$DW$59, DW_AT_name("PCLKCR11")
     680                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PCLKCR11")
     681                      .dwattr $C$DW$59, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     682                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     684              $C$DW$60        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     686                      .dwattr $C$DW$60, DW_AT_name("PCLKCR12")
     687                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PCLKCR12")
     688                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     689                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$61        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$61, DW_AT_name("PCLKCR13")
     694                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PCLKCR13")
     695                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     696                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     697                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$62        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     700                      .dwattr $C$DW$62, DW_AT_name("PCLKCR14")
     701                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PCLKCR14")
     702                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     703                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     704                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     705              $C$DW$63        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$63, DW_AT_name("PCLKCR15")
     708                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PCLKCR15")
     709                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     710                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     711                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     712              $C$DW$64        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$64, DW_AT_name("PCLKCR16")
     715                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PCLKCR16")
     716                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     717                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     718                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     719              $C$DW$65        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$65, DW_AT_name("SECMSEL")
     722                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SECMSEL")
     723                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     724                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     725                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     726              $C$DW$66        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$66, DW_AT_name("LPMCR")
     729                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_LPMCR")
     730                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     731                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     732                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$67        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   15

     734                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$67, DW_AT_name("GPIOLPMSEL0")
     736                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
     737                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     738                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     739                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$68        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$68, DW_AT_name("GPIOLPMSEL1")
     743                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
     744                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     745                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     746                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     747              $C$DW$69        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$69, DW_AT_name("rsvd1")
     750                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd1")
     751                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     752                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     753                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     754                      .dwendtag $C$DW$T$23
     755              
     756              
     757              $C$DW$T$24      .dwtag  DW_TAG_union_type
     758                      .dwattr $C$DW$T$24, DW_AT_name("CPUSYSLOCK1_REG")
     759                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     760              $C$DW$70        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
     762                      .dwattr $C$DW$70, DW_AT_name("all")
     763                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     764                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     765                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     766              $C$DW$71        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
     768                      .dwattr $C$DW$71, DW_AT_name("bit")
     769                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
     770                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     771                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     772                      .dwendtag $C$DW$T$24
     773              
     774              
     775              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     776                      .dwattr $C$DW$T$29, DW_AT_name("CPU_SYS_REGS")
     777                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x82)
     778              $C$DW$72        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$24)
     780                      .dwattr $C$DW$72, DW_AT_name("CPUSYSLOCK1")
     781                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
     782                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     784              $C$DW$73        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
     786                      .dwattr $C$DW$73, DW_AT_name("rsvd1")
     787                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd1")
     788                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   16

     789                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     790              $C$DW$74        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     792                      .dwattr $C$DW$74, DW_AT_name("HIBBOOTMODE")
     793                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_HIBBOOTMODE")
     794                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     795                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     796              $C$DW$75        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$53)
     798                      .dwattr $C$DW$75, DW_AT_name("IORESTOREADDR")
     799                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_IORESTOREADDR")
     800                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     801                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     802              $C$DW$76        .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$89)
     804                      .dwattr $C$DW$76, DW_AT_name("PIEVERRADDR")
     805                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_PIEVERRADDR")
     806                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     807                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     808              $C$DW$77        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$26)
     810                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
     811                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
     812                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     813                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     814              $C$DW$78        .dwtag  DW_TAG_member
     815                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$57)
     816                      .dwattr $C$DW$78, DW_AT_name("PCLKCR0")
     817                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PCLKCR0")
     818                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     819                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     820              $C$DW$79        .dwtag  DW_TAG_member
     821                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$71)
     822                      .dwattr $C$DW$79, DW_AT_name("PCLKCR1")
     823                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PCLKCR1")
     824                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     825                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     826              $C$DW$80        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$73)
     828                      .dwattr $C$DW$80, DW_AT_name("PCLKCR2")
     829                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PCLKCR2")
     830                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     831                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     832              $C$DW$81        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$75)
     834                      .dwattr $C$DW$81, DW_AT_name("PCLKCR3")
     835                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_PCLKCR3")
     836                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     837                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     838              $C$DW$82        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$77)
     840                      .dwattr $C$DW$82, DW_AT_name("PCLKCR4")
     841                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PCLKCR4")
     842                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     843                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   17

     844              $C$DW$83        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$79)
     846                      .dwattr $C$DW$83, DW_AT_name("PCLKCR5")
     847                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_PCLKCR5")
     848                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     849                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     850              $C$DW$84        .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$81)
     852                      .dwattr $C$DW$84, DW_AT_name("PCLKCR6")
     853                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PCLKCR6")
     854                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     855                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     856              $C$DW$85        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$83)
     858                      .dwattr $C$DW$85, DW_AT_name("PCLKCR7")
     859                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_PCLKCR7")
     860                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     861                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     862              $C$DW$86        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$85)
     864                      .dwattr $C$DW$86, DW_AT_name("PCLKCR8")
     865                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_PCLKCR8")
     866                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     867                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     868              $C$DW$87        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$87)
     870                      .dwattr $C$DW$87, DW_AT_name("PCLKCR9")
     871                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_PCLKCR9")
     872                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     873                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     874              $C$DW$88        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$59)
     876                      .dwattr $C$DW$88, DW_AT_name("PCLKCR10")
     877                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PCLKCR10")
     878                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     879                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     880              $C$DW$89        .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$61)
     882                      .dwattr $C$DW$89, DW_AT_name("PCLKCR11")
     883                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PCLKCR11")
     884                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     885                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     886              $C$DW$90        .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$63)
     888                      .dwattr $C$DW$90, DW_AT_name("PCLKCR12")
     889                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PCLKCR12")
     890                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     891                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     892              $C$DW$91        .dwtag  DW_TAG_member
     893                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$65)
     894                      .dwattr $C$DW$91, DW_AT_name("PCLKCR13")
     895                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PCLKCR13")
     896                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     897                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     898              $C$DW$92        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   18

     899                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$67)
     900                      .dwattr $C$DW$92, DW_AT_name("PCLKCR14")
     901                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PCLKCR14")
     902                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     903                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     904              $C$DW$93        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$27)
     906                      .dwattr $C$DW$93, DW_AT_name("rsvd3")
     907                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd3")
     908                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     909                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     910              $C$DW$94        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$69)
     912                      .dwattr $C$DW$94, DW_AT_name("PCLKCR16")
     913                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PCLKCR16")
     914                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     915                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$95        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$28)
     918                      .dwattr $C$DW$95, DW_AT_name("rsvd4")
     919                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd4")
     920                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     921                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$96        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
     924                      .dwattr $C$DW$96, DW_AT_name("CCR")
     925                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_CCR")
     926                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     927                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$97        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$93)
     930                      .dwattr $C$DW$97, DW_AT_name("SECMSEL")
     931                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SECMSEL")
     932                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     933                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     934              $C$DW$98        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$55)
     936                      .dwattr $C$DW$98, DW_AT_name("LPMCR")
     937                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_LPMCR")
     938                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
     939                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     940              $C$DW$99        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$31)
     942                      .dwattr $C$DW$99, DW_AT_name("GPIOLPMSEL0")
     943                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
     944                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     945                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     946              $C$DW$100       .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$33)
     948                      .dwattr $C$DW$100, DW_AT_name("GPIOLPMSEL1")
     949                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
     950                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
     951                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     952              $C$DW$101       .dwtag  DW_TAG_member
     953                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$95)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   19

     954                      .dwattr $C$DW$101, DW_AT_name("TMR2CLKCTL")
     955                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_TMR2CLKCTL")
     956                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     957                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     958              $C$DW$102       .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$27)
     960                      .dwattr $C$DW$102, DW_AT_name("rsvd5")
     961                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd5")
     962                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
     963                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     964              $C$DW$103       .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$91)
     966                      .dwattr $C$DW$103, DW_AT_name("RESC")
     967                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_RESC")
     968                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     969                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     970                      .dwendtag $C$DW$T$29
     971              
     972              $C$DW$104       .dwtag  DW_TAG_TI_far_type
     973                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$29)
     974              $C$DW$T$96      .dwtag  DW_TAG_volatile_type
     975                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$104)
     976              
     977              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     978                      .dwattr $C$DW$T$30, DW_AT_name("GPIOLPMSEL0_BITS")
     979                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     980              $C$DW$105       .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$105, DW_AT_name("GPIO0")
     983                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO0")
     984                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     985                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     987              $C$DW$106       .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     989                      .dwattr $C$DW$106, DW_AT_name("GPIO1")
     990                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO1")
     991                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     992                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     994              $C$DW$107       .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     996                      .dwattr $C$DW$107, DW_AT_name("GPIO2")
     997                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO2")
     998                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     999                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1001              $C$DW$108       .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$108, DW_AT_name("GPIO3")
    1004                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO3")
    1005                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1006                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1008              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   20

    1009                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$109, DW_AT_name("GPIO4")
    1011                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO4")
    1012                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1013                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$110       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$110, DW_AT_name("GPIO5")
    1018                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO5")
    1019                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1020                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1022              $C$DW$111       .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$111, DW_AT_name("GPIO6")
    1025                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO6")
    1026                      .dwattr $C$DW$111, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$112       .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$112, DW_AT_name("GPIO7")
    1032                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO7")
    1033                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$113       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$113, DW_AT_name("GPIO8")
    1039                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO8")
    1040                      .dwattr $C$DW$113, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1041                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$114       .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$114, DW_AT_name("GPIO9")
    1046                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO9")
    1047                      .dwattr $C$DW$114, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1048                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1050              $C$DW$115       .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$115, DW_AT_name("GPIO10")
    1053                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO10")
    1054                      .dwattr $C$DW$115, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1055                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$116       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$116, DW_AT_name("GPIO11")
    1060                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO11")
    1061                      .dwattr $C$DW$116, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   21

    1064              $C$DW$117       .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$117, DW_AT_name("GPIO12")
    1067                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO12")
    1068                      .dwattr $C$DW$117, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$118       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$118, DW_AT_name("GPIO13")
    1074                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO13")
    1075                      .dwattr $C$DW$118, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1076                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$119       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$119, DW_AT_name("GPIO14")
    1081                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO14")
    1082                      .dwattr $C$DW$119, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1083                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$120       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$120, DW_AT_name("GPIO15")
    1088                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO15")
    1089                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1090                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$121       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$121, DW_AT_name("GPIO16")
    1095                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO16")
    1096                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1098                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$122       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$122, DW_AT_name("GPIO17")
    1102                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO17")
    1103                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1104                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1105                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1106              $C$DW$123       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$123, DW_AT_name("GPIO18")
    1109                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO18")
    1110                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1111                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1112                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$124       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$124, DW_AT_name("GPIO19")
    1116                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO19")
    1117                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1118                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   22

    1119                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$125       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$125, DW_AT_name("GPIO20")
    1123                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO20")
    1124                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1126                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1127              $C$DW$126       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$126, DW_AT_name("GPIO21")
    1130                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO21")
    1131                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1132                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1133                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1134              $C$DW$127       .dwtag  DW_TAG_member
    1135                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1136                      .dwattr $C$DW$127, DW_AT_name("GPIO22")
    1137                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO22")
    1138                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1139                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1140                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$128       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$128, DW_AT_name("GPIO23")
    1144                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO23")
    1145                      .dwattr $C$DW$128, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1146                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1147                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1148              $C$DW$129       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$129, DW_AT_name("GPIO24")
    1151                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO24")
    1152                      .dwattr $C$DW$129, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1153                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1154                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1155              $C$DW$130       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$130, DW_AT_name("GPIO25")
    1158                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO25")
    1159                      .dwattr $C$DW$130, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1160                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1161                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1162              $C$DW$131       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$131, DW_AT_name("GPIO26")
    1165                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO26")
    1166                      .dwattr $C$DW$131, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1167                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1168                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1169              $C$DW$132       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$132, DW_AT_name("GPIO27")
    1172                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO27")
    1173                      .dwattr $C$DW$132, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   23

    1174                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1175                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$133       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$133, DW_AT_name("GPIO28")
    1179                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO28")
    1180                      .dwattr $C$DW$133, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1181                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1182                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1183              $C$DW$134       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$134, DW_AT_name("GPIO29")
    1186                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO29")
    1187                      .dwattr $C$DW$134, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1189                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1190              $C$DW$135       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$135, DW_AT_name("GPIO30")
    1193                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO30")
    1194                      .dwattr $C$DW$135, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1195                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1196                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1197              $C$DW$136       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$136, DW_AT_name("GPIO31")
    1200                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO31")
    1201                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1202                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1203                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1204                      .dwendtag $C$DW$T$30
    1205              
    1206              
    1207              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1208                      .dwattr $C$DW$T$31, DW_AT_name("GPIOLPMSEL0_REG")
    1209                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1210              $C$DW$137       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    1212                      .dwattr $C$DW$137, DW_AT_name("all")
    1213                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_all")
    1214                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$138       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$30)
    1218                      .dwattr $C$DW$138, DW_AT_name("bit")
    1219                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_bit")
    1220                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1222                      .dwendtag $C$DW$T$31
    1223              
    1224              
    1225              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1226                      .dwattr $C$DW$T$32, DW_AT_name("GPIOLPMSEL1_BITS")
    1227                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1228              $C$DW$139       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   24

    1229                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$139, DW_AT_name("GPIO32")
    1231                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO32")
    1232                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1233                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$140       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$140, DW_AT_name("GPIO33")
    1238                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO33")
    1239                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$141       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$141, DW_AT_name("GPIO34")
    1245                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO34")
    1246                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1247                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$142       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$142, DW_AT_name("GPIO35")
    1252                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO35")
    1253                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$143       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$143, DW_AT_name("GPIO36")
    1259                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO36")
    1260                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1261                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$144       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$144, DW_AT_name("GPIO37")
    1266                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO37")
    1267                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1268                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$145       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$145, DW_AT_name("GPIO38")
    1273                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO38")
    1274                      .dwattr $C$DW$145, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1275                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$146       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$146, DW_AT_name("GPIO39")
    1280                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO39")
    1281                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1282                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   25

    1284              $C$DW$147       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$147, DW_AT_name("GPIO40")
    1287                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO40")
    1288                      .dwattr $C$DW$147, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1289                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1290                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$148       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$148, DW_AT_name("GPIO41")
    1294                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO41")
    1295                      .dwattr $C$DW$148, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1296                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1298              $C$DW$149       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$149, DW_AT_name("GPIO42")
    1301                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO42")
    1302                      .dwattr $C$DW$149, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1303                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1305              $C$DW$150       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$150, DW_AT_name("GPIO43")
    1308                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO43")
    1309                      .dwattr $C$DW$150, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1310                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$151       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$151, DW_AT_name("GPIO44")
    1315                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO44")
    1316                      .dwattr $C$DW$151, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1317                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$152       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$152, DW_AT_name("GPIO45")
    1322                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO45")
    1323                      .dwattr $C$DW$152, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$153       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$153, DW_AT_name("GPIO46")
    1329                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO46")
    1330                      .dwattr $C$DW$153, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1331                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$154       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$154, DW_AT_name("GPIO47")
    1336                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO47")
    1337                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   26

    1339                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$155       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$155, DW_AT_name("GPIO48")
    1343                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO48")
    1344                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1346                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$156       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$156, DW_AT_name("GPIO49")
    1350                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO49")
    1351                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1352                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1353                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$157       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$157, DW_AT_name("GPIO50")
    1357                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO50")
    1358                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1359                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1360                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1361              $C$DW$158       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$158, DW_AT_name("GPIO51")
    1364                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO51")
    1365                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1366                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1367                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$159       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$159, DW_AT_name("GPIO52")
    1371                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO52")
    1372                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1373                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1374                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1375              $C$DW$160       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$160, DW_AT_name("GPIO53")
    1378                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO53")
    1379                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1380                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1381                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$161       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1384                      .dwattr $C$DW$161, DW_AT_name("GPIO54")
    1385                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO54")
    1386                      .dwattr $C$DW$161, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1387                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1388                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1389              $C$DW$162       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$162, DW_AT_name("GPIO55")
    1392                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO55")
    1393                      .dwattr $C$DW$162, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   27

    1394                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1395                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$163       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1398                      .dwattr $C$DW$163, DW_AT_name("GPIO56")
    1399                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO56")
    1400                      .dwattr $C$DW$163, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1402                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1403              $C$DW$164       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$164, DW_AT_name("GPIO57")
    1406                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO57")
    1407                      .dwattr $C$DW$164, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1409                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1410              $C$DW$165       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$165, DW_AT_name("GPIO58")
    1413                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO58")
    1414                      .dwattr $C$DW$165, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1415                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1416                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1417              $C$DW$166       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$166, DW_AT_name("GPIO59")
    1420                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO59")
    1421                      .dwattr $C$DW$166, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1422                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1423                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$167       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$167, DW_AT_name("GPIO60")
    1427                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO60")
    1428                      .dwattr $C$DW$167, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1429                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1430                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1431              $C$DW$168       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$168, DW_AT_name("GPIO61")
    1434                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO61")
    1435                      .dwattr $C$DW$168, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1436                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1437                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1438              $C$DW$169       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$169, DW_AT_name("GPIO62")
    1441                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO62")
    1442                      .dwattr $C$DW$169, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1443                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1444                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1445              $C$DW$170       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1447                      .dwattr $C$DW$170, DW_AT_name("GPIO63")
    1448                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO63")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   28

    1449                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1450                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1451                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1452                      .dwendtag $C$DW$T$32
    1453              
    1454              
    1455              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1456                      .dwattr $C$DW$T$33, DW_AT_name("GPIOLPMSEL1_REG")
    1457                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1458              $C$DW$171       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    1460                      .dwattr $C$DW$171, DW_AT_name("all")
    1461                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    1462                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1464              $C$DW$172       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$32)
    1466                      .dwattr $C$DW$172, DW_AT_name("bit")
    1467                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_bit")
    1468                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1469                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1470                      .dwendtag $C$DW$T$33
    1471              
    1472              
    1473              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1474                      .dwattr $C$DW$T$34, DW_AT_name("I2CEMDR_BITS")
    1475                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1476              $C$DW$173       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$173, DW_AT_name("BC")
    1479                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_BC")
    1480                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1481                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1483              $C$DW$174       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    1486                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    1487                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1488                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1490                      .dwendtag $C$DW$T$34
    1491              
    1492              
    1493              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1494                      .dwattr $C$DW$T$35, DW_AT_name("I2CEMDR_REG")
    1495                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1496              $C$DW$175       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$175, DW_AT_name("all")
    1499                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    1500                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1501                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$176       .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$34)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   29

    1504                      .dwattr $C$DW$176, DW_AT_name("bit")
    1505                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    1506                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1508                      .dwendtag $C$DW$T$35
    1509              
    1510              
    1511              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1512                      .dwattr $C$DW$T$36, DW_AT_name("I2CFFRX_BITS")
    1513                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1514              $C$DW$177       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1516                      .dwattr $C$DW$177, DW_AT_name("RXFFIL")
    1517                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_RXFFIL")
    1518                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    1519                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1520                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$178       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1523                      .dwattr $C$DW$178, DW_AT_name("RXFFIENA")
    1524                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_RXFFIENA")
    1525                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1526                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1528              $C$DW$179       .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$179, DW_AT_name("RXFFINTCLR")
    1531                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_RXFFINTCLR")
    1532                      .dwattr $C$DW$179, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1533                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1535              $C$DW$180       .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$180, DW_AT_name("RXFFINT")
    1538                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_RXFFINT")
    1539                      .dwattr $C$DW$180, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1540                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1541                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1542              $C$DW$181       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$181, DW_AT_name("RXFFST")
    1545                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_RXFFST")
    1546                      .dwattr $C$DW$181, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    1547                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1549              $C$DW$182       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1551                      .dwattr $C$DW$182, DW_AT_name("RXFFRST")
    1552                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_RXFFRST")
    1553                      .dwattr $C$DW$182, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1554                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$183       .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1558                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   30

    1559                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    1560                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1561                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1563                      .dwendtag $C$DW$T$36
    1564              
    1565              
    1566              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1567                      .dwattr $C$DW$T$37, DW_AT_name("I2CFFRX_REG")
    1568                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1569              $C$DW$184       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$184, DW_AT_name("all")
    1572                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_all")
    1573                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1575              $C$DW$185       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$36)
    1577                      .dwattr $C$DW$185, DW_AT_name("bit")
    1578                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_bit")
    1579                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1581                      .dwendtag $C$DW$T$37
    1582              
    1583              
    1584              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1585                      .dwattr $C$DW$T$38, DW_AT_name("I2CFFTX_BITS")
    1586                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1587              $C$DW$186       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$186, DW_AT_name("TXFFIL")
    1590                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_TXFFIL")
    1591                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    1592                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$187       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$187, DW_AT_name("TXFFIENA")
    1597                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_TXFFIENA")
    1598                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$188       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$188, DW_AT_name("TXFFINTCLR")
    1604                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_TXFFINTCLR")
    1605                      .dwattr $C$DW$188, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$189       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$189, DW_AT_name("TXFFINT")
    1611                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_TXFFINT")
    1612                      .dwattr $C$DW$189, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:08 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0476010                         PAGE   31

    1614                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$190       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$190, DW_AT_name("TXFFST")
    1618                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_TXFFST")
    1619                      .dwattr $C$DW$190, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x05)
    1620                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$191       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$191, DW_AT_name("TXFFRST")
    1625                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_TXFFRST")
    1626                      .dwattr $C$DW$191, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1627                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$192       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$192, DW_AT_name("I2CFFEN")
    1632                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_I2CFFEN")
    1633                      .dwattr $C$DW$192, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1634                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$193       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$193, DW_AT_name("rsvd1")
    1639                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd1")
    1640                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1643                      .dwendtag $C$DW$T$38
    1644              
    1645              
    1646              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1647                      .dwattr $C$DW$T$39, DW_AT_name("I2CFFTX_REG")
    1648                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1649              $C$DW$194       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1651                      .dwattr $C$DW$194, DW_AT_name("all")
    1652                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    1653                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1655              $C$DW$195       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$38)
    1657                      .dwattr $C$DW$195, DW_AT_name("bit")
    1658                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    1659                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1661                      .dwendtag $C$DW$T$39
    1662              
    1663              
    1664              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1665                      .dwattr $C$DW$T$40, DW_AT_name("I2CIER_BITS")
