TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:26:29 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CRCCalcZ2")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CRCCalcZ2")

    4010                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4011 000005a8 2B4A          MOV       *-SP[10],#0           ; [CPU_] |1713| 
    4012                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4013 000005a9 9A00          MOVB      AL,#0                 ; [CPU_] |1714| 
    4014 000005aa 6F16          B         $C$L106,UNC           ; [CPU_] |1714| 
    4015                      ; branch occurs ; [] |1714| 
    4016 000005ab       $C$L105:    
    4017                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4018 000005ab 8A46          MOVL      XAR4,*-SP[6]          ; [CPU_] |1717| 
    4019 000005ac 8344          MOVL      XAR5,*-SP[4]          ; [CPU_] |1717| 
    4020 000005ad 9241          MOV       AL,*-SP[1]            ; [CPU_] |1717| 
    4021              $C$DW$69        .dwtag  DW_TAG_TI_branch
    4022                      .dwattr $C$DW$69, DW_AT_low_pc(0x00)
    4023                      .dwattr $C$DW$69, DW_AT_name("_CRCCalcZ2")
    4024                      .dwattr $C$DW$69, DW_AT_TI_call
    4025 000005ae 7640!         LCR       #_CRCCalcZ2           ; [CPU_] |1717| 
         000005af 0000 
    4026                      ; call occurs [#_CRCCalcZ2] ; [] |1717| 
    4027 000005b0 964B          MOV       *-SP[11],AL           ; [CPU_] |1717| 
    4028                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4029 000005b1 761F!         MOVW      DP,#_DcsmRegsZ2+34    ; [CPU_U] 
         000005b2 0000 
    4030 000005b3 1822!         AND       @_DcsmRegsZ2+34,#0xfffe ; [CPU_] |1719| 
         000005b4 FFFE 
    4031                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4032 000005b5 0200          MOVB      ACC,#0                ; [CPU_] |1721| 
    4033 000005b6 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |1721| 
    4034                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4035 000005b7 1E46          MOVL      *-SP[6],ACC           ; [CPU_] |1722| 
    4036                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4037 000005b8 2847          MOV       *-SP[7],#65535        ; [CPU_] |1723| 
         000005b9 FFFF 
    4038                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4039 000005ba 2848          MOV       *-SP[8],#65535        ; [CPU_] |1724| 
         000005bb FFFF 
    4040                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4041 000005bc 2849          MOV       *-SP[9],#65535        ; [CPU_] |1725| 
         000005bd FFFF 
    4042                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4043 000005be 2B4A          MOV       *-SP[10],#0           ; [CPU_] |1726| 
    4044                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4045 000005bf 924B          MOV       AL,*-SP[11]           ; [CPU_] |1728| 
    4046 000005c0       $C$L106:    
    4047                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4048 000005c0 FE8C          SUBB      SP,#12                ; [CPU_U] 
    4049                      .dwcfi  cfa_offset, -2
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   88

    4050              $C$DW$70        .dwtag  DW_TAG_TI_branch
    4051                      .dwattr $C$DW$70, DW_AT_low_pc(0x00)
    4052                      .dwattr $C$DW$70, DW_AT_TI_return
    4053 000005c1 0006          LRETR     ; [CPU_] 
    4054                      ; return occurs ; [] 
    4055                      .dwattr $C$DW$57, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
    4056                      .dwattr $C$DW$57, DW_AT_TI_end_line(0x6c2)
    4057                      .dwattr $C$DW$57, DW_AT_TI_end_column(0x01)
    4058                      .dwendentry
    4059                      .dwendtag $C$DW$57
    4060              
    4061              ;**************************************************************
    4062              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4063              ;**************************************************************
    4064                      .global _CRCCalcZ2
    4065                      .global _CRCCalcZ1
    4066                      .global _DcsmRegsCommon
    4067                      .global _DcsmRegsZ1
    4068                      .global _DcsmRegsZ2
    4069              
    4070              ;***************************************************************
    4071              ;* TYPE INFORMATION                                            *
    4072              ;***************************************************************
    4073              
    4074              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4075                      .dwattr $C$DW$T$19, DW_AT_name("DCSM_REGS_COMMON")
    4076                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    4077              $C$DW$71        .dwtag  DW_TAG_member
    4078                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$26)
    4079                      .dwattr $C$DW$71, DW_AT_name("FLSEM")
    4080                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_FLSEM")
    4081                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4082                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    4083              $C$DW$72        .dwtag  DW_TAG_member
    4084                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$32)
    4085                      .dwattr $C$DW$72, DW_AT_name("SECTSTAT")
    4086                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_SECTSTAT")
    4087                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4088                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    4089              $C$DW$73        .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$28)
    4091                      .dwattr $C$DW$73, DW_AT_name("RAMSTAT")
    4092                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_RAMSTAT")
    4093                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4094                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    4095              $C$DW$74        .dwtag  DW_TAG_member
    4096                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$30)
    4097                      .dwattr $C$DW$74, DW_AT_name("SECDC")
    4098                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_SECDC")
    4099                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4100                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    4101                      .dwendtag $C$DW$T$19
    4102              
    4103              $C$DW$75        .dwtag  DW_TAG_TI_far_type
    4104                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   89

    4105              $C$DW$T$73      .dwtag  DW_TAG_volatile_type
    4106                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$75)
    4107              
    4108              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4109                      .dwattr $C$DW$T$23, DW_AT_name("DCSM_REGS_Z1")
    4110                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x24)
    4111              $C$DW$76        .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$50)
    4113                      .dwattr $C$DW$76, DW_AT_name("Z1_LINKPOINTER")
    4114                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Z1_LINKPOINTER")
    4115                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4116                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$77        .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$52)
    4119                      .dwattr $C$DW$77, DW_AT_name("Z1_OTPSECLOCK")
    4120                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Z1_OTPSECLOCK")
    4121                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4122                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$78        .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$34)
    4125                      .dwattr $C$DW$78, DW_AT_name("Z1_BOOTCTRL")
    4126                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Z1_BOOTCTRL")
    4127                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4128                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$79        .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    4131                      .dwattr $C$DW$79, DW_AT_name("Z1_LINKPOINTERERR")
    4132                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_Z1_LINKPOINTERERR")
    4133                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4134                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$80        .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$22)
    4137                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
    4138                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
    4139                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4140                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$81        .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    4143                      .dwattr $C$DW$81, DW_AT_name("Z1_CSMKEY0")
    4144                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Z1_CSMKEY0")
    4145                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4146                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$82        .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    4149                      .dwattr $C$DW$82, DW_AT_name("Z1_CSMKEY1")
    4150                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Z1_CSMKEY1")
    4151                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4152                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$83        .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    4155                      .dwattr $C$DW$83, DW_AT_name("Z1_CSMKEY2")
    4156                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Z1_CSMKEY2")
    4157                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4158                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$84        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   90

    4160                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
    4161                      .dwattr $C$DW$84, DW_AT_name("Z1_CSMKEY3")
    4162                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Z1_CSMKEY3")
    4163                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4164                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$85        .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$38)
    4167                      .dwattr $C$DW$85, DW_AT_name("Z1_CSMLOCKSR")
    4168                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Z1_CSMLOCKSR")
    4169                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4170                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$86        .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$36)
    4173                      .dwattr $C$DW$86, DW_AT_name("Z1_CR")
    4174                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Z1_CR")
    4175                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4176                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$87        .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$48)
    4179                      .dwattr $C$DW$87, DW_AT_name("Z1_GRABSECTR")
    4180                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Z1_GRABSECTR")
    4181                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4182                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$88        .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$46)
    4185                      .dwattr $C$DW$88, DW_AT_name("Z1_GRABRAMR")
    4186                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_Z1_GRABRAMR")
    4187                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4188                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    4189              $C$DW$89        .dwtag  DW_TAG_member
    4190                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$44)
    4191                      .dwattr $C$DW$89, DW_AT_name("Z1_EXEONLYSECTR")
    4192                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Z1_EXEONLYSECTR")
    4193                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4194                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    4195              $C$DW$90        .dwtag  DW_TAG_member
    4196                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$42)
    4197                      .dwattr $C$DW$90, DW_AT_name("Z1_EXEONLYRAMR")
    4198                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Z1_EXEONLYRAMR")
    4199                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4200                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    4201              $C$DW$91        .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$40)
    4203                      .dwattr $C$DW$91, DW_AT_name("Z1_EXEONLYDIS")
    4204                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_Z1_EXEONLYDIS")
    4205                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4206                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    4207                      .dwendtag $C$DW$T$23
    4208              
    4209              $C$DW$92        .dwtag  DW_TAG_TI_far_type
    4210                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$23)
    4211              $C$DW$T$74      .dwtag  DW_TAG_volatile_type
    4212                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$92)
    4213              
    4214              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   91

    4215                      .dwattr $C$DW$T$24, DW_AT_name("DCSM_REGS_Z2")
    4216                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x24)
    4217              $C$DW$93        .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$70)
    4219                      .dwattr $C$DW$93, DW_AT_name("Z2_LINKPOINTER")
    4220                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Z2_LINKPOINTER")
    4221                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4222                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    4223              $C$DW$94        .dwtag  DW_TAG_member
    4224                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$72)
    4225                      .dwattr $C$DW$94, DW_AT_name("Z2_OTPSECLOCK")
    4226                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Z2_OTPSECLOCK")
    4227                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4228                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    4229              $C$DW$95        .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$54)
    4231                      .dwattr $C$DW$95, DW_AT_name("Z2_BOOTCTRL")
    4232                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Z2_BOOTCTRL")
    4233                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4234                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    4235              $C$DW$96        .dwtag  DW_TAG_member
    4236                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    4237                      .dwattr $C$DW$96, DW_AT_name("Z2_LINKPOINTERERR")
    4238                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_Z2_LINKPOINTERERR")
    4239                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4240                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    4241              $C$DW$97        .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$22)
    4243                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    4244                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    4245                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4246                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    4247              $C$DW$98        .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    4249                      .dwattr $C$DW$98, DW_AT_name("Z2_CSMKEY0")
    4250                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Z2_CSMKEY0")
    4251                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4252                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    4253              $C$DW$99        .dwtag  DW_TAG_member
    4254                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    4255                      .dwattr $C$DW$99, DW_AT_name("Z2_CSMKEY1")
    4256                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Z2_CSMKEY1")
    4257                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4258                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    4259              $C$DW$100       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    4261                      .dwattr $C$DW$100, DW_AT_name("Z2_CSMKEY2")
    4262                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Z2_CSMKEY2")
    4263                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4264                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    4265              $C$DW$101       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
    4267                      .dwattr $C$DW$101, DW_AT_name("Z2_CSMKEY3")
    4268                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Z2_CSMKEY3")
    4269                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   92

    4270                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    4271              $C$DW$102       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$58)
    4273                      .dwattr $C$DW$102, DW_AT_name("Z2_CSMLOCKSR")
    4274                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Z2_CSMLOCKSR")
    4275                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4276                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    4277              $C$DW$103       .dwtag  DW_TAG_member
    4278                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$56)
    4279                      .dwattr $C$DW$103, DW_AT_name("Z2_CR")
    4280                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Z2_CR")
    4281                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4282                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    4283              $C$DW$104       .dwtag  DW_TAG_member
    4284                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$68)
    4285                      .dwattr $C$DW$104, DW_AT_name("Z2_GRABSECTR")
    4286                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Z2_GRABSECTR")
    4287                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4288                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    4289              $C$DW$105       .dwtag  DW_TAG_member
    4290                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$66)
    4291                      .dwattr $C$DW$105, DW_AT_name("Z2_GRABRAMR")
    4292                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Z2_GRABRAMR")
    4293                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4294                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    4295              $C$DW$106       .dwtag  DW_TAG_member
    4296                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$64)
    4297                      .dwattr $C$DW$106, DW_AT_name("Z2_EXEONLYSECTR")
    4298                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Z2_EXEONLYSECTR")
    4299                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4300                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    4301              $C$DW$107       .dwtag  DW_TAG_member
    4302                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$62)
    4303                      .dwattr $C$DW$107, DW_AT_name("Z2_EXEONLYRAMR")
    4304                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Z2_EXEONLYRAMR")
    4305                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4306                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    4307              $C$DW$108       .dwtag  DW_TAG_member
    4308                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$60)
    4309                      .dwattr $C$DW$108, DW_AT_name("Z2_EXEONLYDIS")
    4310                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_Z2_EXEONLYDIS")
    4311                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4312                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    4313                      .dwendtag $C$DW$T$24
    4314              
    4315              $C$DW$109       .dwtag  DW_TAG_TI_far_type
    4316                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$24)
    4317              $C$DW$T$75      .dwtag  DW_TAG_volatile_type
    4318                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$109)
    4319              
    4320              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4321                      .dwattr $C$DW$T$25, DW_AT_name("FLSEM_BITS")
    4322                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    4323              $C$DW$110       .dwtag  DW_TAG_member
    4324                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   93

    4325                      .dwattr $C$DW$110, DW_AT_name("SEM")
    4326                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_SEM")
    4327                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    4328                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4329                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    4330              $C$DW$111       .dwtag  DW_TAG_member
    4331                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    4332                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    4333                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    4334                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    4335                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4336                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    4337              $C$DW$112       .dwtag  DW_TAG_member
    4338                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    4339                      .dwattr $C$DW$112, DW_AT_name("KEY")
    4340                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_KEY")
    4341                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4342                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4343                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    4344              $C$DW$113       .dwtag  DW_TAG_member
    4345                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
    4346                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    4347                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    4348                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    4349                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4350                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    4351                      .dwendtag $C$DW$T$25
    4352              
    4353              
    4354              $C$DW$T$26      .dwtag  DW_TAG_union_type
    4355                      .dwattr $C$DW$T$26, DW_AT_name("FLSEM_REG")
    4356                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    4357              $C$DW$114       .dwtag  DW_TAG_member
    4358                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    4359                      .dwattr $C$DW$114, DW_AT_name("all")
    4360                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_all")
    4361                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4362                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    4363              $C$DW$115       .dwtag  DW_TAG_member
    4364                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$25)
    4365                      .dwattr $C$DW$115, DW_AT_name("bit")
    4366                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_bit")
    4367                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4368                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    4369                      .dwendtag $C$DW$T$26
    4370              
    4371              
    4372              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4373                      .dwattr $C$DW$T$27, DW_AT_name("RAMSTAT_BITS")
    4374                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    4375              $C$DW$116       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    4377                      .dwattr $C$DW$116, DW_AT_name("STATUS_RAM0")
    4378                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_STATUS_RAM0")
    4379                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   94

    4380                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4381                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    4382              $C$DW$117       .dwtag  DW_TAG_member
    4383                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    4384                      .dwattr $C$DW$117, DW_AT_name("STATUS_RAM1")
    4385                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_STATUS_RAM1")
    4386                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    4387                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4388                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$118       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    4391                      .dwattr $C$DW$118, DW_AT_name("STATUS_RAM2")
    4392                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_STATUS_RAM2")
    4393                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    4394                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4395                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    4396              $C$DW$119       .dwtag  DW_TAG_member
    4397                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$21)
    4398                      .dwattr $C$DW$119, DW_AT_name("STATUS_RAM3")
    4399                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_STATUS_RAM3")
    4400                      .dwattr $C$DW$119, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4401                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4402                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    4403              $C$DW$120       .dwtag  DW_TAG_member
    4404                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    4405                      .dwattr $C$DW$120, DW_AT_name("STATUS_RAM4")
    4406                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_STATUS_RAM4")
    4407                      .dwattr $C$DW$120, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    4408                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4409                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$121       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    4412                      .dwattr $C$DW$121, DW_AT_name("STATUS_RAM5")
    4413                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_STATUS_RAM5")
    4414                      .dwattr $C$DW$121, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    4415                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4416                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    4417              $C$DW$122       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    4419                      .dwattr $C$DW$122, DW_AT_name("STATUS_RAM6")
    4420                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_STATUS_RAM6")
    4421                      .dwattr $C$DW$122, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4422                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4423                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    4424              $C$DW$123       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    4426                      .dwattr $C$DW$123, DW_AT_name("STATUS_RAM7")
    4427                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_STATUS_RAM7")
    4428                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4429                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4430                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$124       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    4433                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    4434                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   95

    4435                      .dwattr $C$DW$124, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    4436                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4437                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    4438              $C$DW$125       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    4440                      .dwattr $C$DW$125, DW_AT_name("STATUS_CLA1")
    4441                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_STATUS_CLA1")
    4442                      .dwattr $C$DW$125, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4443                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4444                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    4445              $C$DW$126       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
    4447                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    4448                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    4449                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4450                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4451                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    4452                      .dwendtag $C$DW$T$27
    4453              
    4454              
    4455              $C$DW$T$28      .dwtag  DW_TAG_union_type
    4456                      .dwattr $C$DW$T$28, DW_AT_name("RAMSTAT_REG")
    4457                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    4458              $C$DW$127       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    4460                      .dwattr $C$DW$127, DW_AT_name("all")
    4461                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    4462                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4463                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    4464              $C$DW$128       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
    4466                      .dwattr $C$DW$128, DW_AT_name("bit")
    4467                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    4468                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4469                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    4470                      .dwendtag $C$DW$T$28
    4471              
    4472              
    4473              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4474                      .dwattr $C$DW$T$29, DW_AT_name("SECDC_BITS")
    4475                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4476              $C$DW$129       .dwtag  DW_TAG_member
    4477                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    4478                      .dwattr $C$DW$129, DW_AT_name("CPUSLDIS")
    4479                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CPUSLDIS")
    4480                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4481                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4482                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    4483              $C$DW$130       .dwtag  DW_TAG_member
    4484                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    4485                      .dwattr $C$DW$130, DW_AT_name("ECSLDIS")
    4486                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ECSLDIS")
    4487                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4488                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4489                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   96

    4490              $C$DW$131       .dwtag  DW_TAG_member
    4491                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
    4492                      .dwattr $C$DW$131, DW_AT_name("FASTSPINEN")
    4493                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_FASTSPINEN")
    4494                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x04)
    4495                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4496                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    4497              $C$DW$132       .dwtag  DW_TAG_member
    4498                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
    4499                      .dwattr $C$DW$132, DW_AT_name("BANK2MAP")
    4500                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_BANK2MAP")
    4501                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x04)
    4502                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4503                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    4504              $C$DW$133       .dwtag  DW_TAG_member
    4505                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    4506                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    4507                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    4508                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    4509                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4510                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    4511                      .dwendtag $C$DW$T$29
    4512              
    4513              
    4514              $C$DW$T$30      .dwtag  DW_TAG_union_type
    4515                      .dwattr $C$DW$T$30, DW_AT_name("SECDC_REG")
    4516                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    4517              $C$DW$134       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    4519                      .dwattr $C$DW$134, DW_AT_name("all")
    4520                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    4521                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4522                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    4523              $C$DW$135       .dwtag  DW_TAG_member
    4524                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$29)
    4525                      .dwattr $C$DW$135, DW_AT_name("bit")
    4526                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    4527                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4528                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    4529                      .dwendtag $C$DW$T$30
    4530              
    4531              
    4532              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4533                      .dwattr $C$DW$T$31, DW_AT_name("SECTSTAT_BITS")
    4534                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    4535              $C$DW$136       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    4537                      .dwattr $C$DW$136, DW_AT_name("STATUS_SECTA")
    4538                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_STATUS_SECTA")
    4539                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    4540                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4541                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    4542              $C$DW$137       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    4544                      .dwattr $C$DW$137, DW_AT_name("STATUS_SECTB")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   97

    4545                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_STATUS_SECTB")
    4546                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    4547                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4548                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    4549              $C$DW$138       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    4551                      .dwattr $C$DW$138, DW_AT_name("STATUS_SECTC")
    4552                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_STATUS_SECTC")
    4553                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    4554                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4555                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    4556              $C$DW$139       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    4558                      .dwattr $C$DW$139, DW_AT_name("STATUS_SECTD")
    4559                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_STATUS_SECTD")
    4560                      .dwattr $C$DW$139, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4561                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4562                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    4563              $C$DW$140       .dwtag  DW_TAG_member
    4564                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    4565                      .dwattr $C$DW$140, DW_AT_name("STATUS_SECTE")
    4566                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_STATUS_SECTE")
    4567                      .dwattr $C$DW$140, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    4568                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4569                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    4570              $C$DW$141       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    4572                      .dwattr $C$DW$141, DW_AT_name("STATUS_SECTF")
    4573                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_STATUS_SECTF")
    4574                      .dwattr $C$DW$141, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    4575                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4576                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    4577              $C$DW$142       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    4579                      .dwattr $C$DW$142, DW_AT_name("STATUS_SECTG")
    4580                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_STATUS_SECTG")
    4581                      .dwattr $C$DW$142, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4582                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4583                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    4584              $C$DW$143       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    4586                      .dwattr $C$DW$143, DW_AT_name("STATUS_SECTH")
    4587                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_STATUS_SECTH")
    4588                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4589                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4590                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    4591              $C$DW$144       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    4593                      .dwattr $C$DW$144, DW_AT_name("STATUS_SECTI")
    4594                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_STATUS_SECTI")
    4595                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    4596                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4597                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$145       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   98

    4600                      .dwattr $C$DW$145, DW_AT_name("STATUS_SECTJ")
    4601                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_STATUS_SECTJ")
    4602                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    4603                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4604                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    4605              $C$DW$146       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    4607                      .dwattr $C$DW$146, DW_AT_name("STATUS_SECTK")
    4608                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_STATUS_SECTK")
    4609                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    4610                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4611                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    4612              $C$DW$147       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    4614                      .dwattr $C$DW$147, DW_AT_name("STATUS_SECTL")
    4615                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_STATUS_SECTL")
    4616                      .dwattr $C$DW$147, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4617                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4618                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$148       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    4621                      .dwattr $C$DW$148, DW_AT_name("STATUS_SECTM")
    4622                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_STATUS_SECTM")
    4623                      .dwattr $C$DW$148, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    4624                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4625                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    4626              $C$DW$149       .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    4628                      .dwattr $C$DW$149, DW_AT_name("STATUS_SECTN")
    4629                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_STATUS_SECTN")
    4630                      .dwattr $C$DW$149, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    4631                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4632                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    4633              $C$DW$150       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    4635                      .dwattr $C$DW$150, DW_AT_name("STATUS_BANK2")
    4636                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_STATUS_BANK2")
    4637                      .dwattr $C$DW$150, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4638                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4639                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    4640              $C$DW$151       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    4642                      .dwattr $C$DW$151, DW_AT_name("rsvd1")
    4643                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd1")
    4644                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4645                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4646                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4647                      .dwendtag $C$DW$T$31
    4648              
    4649              
    4650              $C$DW$T$32      .dwtag  DW_TAG_union_type
    4651                      .dwattr $C$DW$T$32, DW_AT_name("SECTSTAT_REG")
    4652                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    4653              $C$DW$152       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE   99

    4655                      .dwattr $C$DW$152, DW_AT_name("all")
    4656                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_all")
    4657                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4658                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4659              $C$DW$153       .dwtag  DW_TAG_member
    4660                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    4661                      .dwattr $C$DW$153, DW_AT_name("bit")
    4662                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_bit")
    4663                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4664                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4665                      .dwendtag $C$DW$T$32
    4666              
    4667              
    4668              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4669                      .dwattr $C$DW$T$33, DW_AT_name("Z1_BOOTCTRL_BITS")
    4670                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    4671              $C$DW$154       .dwtag  DW_TAG_member
    4672                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    4673                      .dwattr $C$DW$154, DW_AT_name("KEY")
    4674                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_KEY")
    4675                      .dwattr $C$DW$154, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4676                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4677                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    4678              $C$DW$155       .dwtag  DW_TAG_member
    4679                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    4680                      .dwattr $C$DW$155, DW_AT_name("BMODE")
    4681                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_BMODE")
    4682                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4683                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4684                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4685              $C$DW$156       .dwtag  DW_TAG_member
    4686                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    4687                      .dwattr $C$DW$156, DW_AT_name("BOOTPIN0")
    4688                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_BOOTPIN0")
    4689                      .dwattr $C$DW$156, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4690                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4691                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4692              $C$DW$157       .dwtag  DW_TAG_member
    4693                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    4694                      .dwattr $C$DW$157, DW_AT_name("BOOTPIN1")
    4695                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_BOOTPIN1")
    4696                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4697                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4698                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4699                      .dwendtag $C$DW$T$33
    4700              
    4701              
    4702              $C$DW$T$34      .dwtag  DW_TAG_union_type
    4703                      .dwattr $C$DW$T$34, DW_AT_name("Z1_BOOTCTRL_REG")
    4704                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    4705              $C$DW$158       .dwtag  DW_TAG_member
    4706                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    4707                      .dwattr $C$DW$158, DW_AT_name("all")
    4708                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    4709                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  100

    4710                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4711              $C$DW$159       .dwtag  DW_TAG_member
    4712                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$33)
    4713                      .dwattr $C$DW$159, DW_AT_name("bit")
    4714                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    4715                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4716                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4717                      .dwendtag $C$DW$T$34
    4718              
    4719              
    4720              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4721                      .dwattr $C$DW$T$35, DW_AT_name("Z1_CR_BITS")
    4722                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    4723              $C$DW$160       .dwtag  DW_TAG_member
    4724                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    4725                      .dwattr $C$DW$160, DW_AT_name("rsvd1")
    4726                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd1")
    4727                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    4728                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4729                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4730              $C$DW$161       .dwtag  DW_TAG_member
    4731                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    4732                      .dwattr $C$DW$161, DW_AT_name("ALLZERO")
    4733                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ALLZERO")
    4734                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4735                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4736                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4737              $C$DW$162       .dwtag  DW_TAG_member
    4738                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    4739                      .dwattr $C$DW$162, DW_AT_name("ALLONE")
    4740                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ALLONE")
    4741                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4742                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4743                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4744              $C$DW$163       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    4746                      .dwattr $C$DW$163, DW_AT_name("UNSECURE")
    4747                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_UNSECURE")
    4748                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4749                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4750                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$164       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    4753                      .dwattr $C$DW$164, DW_AT_name("ARMED")
    4754                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ARMED")
    4755                      .dwattr $C$DW$164, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4756                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4757                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4758              $C$DW$165       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    4760                      .dwattr $C$DW$165, DW_AT_name("USBD_OPEN")
    4761                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_USBD_OPEN")
    4762                      .dwattr $C$DW$165, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4763                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4764                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  101

    4765              $C$DW$166       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    4767                      .dwattr $C$DW$166, DW_AT_name("rsvd2")
    4768                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd2")
    4769                      .dwattr $C$DW$166, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    4770                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4771                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4772              $C$DW$167       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    4774                      .dwattr $C$DW$167, DW_AT_name("FORCESEC")
    4775                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_FORCESEC")
    4776                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4777                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4778                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4779                      .dwendtag $C$DW$T$35
    4780              
    4781              
    4782              $C$DW$T$36      .dwtag  DW_TAG_union_type
    4783                      .dwattr $C$DW$T$36, DW_AT_name("Z1_CR_REG")
    4784                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4785              $C$DW$168       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    4787                      .dwattr $C$DW$168, DW_AT_name("all")
    4788                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    4789                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4790                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4791              $C$DW$169       .dwtag  DW_TAG_member
    4792                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$35)
    4793                      .dwattr $C$DW$169, DW_AT_name("bit")
    4794                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    4795                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4796                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4797                      .dwendtag $C$DW$T$36
    4798              
    4799              
    4800              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4801                      .dwattr $C$DW$T$37, DW_AT_name("Z1_CSMLOCKSR_BITS")
    4802                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4803              $C$DW$170       .dwtag  DW_TAG_member
    4804                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    4805                      .dwattr $C$DW$170, DW_AT_name("LOCK0")
    4806                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_LOCK0")
    4807                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4808                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4809                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4810              $C$DW$171       .dwtag  DW_TAG_member
    4811                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    4812                      .dwattr $C$DW$171, DW_AT_name("LOCK1")
    4813                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_LOCK1")
    4814                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4815                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4816                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4817              $C$DW$172       .dwtag  DW_TAG_member
    4818                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$21)
    4819                      .dwattr $C$DW$172, DW_AT_name("LOCK2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  102

    4820                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_LOCK2")
    4821                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4822                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4823                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4824              $C$DW$173       .dwtag  DW_TAG_member
    4825                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    4826                      .dwattr $C$DW$173, DW_AT_name("LOCK3")
    4827                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_LOCK3")
    4828                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4829                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4830                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4831              $C$DW$174       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    4833                      .dwattr $C$DW$174, DW_AT_name("rsvd1")
    4834                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd1")
    4835                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    4836                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4837                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4838                      .dwendtag $C$DW$T$37
    4839              
    4840              
    4841              $C$DW$T$38      .dwtag  DW_TAG_union_type
    4842                      .dwattr $C$DW$T$38, DW_AT_name("Z1_CSMLOCKSR_REG")
    4843                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    4844              $C$DW$175       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    4846                      .dwattr $C$DW$175, DW_AT_name("all")
    4847                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    4848                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4849                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4850              $C$DW$176       .dwtag  DW_TAG_member
    4851                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$37)
    4852                      .dwattr $C$DW$176, DW_AT_name("bit")
    4853                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    4854                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4855                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4856                      .dwendtag $C$DW$T$38
    4857              
    4858              
    4859              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4860                      .dwattr $C$DW$T$39, DW_AT_name("Z1_EXEONLYDIS_BITS")
    4861                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4862              $C$DW$177       .dwtag  DW_TAG_member
    4863                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    4864                      .dwattr $C$DW$177, DW_AT_name("DIS")
    4865                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_DIS")
    4866                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4867                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4868                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4869              $C$DW$178       .dwtag  DW_TAG_member
    4870                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    4871                      .dwattr $C$DW$178, DW_AT_name("rsvd1")
    4872                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd1")
    4873                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    4874                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  103

    4875                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    4876                      .dwendtag $C$DW$T$39
    4877              
    4878              
    4879              $C$DW$T$40      .dwtag  DW_TAG_union_type
    4880                      .dwattr $C$DW$T$40, DW_AT_name("Z1_EXEONLYDIS_REG")
    4881                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    4882              $C$DW$179       .dwtag  DW_TAG_member
    4883                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    4884                      .dwattr $C$DW$179, DW_AT_name("all")
    4885                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    4886                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4887                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    4888              $C$DW$180       .dwtag  DW_TAG_member
    4889                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$39)
    4890                      .dwattr $C$DW$180, DW_AT_name("bit")
    4891                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    4892                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4893                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    4894                      .dwendtag $C$DW$T$40
    4895              
    4896              
    4897              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4898                      .dwattr $C$DW$T$41, DW_AT_name("Z1_EXEONLYRAMR_BITS")
    4899                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    4900              $C$DW$181       .dwtag  DW_TAG_member
    4901                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    4902                      .dwattr $C$DW$181, DW_AT_name("EXEONLY_RAM0")
    4903                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_EXEONLY_RAM0")
    4904                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4905                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4906                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    4907              $C$DW$182       .dwtag  DW_TAG_member
    4908                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    4909                      .dwattr $C$DW$182, DW_AT_name("EXEONLY_RAM1")
    4910                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_EXEONLY_RAM1")
    4911                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4912                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4913                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    4914              $C$DW$183       .dwtag  DW_TAG_member
    4915                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    4916                      .dwattr $C$DW$183, DW_AT_name("EXEONLY_RAM2")
    4917                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_EXEONLY_RAM2")
    4918                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4919                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4920                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    4921              $C$DW$184       .dwtag  DW_TAG_member
    4922                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    4923                      .dwattr $C$DW$184, DW_AT_name("EXEONLY_RAM3")
    4924                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_EXEONLY_RAM3")
    4925                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4926                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4927                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4928              $C$DW$185       .dwtag  DW_TAG_member
    4929                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  104

    4930                      .dwattr $C$DW$185, DW_AT_name("EXEONLY_RAM4")
    4931                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_EXEONLY_RAM4")
    4932                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4933                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4934                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    4935              $C$DW$186       .dwtag  DW_TAG_member
    4936                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    4937                      .dwattr $C$DW$186, DW_AT_name("EXEONLY_RAM5")
    4938                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_EXEONLY_RAM5")
    4939                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4940                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4941                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4942              $C$DW$187       .dwtag  DW_TAG_member
    4943                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    4944                      .dwattr $C$DW$187, DW_AT_name("EXEONLY_RAM6")
    4945                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_EXEONLY_RAM6")
    4946                      .dwattr $C$DW$187, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4947                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4948                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4949              $C$DW$188       .dwtag  DW_TAG_member
    4950                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    4951                      .dwattr $C$DW$188, DW_AT_name("EXEONLY_RAM7")
    4952                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_EXEONLY_RAM7")
    4953                      .dwattr $C$DW$188, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4954                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4955                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4956              $C$DW$189       .dwtag  DW_TAG_member
    4957                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    4958                      .dwattr $C$DW$189, DW_AT_name("rsvd1")
    4959                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd1")
    4960                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4961                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4962                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4963              $C$DW$190       .dwtag  DW_TAG_member
    4964                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    4965                      .dwattr $C$DW$190, DW_AT_name("rsvd2")
    4966                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd2")
    4967                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    4968                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4969                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4970                      .dwendtag $C$DW$T$41
    4971              
    4972              
    4973              $C$DW$T$42      .dwtag  DW_TAG_union_type
    4974                      .dwattr $C$DW$T$42, DW_AT_name("Z1_EXEONLYRAMR_REG")
    4975                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    4976              $C$DW$191       .dwtag  DW_TAG_member
    4977                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$20)
    4978                      .dwattr $C$DW$191, DW_AT_name("all")
    4979                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    4980                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4981                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    4982              $C$DW$192       .dwtag  DW_TAG_member
    4983                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$41)
    4984                      .dwattr $C$DW$192, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  105

    4985                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    4986                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4987                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    4988                      .dwendtag $C$DW$T$42
    4989              
    4990              
    4991              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4992                      .dwattr $C$DW$T$43, DW_AT_name("Z1_EXEONLYSECTR_BITS")
    4993                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    4994              $C$DW$193       .dwtag  DW_TAG_member
    4995                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$21)
    4996                      .dwattr $C$DW$193, DW_AT_name("EXEONLY_SECTA")
    4997                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_EXEONLY_SECTA")
    4998                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4999                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5000                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    5001              $C$DW$194       .dwtag  DW_TAG_member
    5002                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    5003                      .dwattr $C$DW$194, DW_AT_name("EXEONLY_SECTB")
    5004                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_EXEONLY_SECTB")
    5005                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    5006                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5007                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    5008              $C$DW$195       .dwtag  DW_TAG_member
    5009                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    5010                      .dwattr $C$DW$195, DW_AT_name("EXEONLY_SECTC")
    5011                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_EXEONLY_SECTC")
    5012                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    5013                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5014                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    5015              $C$DW$196       .dwtag  DW_TAG_member
    5016                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    5017                      .dwattr $C$DW$196, DW_AT_name("EXEONLY_SECTD")
    5018                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_EXEONLY_SECTD")
    5019                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5020                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5021                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    5022              $C$DW$197       .dwtag  DW_TAG_member
    5023                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    5024                      .dwattr $C$DW$197, DW_AT_name("EXEONLY_SECTE")
    5025                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_EXEONLY_SECTE")
    5026                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5027                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5028                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    5029              $C$DW$198       .dwtag  DW_TAG_member
    5030                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    5031                      .dwattr $C$DW$198, DW_AT_name("EXEONLY_SECTF")
    5032                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_EXEONLY_SECTF")
    5033                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5034                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5035                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    5036              $C$DW$199       .dwtag  DW_TAG_member
    5037                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    5038                      .dwattr $C$DW$199, DW_AT_name("EXEONLY_SECTG")
    5039                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_EXEONLY_SECTG")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  106

    5040                      .dwattr $C$DW$199, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5041                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5042                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    5043              $C$DW$200       .dwtag  DW_TAG_member
    5044                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    5045                      .dwattr $C$DW$200, DW_AT_name("EXEONLY_SECTH")
    5046                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EXEONLY_SECTH")
    5047                      .dwattr $C$DW$200, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5048                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5049                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    5050              $C$DW$201       .dwtag  DW_TAG_member
    5051                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    5052                      .dwattr $C$DW$201, DW_AT_name("EXEONLY_SECTI")
    5053                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_EXEONLY_SECTI")
    5054                      .dwattr $C$DW$201, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5055                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5056                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    5057              $C$DW$202       .dwtag  DW_TAG_member
    5058                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    5059                      .dwattr $C$DW$202, DW_AT_name("EXEONLY_SECTJ")
    5060                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_EXEONLY_SECTJ")
    5061                      .dwattr $C$DW$202, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5062                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5063                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    5064              $C$DW$203       .dwtag  DW_TAG_member
    5065                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    5066                      .dwattr $C$DW$203, DW_AT_name("EXEONLY_SECTK")
    5067                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_EXEONLY_SECTK")
    5068                      .dwattr $C$DW$203, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5069                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5070                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    5071              $C$DW$204       .dwtag  DW_TAG_member
    5072                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$21)
    5073                      .dwattr $C$DW$204, DW_AT_name("EXEONLY_SECTL")
    5074                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_EXEONLY_SECTL")
    5075                      .dwattr $C$DW$204, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5076                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5077                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    5078              $C$DW$205       .dwtag  DW_TAG_member
    5079                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    5080                      .dwattr $C$DW$205, DW_AT_name("EXEONLY_SECTM")
    5081                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_EXEONLY_SECTM")
    5082                      .dwattr $C$DW$205, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5083                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5084                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    5085              $C$DW$206       .dwtag  DW_TAG_member
    5086                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    5087                      .dwattr $C$DW$206, DW_AT_name("EXEONLY_SECTN")
    5088                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_EXEONLY_SECTN")
    5089                      .dwattr $C$DW$206, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5090                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5091                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    5092              $C$DW$207       .dwtag  DW_TAG_member
    5093                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    5094                      .dwattr $C$DW$207, DW_AT_name("EXEONLY_BANK2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  107

    5095                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_EXEONLY_BANK2")
    5096                      .dwattr $C$DW$207, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5097                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5098                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    5099              $C$DW$208       .dwtag  DW_TAG_member
    5100                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    5101                      .dwattr $C$DW$208, DW_AT_name("rsvd1")
    5102                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd1")
    5103                      .dwattr $C$DW$208, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5104                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5105                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    5106              $C$DW$209       .dwtag  DW_TAG_member
    5107                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    5108                      .dwattr $C$DW$209, DW_AT_name("rsvd2")
    5109                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_rsvd2")
    5110                      .dwattr $C$DW$209, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    5111                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5112                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    5113                      .dwendtag $C$DW$T$43
    5114              
    5115              
    5116              $C$DW$T$44      .dwtag  DW_TAG_union_type
    5117                      .dwattr $C$DW$T$44, DW_AT_name("Z1_EXEONLYSECTR_REG")
    5118                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    5119              $C$DW$210       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    5121                      .dwattr $C$DW$210, DW_AT_name("all")
    5122                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_all")
    5123                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5124                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    5125              $C$DW$211       .dwtag  DW_TAG_member
    5126                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$43)
    5127                      .dwattr $C$DW$211, DW_AT_name("bit")
    5128                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_bit")
    5129                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5130                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    5131                      .dwendtag $C$DW$T$44
    5132              
    5133              
    5134              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5135                      .dwattr $C$DW$T$45, DW_AT_name("Z1_GRABRAMR_BITS")
    5136                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    5137              $C$DW$212       .dwtag  DW_TAG_member
    5138                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$21)
    5139                      .dwattr $C$DW$212, DW_AT_name("GRAB_RAM0")
    5140                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GRAB_RAM0")
    5141                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    5142                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5143                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    5144              $C$DW$213       .dwtag  DW_TAG_member
    5145                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    5146                      .dwattr $C$DW$213, DW_AT_name("GRAB_RAM1")
    5147                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GRAB_RAM1")
    5148                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    5149                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  108

    5150                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    5151              $C$DW$214       .dwtag  DW_TAG_member
    5152                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    5153                      .dwattr $C$DW$214, DW_AT_name("GRAB_RAM2")
    5154                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GRAB_RAM2")
    5155                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    5156                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5157                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    5158              $C$DW$215       .dwtag  DW_TAG_member
    5159                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
    5160                      .dwattr $C$DW$215, DW_AT_name("GRAB_RAM3")
    5161                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GRAB_RAM3")
    5162                      .dwattr $C$DW$215, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    5163                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5164                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    5165              $C$DW$216       .dwtag  DW_TAG_member
    5166                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$21)
    5167                      .dwattr $C$DW$216, DW_AT_name("GRAB_RAM4")
    5168                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GRAB_RAM4")
    5169                      .dwattr $C$DW$216, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    5170                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5171                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    5172              $C$DW$217       .dwtag  DW_TAG_member
    5173                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$21)
    5174                      .dwattr $C$DW$217, DW_AT_name("GRAB_RAM5")
    5175                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GRAB_RAM5")
    5176                      .dwattr $C$DW$217, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    5177                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5178                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    5179              $C$DW$218       .dwtag  DW_TAG_member
    5180                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$21)
    5181                      .dwattr $C$DW$218, DW_AT_name("GRAB_RAM6")
    5182                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GRAB_RAM6")
    5183                      .dwattr $C$DW$218, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    5184                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5185                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    5186              $C$DW$219       .dwtag  DW_TAG_member
    5187                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$21)
    5188                      .dwattr $C$DW$219, DW_AT_name("GRAB_RAM7")
    5189                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_GRAB_RAM7")
    5190                      .dwattr $C$DW$219, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    5191                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5192                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    5193              $C$DW$220       .dwtag  DW_TAG_member
    5194                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    5195                      .dwattr $C$DW$220, DW_AT_name("rsvd1")
    5196                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_rsvd1")
    5197                      .dwattr $C$DW$220, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    5198                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5199                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    5200              $C$DW$221       .dwtag  DW_TAG_member
    5201                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    5202                      .dwattr $C$DW$221, DW_AT_name("GRAB_CLA1")
    5203                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_GRAB_CLA1")
    5204                      .dwattr $C$DW$221, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:34 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0644810                         PAGE  109

    5205                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5206                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    5207              $C$DW$222       .dwtag  DW_TAG_member
    5208                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$21)
    5209                      .dwattr $C$DW$222, DW_AT_name("rsvd2")
    5210                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd2")
    5211                      .dwattr $C$DW$222, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    5212                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5213                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    5214                      .dwendtag $C$DW$T$45
    5215              
    5216              
    5217              $C$DW$T$46      .dwtag  DW_TAG_union_type
    5218                      .dwattr $C$DW$T$46, DW_AT_name("Z1_GRABRAMR_REG")
    5219                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    5220              $C$DW$223       .dwtag  DW_TAG_member
    5221                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$20)
    5222                      .dwattr $C$DW$223, DW_AT_name("all")
    5223                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_all")
    5224                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5225                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    5226              $C$DW$224       .dwtag  DW_TAG_member
    5227                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$45)
    5228                      .dwattr $C$DW$224, DW_AT_name("bit")
    5229                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_bit")
