TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:28 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("NmiIntruptRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_NmiIntruptRegs")

     469 0000005e 9241          MOV       AL,*-SP[1]            ; [CPU_] |138| 
     470              $C$DW$23        .dwtag  DW_TAG_TI_branch
     471                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     472                      .dwattr $C$DW$23, DW_AT_name("_nmi_interrupt_status_get")
     473                      .dwattr $C$DW$23, DW_AT_TI_call
     474 0000005f 7640'         LCR       #_nmi_interrupt_status_get ; [CPU_] |138| 
         00000060 001F 
     475                      ; call occurs [#_nmi_interrupt_status_get] ; [] |138| 
     476 00000061 5200          CMPB      AL,#0                 ; [CPU_] |138| 
     477 00000062 ED03          BF        $C$L11,NEQ            ; [CPU_] |138| 
     478                      ; branchcc occurs ; [] |138| 
     479                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     480 00000063 9A00          MOVB      AL,#0                 ; [CPU_] |139| 
     481 00000064 6F0F          B         $C$L13,UNC            ; [CPU_] |139| 
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   10

     482                      ; branch occurs ; [] |139| 
     483 00000065       $C$L11:    
     484                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     485 00000065 7622   EALLOW
     486                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     487 00000066 9241          MOV       AL,*-SP[1]            ; [CPU_] |143| 
     488 00000067 761F!         MOVW      DP,#_NmiIntruptRegs+2 ; [CPU_U] 
         00000068 0000 
     489 00000069 9802!         OR        @_NmiIntruptRegs+2,AL ; [CPU_] |143| 
     490                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     491 0000006a 761A   EDIS
     492                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     493 0000006b FF69          SPM       #0                    ; [CPU_] 
     494              $C$DW$24        .dwtag  DW_TAG_TI_branch
     495                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     496                      .dwattr $C$DW$24, DW_AT_name("_nmi_interrupt_status_get")
     497                      .dwattr $C$DW$24, DW_AT_TI_call
     498 0000006c 7640'         LCR       #_nmi_interrupt_status_get ; [CPU_] |147| 
         0000006d 001F 
     499                      ; call occurs [#_nmi_interrupt_status_get] ; [] |147| 
     500 0000006e 5200          CMPB      AL,#0                 ; [CPU_] |147| 
     501 0000006f ED03          BF        $C$L12,NEQ            ; [CPU_] |147| 
     502                      ; branchcc occurs ; [] |147| 
     503                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     504 00000070 9A01          MOVB      AL,#1                 ; [CPU_] |148| 
     505 00000071 6F02          B         $C$L13,UNC            ; [CPU_] |148| 
     506                      ; branch occurs ; [] |148| 
     507 00000072       $C$L12:    
     508                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     509 00000072 9A00          MOVB      AL,#0                 ; [CPU_] |151| 
     510 00000073       $C$L13:    
     511                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     512 00000073 FE82          SUBB      SP,#2                 ; [CPU_U] 
     513                      .dwcfi  cfa_offset, -2
     514              $C$DW$25        .dwtag  DW_TAG_TI_branch
     515                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     516                      .dwattr $C$DW$25, DW_AT_TI_return
     517 00000074 0006          LRETR     ; [CPU_] 
     518                      ; return occurs ; [] 
     519                      .dwattr $C$DW$20, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
     520                      .dwattr $C$DW$20, DW_AT_TI_end_line(0x9a)
     521                      .dwattr $C$DW$20, DW_AT_TI_end_column(0x01)
     522                      .dwendentry
     523                      .dwendtag $C$DW$20
     524              
     525              ;**************************************************************
     526              ;* UNDEFINED EXTERNAL REFERENCES                              *
     527              ;**************************************************************
     528                      .global _NmiIntruptRegs
     529              
     530              ;***************************************************************
     531              ;* TYPE INFORMATION                                            *
     532              ;***************************************************************
     533              
     534              $C$DW$T$20      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   11

     535                      .dwattr $C$DW$T$20, DW_AT_name("NMICFG_BITS")
     536                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     537              $C$DW$26        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     539                      .dwattr $C$DW$26, DW_AT_name("NMIE")
     540                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_NMIE")
     541                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     542                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     543                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     544              $C$DW$27        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     546                      .dwattr $C$DW$27, DW_AT_name("rsvd1")
     547                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_rsvd1")
     548                      .dwattr $C$DW$27, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     549                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     550                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     551                      .dwendtag $C$DW$T$20
     552              
     553              
     554              $C$DW$T$21      .dwtag  DW_TAG_union_type
     555                      .dwattr $C$DW$T$21, DW_AT_name("NMICFG_REG")
     556                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     557              $C$DW$28        .dwtag  DW_TAG_member
     558                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     559                      .dwattr $C$DW$28, DW_AT_name("all")
     560                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_all")
     561                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     563              $C$DW$29        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$20)
     565                      .dwattr $C$DW$29, DW_AT_name("bit")
     566                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_bit")
     567                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     569                      .dwendtag $C$DW$T$21
     570              
     571              
     572              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     573                      .dwattr $C$DW$T$22, DW_AT_name("NMIFLGCLR_BITS")
     574                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     575              $C$DW$30        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     577                      .dwattr $C$DW$30, DW_AT_name("NMIINT")
     578                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_NMIINT")
     579                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     580                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     582              $C$DW$31        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$31, DW_AT_name("CLOCKFAIL")
     585                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_CLOCKFAIL")
     586                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     587                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     589              $C$DW$32        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   12

     590                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$32, DW_AT_name("RAMUNCERR")
     592                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_RAMUNCERR")
     593                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     594                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     596              $C$DW$33        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     598                      .dwattr $C$DW$33, DW_AT_name("FLUNCERR")
     599                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_FLUNCERR")
     600                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     601                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     603              $C$DW$34        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     605                      .dwattr $C$DW$34, DW_AT_name("CPU1HWBISTERR")
     606                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_CPU1HWBISTERR")
     607                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     608                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     610              $C$DW$35        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$35, DW_AT_name("CPU2HWBISTERR")
     613                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_CPU2HWBISTERR")
     614                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     615                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     617              $C$DW$36        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$36, DW_AT_name("PIEVECTERR")
     620                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_PIEVECTERR")
     621                      .dwattr $C$DW$36, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     622                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     624              $C$DW$37        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$37, DW_AT_name("SYSDBGNMI")
     627                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_SYSDBGNMI")
     628                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     629                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     631              $C$DW$38        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$38, DW_AT_name("RLNMI")
     634                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_RLNMI")
     635                      .dwattr $C$DW$38, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     636                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$39        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     640                      .dwattr $C$DW$39, DW_AT_name("CPU2WDRSn")
     641                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_CPU2WDRSn")
     642                      .dwattr $C$DW$39, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     643                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   13

     645              $C$DW$40        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$40, DW_AT_name("CPU2NMIWDRSn")
     648                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_CPU2NMIWDRSn")
     649                      .dwattr $C$DW$40, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     650                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     652              $C$DW$41        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$41, DW_AT_name("OVF")
     655                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_OVF")
     656                      .dwattr $C$DW$41, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     657                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     659              $C$DW$42        .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     661                      .dwattr $C$DW$42, DW_AT_name("rsvd1")
     662                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_rsvd1")
     663                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     664                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     666                      .dwendtag $C$DW$T$22
     667              
     668              
     669              $C$DW$T$23      .dwtag  DW_TAG_union_type
     670                      .dwattr $C$DW$T$23, DW_AT_name("NMIFLGCLR_REG")
     671                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     672              $C$DW$43        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     674                      .dwattr $C$DW$43, DW_AT_name("all")
     675                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     676                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     678              $C$DW$44        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$22)
     680                      .dwattr $C$DW$44, DW_AT_name("bit")
     681                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     682                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     684                      .dwendtag $C$DW$T$23
     685              
     686              
     687              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     688                      .dwattr $C$DW$T$24, DW_AT_name("NMIFLGFRC_BITS")
     689                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     690              $C$DW$45        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     692                      .dwattr $C$DW$45, DW_AT_name("rsvd1")
     693                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd1")
     694                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     695                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$46        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     699                      .dwattr $C$DW$46, DW_AT_name("CLOCKFAIL")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   14

     700                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_CLOCKFAIL")
     701                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     702                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$47        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$47, DW_AT_name("RAMUNCERR")
     707                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_RAMUNCERR")
     708                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     709                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     711              $C$DW$48        .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     713                      .dwattr $C$DW$48, DW_AT_name("FLUNCERR")
     714                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_FLUNCERR")
     715                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     716                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     718              $C$DW$49        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$49, DW_AT_name("CPU1HWBISTERR")
     721                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_CPU1HWBISTERR")
     722                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     723                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     724                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     725              $C$DW$50        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     727                      .dwattr $C$DW$50, DW_AT_name("CPU2HWBISTERR")
     728                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_CPU2HWBISTERR")
     729                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     730                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     731                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     732              $C$DW$51        .dwtag  DW_TAG_member
     733                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     734                      .dwattr $C$DW$51, DW_AT_name("PIEVECTERR")
     735                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_PIEVECTERR")
     736                      .dwattr $C$DW$51, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     737                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     739              $C$DW$52        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     741                      .dwattr $C$DW$52, DW_AT_name("SYSDBGNMI")
     742                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_SYSDBGNMI")
     743                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     744                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     746              $C$DW$53        .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     748                      .dwattr $C$DW$53, DW_AT_name("RLNMI")
     749                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_RLNMI")
     750                      .dwattr $C$DW$53, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     751                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     753              $C$DW$54        .dwtag  DW_TAG_member
     754                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   15

     755                      .dwattr $C$DW$54, DW_AT_name("CPU2WDRSn")
     756                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_CPU2WDRSn")
     757                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     758                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     760              $C$DW$55        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     762                      .dwattr $C$DW$55, DW_AT_name("CPU2NMIWDRSn")
     763                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_CPU2NMIWDRSn")
     764                      .dwattr $C$DW$55, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     765                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     767              $C$DW$56        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     769                      .dwattr $C$DW$56, DW_AT_name("OVF")
     770                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_OVF")
     771                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     772                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     773                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     774              $C$DW$57        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$57, DW_AT_name("rsvd2")
     777                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd2")
     778                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     779                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     780                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     781                      .dwendtag $C$DW$T$24
     782              
     783              
     784              $C$DW$T$25      .dwtag  DW_TAG_union_type
     785                      .dwattr $C$DW$T$25, DW_AT_name("NMIFLGFRC_REG")
     786                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     787              $C$DW$58        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$58, DW_AT_name("all")
     790                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     791                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$59        .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$24)
     795                      .dwattr $C$DW$59, DW_AT_name("bit")
     796                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     797                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     799                      .dwendtag $C$DW$T$25
     800              
     801              
     802              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     803                      .dwattr $C$DW$T$26, DW_AT_name("NMIFLG_BITS")
     804                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     805              $C$DW$60        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$60, DW_AT_name("NMIINT")
     808                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_NMIINT")
     809                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   16

     810                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     812              $C$DW$61        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     814                      .dwattr $C$DW$61, DW_AT_name("CLOCKFAIL")
     815                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CLOCKFAIL")
     816                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     817                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     819              $C$DW$62        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$62, DW_AT_name("RAMUNCERR")
     822                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_RAMUNCERR")
     823                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     824                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     826              $C$DW$63        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$63, DW_AT_name("FLUNCERR")
     829                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_FLUNCERR")
     830                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     831                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     833              $C$DW$64        .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$64, DW_AT_name("CPU1HWBISTERR")
     836                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_CPU1HWBISTERR")
     837                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     838                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     840              $C$DW$65        .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$65, DW_AT_name("CPU2HWBISTERR")
     843                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_CPU2HWBISTERR")
     844                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     845                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     846                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$66        .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$66, DW_AT_name("PIEVECTERR")
     850                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PIEVECTERR")
     851                      .dwattr $C$DW$66, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     852                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     854              $C$DW$67        .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     856                      .dwattr $C$DW$67, DW_AT_name("SYSDBGNMI")
     857                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_SYSDBGNMI")
     858                      .dwattr $C$DW$67, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     859                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     861              $C$DW$68        .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$68, DW_AT_name("RLNMI")
     864                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_RLNMI")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   17

     865                      .dwattr $C$DW$68, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     866                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     868              $C$DW$69        .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$69, DW_AT_name("CPU2WDRSn")
     871                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_CPU2WDRSn")
     872                      .dwattr $C$DW$69, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     875              $C$DW$70        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$70, DW_AT_name("CPU2NMIWDRSn")
     878                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CPU2NMIWDRSn")
     879                      .dwattr $C$DW$70, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$71        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$71, DW_AT_name("OVF")
     885                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_OVF")
     886                      .dwattr $C$DW$71, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     887                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$72        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$72, DW_AT_name("rsvd1")
     892                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd1")
     893                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     894                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     896                      .dwendtag $C$DW$T$26
     897              
     898              
     899              $C$DW$T$27      .dwtag  DW_TAG_union_type
     900                      .dwattr $C$DW$T$27, DW_AT_name("NMIFLG_REG")
     901                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     902              $C$DW$73        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$73, DW_AT_name("all")
     905                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
     906                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     908              $C$DW$74        .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$26)
     910                      .dwattr $C$DW$74, DW_AT_name("bit")
     911                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
     912                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     914                      .dwendtag $C$DW$T$27
     915              
     916              
     917              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     918                      .dwattr $C$DW$T$28, DW_AT_name("NMISHDFLG_BITS")
     919                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   18

     920              $C$DW$75        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
     923                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
     924                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     925                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     927              $C$DW$76        .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$76, DW_AT_name("CLOCKFAIL")
     930                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_CLOCKFAIL")
     931                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     932                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     934              $C$DW$77        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$77, DW_AT_name("RAMUNCERR")
     937                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_RAMUNCERR")
     938                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     939                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$78        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$78, DW_AT_name("FLUNCERR")
     944                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_FLUNCERR")
     945                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     946                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$79        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$79, DW_AT_name("CPU1HWBISTERR")
     951                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_CPU1HWBISTERR")
     952                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     953                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$80        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$80, DW_AT_name("CPU2HWBISTERR")
     958                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_CPU2HWBISTERR")
     959                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     960                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$81        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$81, DW_AT_name("PIEVECTERR")
     965                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_PIEVECTERR")
     966                      .dwattr $C$DW$81, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     967                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     969              $C$DW$82        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$82, DW_AT_name("SYSDBGNMI")
     972                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SYSDBGNMI")
     973                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     974                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   19

     975                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     976              $C$DW$83        .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$83, DW_AT_name("RLNMI")
     979                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_RLNMI")
     980                      .dwattr $C$DW$83, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     981                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     983              $C$DW$84        .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$84, DW_AT_name("CPU2WDRSn")
     986                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_CPU2WDRSn")
     987                      .dwattr $C$DW$84, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     988                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     990              $C$DW$85        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$85, DW_AT_name("CPU2NMIWDRSn")
     993                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_CPU2NMIWDRSn")
     994                      .dwattr $C$DW$85, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     995                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$86        .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$86, DW_AT_name("OVF")
    1000                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_OVF")
    1001                      .dwattr $C$DW$86, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1002                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$87        .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$87, DW_AT_name("rsvd2")
    1007                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd2")
    1008                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1009                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1011                      .dwendtag $C$DW$T$28
    1012              
    1013              
    1014              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1015                      .dwattr $C$DW$T$29, DW_AT_name("NMISHDFLG_REG")
    1016                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1017              $C$DW$88        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$88, DW_AT_name("all")
    1020                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1021                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$89        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$28)
    1025                      .dwattr $C$DW$89, DW_AT_name("bit")
    1026                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1027                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1029                      .dwendtag $C$DW$T$29
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   20

    1030              
    1031              
    1032              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1033                      .dwattr $C$DW$T$30, DW_AT_name("NMI_INTRUPT_REGS")
    1034                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x07)
    1035              $C$DW$90        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1037                      .dwattr $C$DW$90, DW_AT_name("NMICFG")
    1038                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_NMICFG")
    1039                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1040                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1041              $C$DW$91        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$27)
    1043                      .dwattr $C$DW$91, DW_AT_name("NMIFLG")
    1044                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_NMIFLG")
    1045                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1046                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1047              $C$DW$92        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$23)
    1049                      .dwattr $C$DW$92, DW_AT_name("NMIFLGCLR")
    1050                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_NMIFLGCLR")
    1051                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1052                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1053              $C$DW$93        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    1055                      .dwattr $C$DW$93, DW_AT_name("NMIFLGFRC")
    1056                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_NMIFLGFRC")
    1057                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1058                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$94        .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$94, DW_AT_name("NMIWDCNT")
    1062                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_NMIWDCNT")
    1063                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1064                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$95        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$95, DW_AT_name("NMIWDPRD")
    1068                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_NMIWDPRD")
    1069                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1070                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$96        .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$29)
    1073                      .dwattr $C$DW$96, DW_AT_name("NMISHDFLG")
    1074                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_NMISHDFLG")
    1075                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1076                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1077                      .dwendtag $C$DW$T$30
    1078              
    1079              $C$DW$97        .dwtag  DW_TAG_TI_far_type
    1080                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$30)
    1081              $C$DW$T$37      .dwtag  DW_TAG_volatile_type
    1082                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$97)
    1083              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1084                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:28 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1108010                         PAGE   21

    1085                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1086                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1087              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1088                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1089                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1090                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1091              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1092                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1093                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1094                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1095              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1096                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1097                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1098                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1099              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1100                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1101                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1102                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1103              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1104                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1105                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1106                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1107              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1108                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$9)
    1109                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1110              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1111                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1112                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1113                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1114              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1115                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1116                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1117                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1118              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1119                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1120                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1121              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1122                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1123                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1124                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1125              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1126                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1127                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
