TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:32:52 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("c2brom_handle_nmi_at_start")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_c2brom_handle_nmi_at_start")

         00000268 0000 
    1555                      ; call occurs [#_sysctl_wdog_disable] ; [] |506| 
    1556                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    1557 00000269 7625   ESTOP0
    1558                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    1559 0000026a       $C$L42:    
    1560 0000026a       $C$DW$L$_c2brom_handle_idle_lpm$2$B:
    1561                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    1562 0000026a 7621   IDLE
    1563                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    1564 0000026b 6FFF          B         $C$L42,UNC            ; [CPU_] |510| 
    1565                      ; branch occurs ; [] |510| 
    1566              $C$DW$L$_c2brom_handle_idle_lpm$2$E:
    1567              
    1568              $C$DW$103       .dwtag  DW_TAG_TI_loop
    1569                      .dwattr $C$DW$103, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0321610:$C$L42:1:1391099573
    1570                      .dwattr $C$DW$103, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bo
    1571                      .dwattr $C$DW$103, DW_AT_TI_begin_line(0x1fe)
    1572                      .dwattr $C$DW$103, DW_AT_TI_end_line(0x201)
    1573              $C$DW$104       .dwtag  DW_TAG_TI_loop_range
    1574                      .dwattr $C$DW$104, DW_AT_low_pc($C$DW$L$_c2brom_handle_idle_lpm$2$B)
    1575                      .dwattr $C$DW$104, DW_AT_high_pc($C$DW$L$_c2brom_handle_idle_lpm$2$E)
    1576                      .dwendtag $C$DW$103
    1577              
    1578                      .dwattr $C$DW$101, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boot
    1579                      .dwattr $C$DW$101, DW_AT_TI_end_line(0x202)
    1580                      .dwattr $C$DW$101, DW_AT_TI_end_column(0x01)
    1581                      .dwendentry
    1582                      .dwendtag $C$DW$101
    1583              
    1584              ;**************************************************************
    1585              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1586              ;**************************************************************
    1587                      .global _c2brom_handle_nmi_at_start
    1588                      .global _c2brom_c1c2_ipc_int1_isr
    1589                      .global _c2brom_handle_nmi
    1590                      .global _c2brom_init_pie_control
    1591                      .global _c2brom_set_c2c1_boot_status
    1592                      .global _c2brom_itrap_isr
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   32

    1593                      .global _c2brom_init_pie_vect_table
    1594                      .global _sysctl_wdog_enable
    1595                      .global _sysctl_wdog_disable
    1596                      .global _SelectBootMode
    1597                      .global _I2C_Boot
    1598                      .global _DCAN_Boot
    1599                      .global _c1c2_branch_addr
    1600                      .global _iTrap_addr
    1601                      .global _SPI_Boot
    1602                      .global _Parallel_Boot
    1603                      .global _SCI_Boot
    1604                      .global _NmiIntruptRegs
    1605                      .global _PieCtrlRegs
    1606                      .global _DcsmRegsZ1
    1607                      .global _DcsmRegsZ2
    1608                      .global _ClkCfgRegs
    1609                      .global _CpuSysRegs
    1610                      .global _FlashCtrlRegs
    1611                      .global _PieVectTable
    1612              
    1613              ;***************************************************************
    1614              ;* TYPE INFORMATION                                            *
    1615              ;***************************************************************
    1616              
    1617              $C$DW$T$253     .dwtag  DW_TAG_enumeration_type
    1618                      .dwattr $C$DW$T$253, DW_AT_byte_size(0x01)
    1619              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
    1620              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
    1621              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
    1622              $C$DW$108       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
    1623                      .dwendtag $C$DW$T$253
    1624              
    1625              $C$DW$T$254     .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
    1626                      .dwattr $C$DW$T$254, DW_AT_type(*$C$DW$T$253)
    1627                      .dwattr $C$DW$T$254, DW_AT_language(DW_LANG_C)
    1628              
    1629              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1630                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
    1631                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1632              $C$DW$109       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$109, DW_AT_name("AUXPLLDIV")
    1635                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_AUXPLLDIV")
    1636                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1637                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$110       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1641                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    1642                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    1643                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1644                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$111       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   33

    1648                      .dwattr $C$DW$111, DW_AT_name("rsvd2")
    1649                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd2")
    1650                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1651                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1652                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1653                      .dwendtag $C$DW$T$20
    1654              
    1655              
    1656              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1657                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
    1658                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1659              $C$DW$112       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    1661                      .dwattr $C$DW$112, DW_AT_name("all")
    1662                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_all")
    1663                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$113       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    1667                      .dwattr $C$DW$113, DW_AT_name("bit")
    1668                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_bit")
    1669                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1671                      .dwendtag $C$DW$T$22
    1672              
    1673              
    1674              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1675                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
    1676                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1677              $C$DW$114       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$114, DW_AT_name("PLLEN")
    1680                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PLLEN")
    1681                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$115       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1686                      .dwattr $C$DW$115, DW_AT_name("PLLCLKEN")
    1687                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PLLCLKEN")
    1688                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1689                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1691              $C$DW$116       .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1693                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1694                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1695                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1696                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1698              $C$DW$117       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$117, DW_AT_name("rsvd2")
    1701                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd2")
    1702                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   34

    1703                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1704                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1705                      .dwendtag $C$DW$T$23
    1706              
    1707              
    1708              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1709                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
    1710                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1711              $C$DW$118       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1713                      .dwattr $C$DW$118, DW_AT_name("all")
    1714                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1715                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1716                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$119       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$23)
    1719                      .dwattr $C$DW$119, DW_AT_name("bit")
    1720                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1721                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1723                      .dwendtag $C$DW$T$24
    1724              
    1725              
    1726              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1727                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
    1728                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1729              $C$DW$120       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1731                      .dwattr $C$DW$120, DW_AT_name("IMULT")
    1732                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_IMULT")
    1733                      .dwattr $C$DW$120, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    1734                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1736              $C$DW$121       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1738                      .dwattr $C$DW$121, DW_AT_name("rsvd1")
    1739                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd1")
    1740                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1741                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$122       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$122, DW_AT_name("FMULT")
    1746                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_FMULT")
    1747                      .dwattr $C$DW$122, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1748                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$123       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$123, DW_AT_name("rsvd2")
    1753                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd2")
    1754                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1755                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$124       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   35

    1758                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$124, DW_AT_name("rsvd3")
    1760                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd3")
    1761                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1762                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1763                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1764                      .dwendtag $C$DW$T$25
    1765              
    1766              
    1767              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1768                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
    1769                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1770              $C$DW$125       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1772                      .dwattr $C$DW$125, DW_AT_name("all")
    1773                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1774                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1776              $C$DW$126       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    1778                      .dwattr $C$DW$126, DW_AT_name("bit")
    1779                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1780                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1782                      .dwendtag $C$DW$T$26
    1783              
    1784              
    1785              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1786                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
    1787                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1788              $C$DW$127       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1790                      .dwattr $C$DW$127, DW_AT_name("LOCKS")
    1791                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_LOCKS")
    1792                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1793                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$128       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1797                      .dwattr $C$DW$128, DW_AT_name("SLIPS")
    1798                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_SLIPS")
    1799                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1800                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1801                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1802              $C$DW$129       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    1805                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    1806                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1807                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$130       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    1812                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   36

    1813                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1814                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1815                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1816                      .dwendtag $C$DW$T$27
    1817              
    1818              
    1819              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1820                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
    1821                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1822              $C$DW$131       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
    1824                      .dwattr $C$DW$131, DW_AT_name("all")
    1825                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1826                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$132       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    1830                      .dwattr $C$DW$132, DW_AT_name("bit")
    1831                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1832                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1833                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1834                      .dwendtag $C$DW$T$28
    1835              
    1836              
    1837              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1838                      .dwattr $C$DW$T$29, DW_AT_name("CCR_BITS")
    1839                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1840              $C$DW$133       .dwtag  DW_TAG_member
    1841                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1842                      .dwattr $C$DW$133, DW_AT_name("VMAPS")
    1843                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_VMAPS")
    1844                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1845                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1846                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1847              $C$DW$134       .dwtag  DW_TAG_member
    1848                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1849                      .dwattr $C$DW$134, DW_AT_name("MONPRIV")
    1850                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_MONPRIV")
    1851                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1852                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1853                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1854              $C$DW$135       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1856                      .dwattr $C$DW$135, DW_AT_name("ENPROT")
    1857                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ENPROT")
    1858                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1859                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$136       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1863                      .dwattr $C$DW$136, DW_AT_name("rsvd1")
    1864                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd1")
    1865                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1866                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1867                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   37

    1868              $C$DW$137       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1870                      .dwattr $C$DW$137, DW_AT_name("rsvd2")
    1871                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd2")
    1872                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1873                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1874                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1875                      .dwendtag $C$DW$T$29
    1876              
    1877              
    1878              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1879                      .dwattr $C$DW$T$30, DW_AT_name("CCR_REG")
    1880                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1881              $C$DW$138       .dwtag  DW_TAG_member
    1882                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    1883                      .dwattr $C$DW$138, DW_AT_name("all")
    1884                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    1885                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1886                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$139       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$29)
    1889                      .dwattr $C$DW$139, DW_AT_name("bit")
    1890                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    1891                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1892                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1893                      .dwendtag $C$DW$T$30
    1894              
    1895              
    1896              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1897                      .dwattr $C$DW$T$31, DW_AT_name("CLKCFGLOCK1_BITS")
    1898                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1899              $C$DW$140       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1901                      .dwattr $C$DW$140, DW_AT_name("CLKSRCCTL1")
    1902                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1903                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1904                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1906              $C$DW$141       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1908                      .dwattr $C$DW$141, DW_AT_name("CLKSRCCTL2")
    1909                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1910                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1911                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1913              $C$DW$142       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$142, DW_AT_name("CLKSRCCTL3")
    1916                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1917                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1918                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1919                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$143       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1922                      .dwattr $C$DW$143, DW_AT_name("SYSPLLCTL1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   38

    1923                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1924                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1926                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$144       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$144, DW_AT_name("SYSPLLCTL2")
    1930                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1931                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1932                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1933                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1934              $C$DW$145       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1936                      .dwattr $C$DW$145, DW_AT_name("SYSPLLCTL3")
    1937                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1938                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1939                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1940                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1941              $C$DW$146       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1943                      .dwattr $C$DW$146, DW_AT_name("SYSPLLMULT")
    1944                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1945                      .dwattr $C$DW$146, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1946                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1947                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1948              $C$DW$147       .dwtag  DW_TAG_member
    1949                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1950                      .dwattr $C$DW$147, DW_AT_name("AUXPLLCTL1")
    1951                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1952                      .dwattr $C$DW$147, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1953                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1955              $C$DW$148       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1957                      .dwattr $C$DW$148, DW_AT_name("rsvd1")
    1958                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd1")
    1959                      .dwattr $C$DW$148, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1960                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1961                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1962              $C$DW$149       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$149, DW_AT_name("AUXPLLMULT")
    1965                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1966                      .dwattr $C$DW$149, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1967                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$150       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1971                      .dwattr $C$DW$150, DW_AT_name("SYSCLKDIVSEL")
    1972                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1973                      .dwattr $C$DW$150, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1974                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1975                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$151       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   39

    1978                      .dwattr $C$DW$151, DW_AT_name("AUXCLKDIVSEL")
    1979                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1980                      .dwattr $C$DW$151, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1981                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1982                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1983              $C$DW$152       .dwtag  DW_TAG_member
    1984                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1985                      .dwattr $C$DW$152, DW_AT_name("PERCLKDIVSEL")
    1986                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1987                      .dwattr $C$DW$152, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1988                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1989                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1990              $C$DW$153       .dwtag  DW_TAG_member
    1991                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1992                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    1993                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    1994                      .dwattr $C$DW$153, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1995                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1996                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1997              $C$DW$154       .dwtag  DW_TAG_member
    1998                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1999                      .dwattr $C$DW$154, DW_AT_name("LOSPCP")
    2000                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_LOSPCP")
    2001                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2002                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2003                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2004              $C$DW$155       .dwtag  DW_TAG_member
    2005                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2006                      .dwattr $C$DW$155, DW_AT_name("rsvd3")
    2007                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd3")
    2008                      .dwattr $C$DW$155, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2009                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2010                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2011                      .dwendtag $C$DW$T$31
    2012              
    2013              
    2014              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2015                      .dwattr $C$DW$T$32, DW_AT_name("CLKCFGLOCK1_REG")
    2016                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2017              $C$DW$156       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    2019                      .dwattr $C$DW$156, DW_AT_name("all")
    2020                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_all")
    2021                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2023              $C$DW$157       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$31)
    2025                      .dwattr $C$DW$157, DW_AT_name("bit")
    2026                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_bit")
    2027                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2028                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2029                      .dwendtag $C$DW$T$32
    2030              
    2031              
    2032              $C$DW$T$33      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   40

    2033                      .dwattr $C$DW$T$33, DW_AT_name("CLKSEM_BITS")
    2034                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2035              $C$DW$158       .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2037                      .dwattr $C$DW$158, DW_AT_name("SEM")
    2038                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_SEM")
    2039                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2040                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2041                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2042              $C$DW$159       .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2044                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    2045                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    2046                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    2047                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2048                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2049              $C$DW$160       .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2051                      .dwattr $C$DW$160, DW_AT_name("KEY")
    2052                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_KEY")
    2053                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2054                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2055                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2056                      .dwendtag $C$DW$T$33
    2057              
    2058              
    2059              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2060                      .dwattr $C$DW$T$34, DW_AT_name("CLKSEM_REG")
    2061                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2062              $C$DW$161       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    2064                      .dwattr $C$DW$161, DW_AT_name("all")
    2065                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    2066                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2068              $C$DW$162       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$33)
    2070                      .dwattr $C$DW$162, DW_AT_name("bit")
    2071                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    2072                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2074                      .dwendtag $C$DW$T$34
    2075              
    2076              
    2077              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2078                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL1_BITS")
    2079                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2080              $C$DW$163       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2082                      .dwattr $C$DW$163, DW_AT_name("OSCCLKSRCSEL")
    2083                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2084                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2085                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2087              $C$DW$164       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   41

    2088                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2089                      .dwattr $C$DW$164, DW_AT_name("rsvd1")
    2090                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd1")
    2091                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2092                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2093                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$165       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2096                      .dwattr $C$DW$165, DW_AT_name("INTOSC2OFF")
    2097                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2098                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$166       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$166, DW_AT_name("XTALOFF")
    2104                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_XTALOFF")
    2105                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2106                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$167       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$167, DW_AT_name("WDHALTI")
    2111                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_WDHALTI")
    2112                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$168       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2117                      .dwattr $C$DW$168, DW_AT_name("rsvd2")
    2118                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd2")
    2119                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2120                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2121                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$169       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$169, DW_AT_name("rsvd3")
    2125                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd3")
    2126                      .dwattr $C$DW$169, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2127                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2128                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2129                      .dwendtag $C$DW$T$35
    2130              
    2131              
    2132              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2133                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL1_REG")
    2134                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2135              $C$DW$170       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2137                      .dwattr $C$DW$170, DW_AT_name("all")
    2138                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_all")
    2139                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2141              $C$DW$171       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$35)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   42

    2143                      .dwattr $C$DW$171, DW_AT_name("bit")
    2144                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_bit")
    2145                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2146                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2147                      .dwendtag $C$DW$T$36
    2148              
    2149              
    2150              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2151                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL2_BITS")
    2152                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2153              $C$DW$172       .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2155                      .dwattr $C$DW$172, DW_AT_name("AUXOSCCLKSRCSEL")
    2156                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    2157                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2158                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2159                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2160              $C$DW$173       .dwtag  DW_TAG_member
    2161                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2162                      .dwattr $C$DW$173, DW_AT_name("CANABCLKSEL")
    2163                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_CANABCLKSEL")
    2164                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2165                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2166                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2167              $C$DW$174       .dwtag  DW_TAG_member
    2168                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2169                      .dwattr $C$DW$174, DW_AT_name("CANBBCLKSEL")
    2170                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    2171                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2172                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2174              $C$DW$175       .dwtag  DW_TAG_member
    2175                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2176                      .dwattr $C$DW$175, DW_AT_name("rsvd1")
    2177                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd1")
    2178                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2179                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2181              $C$DW$176       .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2183                      .dwattr $C$DW$176, DW_AT_name("rsvd2")
    2184                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd2")
    2185                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2186                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2187                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2188                      .dwendtag $C$DW$T$37
    2189              
    2190              
    2191              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2192                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL2_REG")
    2193                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2194              $C$DW$177       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    2196                      .dwattr $C$DW$177, DW_AT_name("all")
    2197                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   43

    2198                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2199                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2200              $C$DW$178       .dwtag  DW_TAG_member
    2201                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$37)
    2202                      .dwattr $C$DW$178, DW_AT_name("bit")
    2203                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2204                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2206                      .dwendtag $C$DW$T$38
    2207              
    2208              
    2209              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2210                      .dwattr $C$DW$T$39, DW_AT_name("CLKSRCCTL3_BITS")
    2211                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2212              $C$DW$179       .dwtag  DW_TAG_member
    2213                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2214                      .dwattr $C$DW$179, DW_AT_name("XCLKOUTSEL")
    2215                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    2216                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    2217                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2218                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2219              $C$DW$180       .dwtag  DW_TAG_member
    2220                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2221                      .dwattr $C$DW$180, DW_AT_name("rsvd1")
    2222                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd1")
    2223                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2224                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2226              $C$DW$181       .dwtag  DW_TAG_member
    2227                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2228                      .dwattr $C$DW$181, DW_AT_name("rsvd2")
    2229                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd2")
    2230                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2231                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2232                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2233                      .dwendtag $C$DW$T$39
    2234              
    2235              
    2236              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2237                      .dwattr $C$DW$T$40, DW_AT_name("CLKSRCCTL3_REG")
    2238                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2239              $C$DW$182       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    2241                      .dwattr $C$DW$182, DW_AT_name("all")
    2242                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    2243                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2245              $C$DW$183       .dwtag  DW_TAG_member
    2246                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$39)
    2247                      .dwattr $C$DW$183, DW_AT_name("bit")
    2248                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    2249                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2250                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2251                      .dwendtag $C$DW$T$40
    2252              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   44

    2253              
    2254              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2255                      .dwattr $C$DW$T$43, DW_AT_name("CLK_CFG_REGS")
    2256                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x32)
    2257              $C$DW$184       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$34)
    2259                      .dwattr $C$DW$184, DW_AT_name("CLKSEM")
    2260                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_CLKSEM")
    2261                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2262                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2263              $C$DW$185       .dwtag  DW_TAG_member
    2264                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    2265                      .dwattr $C$DW$185, DW_AT_name("CLKCFGLOCK1")
    2266                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    2267                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2268                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2269              $C$DW$186       .dwtag  DW_TAG_member
    2270                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$41)
    2271                      .dwattr $C$DW$186, DW_AT_name("rsvd1")
    2272                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd1")
    2273                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2274                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2275              $C$DW$187       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$36)
    2277                      .dwattr $C$DW$187, DW_AT_name("CLKSRCCTL1")
    2278                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2279                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2280                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2281              $C$DW$188       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$38)
    2283                      .dwattr $C$DW$188, DW_AT_name("CLKSRCCTL2")
    2284                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2285                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2286                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2287              $C$DW$189       .dwtag  DW_TAG_member
    2288                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$40)
    2289                      .dwattr $C$DW$189, DW_AT_name("CLKSRCCTL3")
    2290                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    2291                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2292                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2293              $C$DW$190       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$198)
    2295                      .dwattr $C$DW$190, DW_AT_name("SYSPLLCTL1")
    2296                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2297                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2298                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2299              $C$DW$191       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$200)
    2301                      .dwattr $C$DW$191, DW_AT_name("SYSPLLCTL2")
    2302                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2303                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2304                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2305              $C$DW$192       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$202)
    2307                      .dwattr $C$DW$192, DW_AT_name("SYSPLLCTL3")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   45

    2308                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2309                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2310                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2311              $C$DW$193       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$204)
    2313                      .dwattr $C$DW$193, DW_AT_name("SYSPLLMULT")
    2314                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2315                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2316                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2317              $C$DW$194       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$206)
    2319                      .dwattr $C$DW$194, DW_AT_name("SYSPLLSTS")
    2320                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SYSPLLSTS")
    2321                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2322                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2323              $C$DW$195       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$24)
    2325                      .dwattr $C$DW$195, DW_AT_name("AUXPLLCTL1")
    2326                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2327                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2328                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2329              $C$DW$196       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$41)
    2331                      .dwattr $C$DW$196, DW_AT_name("rsvd2")
    2332                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd2")
    2333                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2334                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2335              $C$DW$197       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$26)
    2337                      .dwattr $C$DW$197, DW_AT_name("AUXPLLMULT")
    2338                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2339                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2340                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2341              $C$DW$198       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$28)
    2343                      .dwattr $C$DW$198, DW_AT_name("AUXPLLSTS")
    2344                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_AUXPLLSTS")
    2345                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2346                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2347              $C$DW$199       .dwtag  DW_TAG_member
    2348                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$196)
    2349                      .dwattr $C$DW$199, DW_AT_name("SYSCLKDIVSEL")
    2350                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2351                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2352                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2353              $C$DW$200       .dwtag  DW_TAG_member
    2354                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$22)
    2355                      .dwattr $C$DW$200, DW_AT_name("AUXCLKDIVSEL")
    2356                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2357                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2358                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2359              $C$DW$201       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$131)
    2361                      .dwattr $C$DW$201, DW_AT_name("PERCLKDIVSEL")
    2362                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   46

    2363                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2364                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2365              $C$DW$202       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$212)
    2367                      .dwattr $C$DW$202, DW_AT_name("XCLKOUTDIVSEL")
    2368                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    2369                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2370                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2371              $C$DW$203       .dwtag  DW_TAG_member
    2372                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$42)
    2373                      .dwattr $C$DW$203, DW_AT_name("rsvd3")
    2374                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd3")
    2375                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2376                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2377              $C$DW$204       .dwtag  DW_TAG_member
    2378                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$82)
    2379                      .dwattr $C$DW$204, DW_AT_name("LOSPCP")
    2380                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_LOSPCP")
    2381                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2382                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2383              $C$DW$205       .dwtag  DW_TAG_member
    2384                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$86)
    2385                      .dwattr $C$DW$205, DW_AT_name("MCDCR")
    2386                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_MCDCR")
    2387                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2388                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2389              $C$DW$206       .dwtag  DW_TAG_member
    2390                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$210)
    2391                      .dwattr $C$DW$206, DW_AT_name("X1CNT")
    2392                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_X1CNT")
    2393                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2394                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2395                      .dwendtag $C$DW$T$43
    2396              
    2397              $C$DW$207       .dwtag  DW_TAG_TI_far_type
    2398                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$43)
    2399              $C$DW$T$258     .dwtag  DW_TAG_volatile_type
    2400                      .dwattr $C$DW$T$258, DW_AT_type(*$C$DW$207)
    2401              
    2402              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2403                      .dwattr $C$DW$T$44, DW_AT_name("CPUSYSLOCK1_BITS")
    2404                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2405              $C$DW$208       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2407                      .dwattr $C$DW$208, DW_AT_name("HIBBOOTMODE")
    2408                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2409                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2410                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$209       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2414                      .dwattr $C$DW$209, DW_AT_name("IORESTOREADDR")
    2415                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2416                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2417                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   47

    2418                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2419              $C$DW$210       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$210, DW_AT_name("PIEVERRADDR")
    2422                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2423                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2424                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2425                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2426              $C$DW$211       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2428                      .dwattr $C$DW$211, DW_AT_name("PCLKCR0")
    2429                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PCLKCR0")
    2430                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2431                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2432                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$212       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2435                      .dwattr $C$DW$212, DW_AT_name("PCLKCR1")
    2436                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PCLKCR1")
    2437                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2438                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2440              $C$DW$213       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2442                      .dwattr $C$DW$213, DW_AT_name("PCLKCR2")
    2443                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_PCLKCR2")
    2444                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2445                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2446                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$214       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2449                      .dwattr $C$DW$214, DW_AT_name("PCLKCR3")
    2450                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_PCLKCR3")
    2451                      .dwattr $C$DW$214, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2452                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2453                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$215       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2456                      .dwattr $C$DW$215, DW_AT_name("PCLKCR4")
    2457                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_PCLKCR4")
    2458                      .dwattr $C$DW$215, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2459                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2460                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2461              $C$DW$216       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2463                      .dwattr $C$DW$216, DW_AT_name("PCLKCR5")
    2464                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_PCLKCR5")
    2465                      .dwattr $C$DW$216, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2466                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$217       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$217, DW_AT_name("PCLKCR6")
    2471                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_PCLKCR6")
    2472                      .dwattr $C$DW$217, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   48

    2473                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2474                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$218       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2477                      .dwattr $C$DW$218, DW_AT_name("PCLKCR7")
    2478                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PCLKCR7")
    2479                      .dwattr $C$DW$218, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2480                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2482              $C$DW$219       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2484                      .dwattr $C$DW$219, DW_AT_name("PCLKCR8")
    2485                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_PCLKCR8")
    2486                      .dwattr $C$DW$219, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2487                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2489              $C$DW$220       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2491                      .dwattr $C$DW$220, DW_AT_name("PCLKCR9")
    2492                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_PCLKCR9")
    2493                      .dwattr $C$DW$220, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2494                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2495                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$221       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2498                      .dwattr $C$DW$221, DW_AT_name("PCLKCR10")
    2499                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_PCLKCR10")
    2500                      .dwattr $C$DW$221, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2501                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2502                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2503              $C$DW$222       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2505                      .dwattr $C$DW$222, DW_AT_name("PCLKCR11")
    2506                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_PCLKCR11")
    2507                      .dwattr $C$DW$222, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2508                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$223       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2512                      .dwattr $C$DW$223, DW_AT_name("PCLKCR12")
    2513                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_PCLKCR12")
    2514                      .dwattr $C$DW$223, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2515                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2516                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2517              $C$DW$224       .dwtag  DW_TAG_member
    2518                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2519                      .dwattr $C$DW$224, DW_AT_name("PCLKCR13")
    2520                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_PCLKCR13")
    2521                      .dwattr $C$DW$224, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2522                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2523                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$225       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2526                      .dwattr $C$DW$225, DW_AT_name("PCLKCR14")
    2527                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_PCLKCR14")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   49

    2528                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2529                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2530                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2531              $C$DW$226       .dwtag  DW_TAG_member
    2532                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    2533                      .dwattr $C$DW$226, DW_AT_name("PCLKCR15")
    2534                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_PCLKCR15")
    2535                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2536                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2537                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2538              $C$DW$227       .dwtag  DW_TAG_member
    2539                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    2540                      .dwattr $C$DW$227, DW_AT_name("PCLKCR16")
    2541                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_PCLKCR16")
    2542                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2543                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2544                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2545              $C$DW$228       .dwtag  DW_TAG_member
    2546                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    2547                      .dwattr $C$DW$228, DW_AT_name("SECMSEL")
    2548                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_SECMSEL")
    2549                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2550                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2551                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2552              $C$DW$229       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2554                      .dwattr $C$DW$229, DW_AT_name("LPMCR")
    2555                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_LPMCR")
    2556                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2557                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2558                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2559              $C$DW$230       .dwtag  DW_TAG_member
    2560                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    2561                      .dwattr $C$DW$230, DW_AT_name("GPIOLPMSEL0")
    2562                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2563                      .dwattr $C$DW$230, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2564                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2565                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$231       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    2568                      .dwattr $C$DW$231, DW_AT_name("GPIOLPMSEL1")
    2569                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    2570                      .dwattr $C$DW$231, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2571                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2572                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2573              $C$DW$232       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2575                      .dwattr $C$DW$232, DW_AT_name("rsvd1")
    2576                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_rsvd1")
    2577                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2578                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2579                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2580                      .dwendtag $C$DW$T$44
    2581              
    2582              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   50

    2583              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2584                      .dwattr $C$DW$T$45, DW_AT_name("CPUSYSLOCK1_REG")
    2585                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2586              $C$DW$233       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$21)
    2588                      .dwattr $C$DW$233, DW_AT_name("all")
    2589                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_all")
    2590                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2591                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2592              $C$DW$234       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$44)
    2594                      .dwattr $C$DW$234, DW_AT_name("bit")
    2595                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bit")
    2596                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2597                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2598                      .dwendtag $C$DW$T$45
    2599              
    2600              
    2601              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2602                      .dwattr $C$DW$T$48, DW_AT_name("CPU_SYS_REGS")
    2603                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x82)
    2604              $C$DW$235       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$45)
    2606                      .dwattr $C$DW$235, DW_AT_name("CPUSYSLOCK1")
    2607                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    2608                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2610              $C$DW$236       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$41)
    2612                      .dwattr $C$DW$236, DW_AT_name("rsvd1")
    2613                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_rsvd1")
    2614                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2615                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2616              $C$DW$237       .dwtag  DW_TAG_member
    2617                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$21)
    2618                      .dwattr $C$DW$237, DW_AT_name("HIBBOOTMODE")
    2619                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2620                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2621                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2622              $C$DW$238       .dwtag  DW_TAG_member
    2623                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$80)
    2624                      .dwattr $C$DW$238, DW_AT_name("IORESTOREADDR")
    2625                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2626                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2627                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2628              $C$DW$239       .dwtag  DW_TAG_member
    2629                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$185)
    2630                      .dwattr $C$DW$239, DW_AT_name("PIEVERRADDR")
    2631                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2632                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2633                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2634              $C$DW$240       .dwtag  DW_TAG_member
    2635                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$46)
    2636                      .dwattr $C$DW$240, DW_AT_name("rsvd2")
    2637                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   51

    2638                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2639                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2640              $C$DW$241       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$99)
    2642                      .dwattr $C$DW$241, DW_AT_name("PCLKCR0")
    2643                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_PCLKCR0")
    2644                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2645                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$242       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$113)
    2648                      .dwattr $C$DW$242, DW_AT_name("PCLKCR1")
    2649                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PCLKCR1")
    2650                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2651                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$243       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$115)
    2654                      .dwattr $C$DW$243, DW_AT_name("PCLKCR2")
    2655                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_PCLKCR2")
    2656                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2657                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2658              $C$DW$244       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$117)
    2660                      .dwattr $C$DW$244, DW_AT_name("PCLKCR3")
    2661                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PCLKCR3")
    2662                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2663                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2664              $C$DW$245       .dwtag  DW_TAG_member
    2665                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$119)
    2666                      .dwattr $C$DW$245, DW_AT_name("PCLKCR4")
    2667                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_PCLKCR4")
    2668                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2669                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2670              $C$DW$246       .dwtag  DW_TAG_member
    2671                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$121)
    2672                      .dwattr $C$DW$246, DW_AT_name("PCLKCR5")
    2673                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_PCLKCR5")
    2674                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2675                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2676              $C$DW$247       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$123)
    2678                      .dwattr $C$DW$247, DW_AT_name("PCLKCR6")
    2679                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_PCLKCR6")
    2680                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2681                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2682              $C$DW$248       .dwtag  DW_TAG_member
    2683                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$125)
    2684                      .dwattr $C$DW$248, DW_AT_name("PCLKCR7")
    2685                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_PCLKCR7")
    2686                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2687                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$249       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$127)
    2690                      .dwattr $C$DW$249, DW_AT_name("PCLKCR8")
    2691                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_PCLKCR8")
    2692                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   52

    2693                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2694              $C$DW$250       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$129)
    2696                      .dwattr $C$DW$250, DW_AT_name("PCLKCR9")
    2697                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_PCLKCR9")
    2698                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2699                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2700              $C$DW$251       .dwtag  DW_TAG_member
    2701                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$101)
    2702                      .dwattr $C$DW$251, DW_AT_name("PCLKCR10")
    2703                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_PCLKCR10")
    2704                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2705                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2706              $C$DW$252       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$103)
    2708                      .dwattr $C$DW$252, DW_AT_name("PCLKCR11")
    2709                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_PCLKCR11")
    2710                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2711                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2712              $C$DW$253       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$105)
    2714                      .dwattr $C$DW$253, DW_AT_name("PCLKCR12")
    2715                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_PCLKCR12")
    2716                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2717                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2718              $C$DW$254       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$107)
    2720                      .dwattr $C$DW$254, DW_AT_name("PCLKCR13")
    2721                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_PCLKCR13")
    2722                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2723                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2724              $C$DW$255       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$109)
    2726                      .dwattr $C$DW$255, DW_AT_name("PCLKCR14")
    2727                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_PCLKCR14")
    2728                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2729                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2730              $C$DW$256       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$42)
    2732                      .dwattr $C$DW$256, DW_AT_name("rsvd3")
    2733                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd3")
    2734                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2735                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2736              $C$DW$257       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$111)
    2738                      .dwattr $C$DW$257, DW_AT_name("PCLKCR16")
    2739                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_PCLKCR16")
    2740                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2741                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2742              $C$DW$258       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$47)
    2744                      .dwattr $C$DW$258, DW_AT_name("rsvd4")
    2745                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_rsvd4")
    2746                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2747                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:54 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0321610                         PAGE   53

    2748              $C$DW$259       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$30)
    2750                      .dwattr $C$DW$259, DW_AT_name("CCR")
    2751                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_CCR")
    2752                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2753                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2754              $C$DW$260       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$194)
    2756                      .dwattr $C$DW$260, DW_AT_name("SECMSEL")
    2757                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_SECMSEL")
    2758                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2759                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2760              $C$DW$261       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$84)
    2762                      .dwattr $C$DW$261, DW_AT_name("LPMCR")
    2763                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_LPMCR")
    2764                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2765                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2766              $C$DW$262       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$76)
    2768                      .dwattr $C$DW$262, DW_AT_name("GPIOLPMSEL0")
    2769                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2770                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2771                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2772              $C$DW$263       .dwtag  DW_TAG_member
    2773                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$78)
    2774                      .dwattr $C$DW$263, DW_AT_name("GPIOLPMSEL1")
    2775                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    2776                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2777                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2778              $C$DW$264       .dwtag  DW_TAG_member
    2779                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$208)
    2780                      .dwattr $C$DW$264, DW_AT_name("TMR2CLKCTL")
    2781                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    2782                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2783                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2784              $C$DW$265       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$42)
    2786                      .dwattr $C$DW$265, DW_AT_name("rsvd5")
    2787                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_rsvd5")
    2788                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2789                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
