TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:33:06 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("c2brom_set_c2c1_boot_status")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_c2brom_set_c2c1_boot_status")

    3273 00000213 1A00!         OR        @_PieCtrlRegs,#0x0001 ; [CPU_] |838| 
         00000214 0001 
    3274                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    3275 00000215 2801!         MOV       @_PieCtrlRegs+1,#65535 ; [CPU_] |841| 
         00000216 FFFF 
    3276                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    3277 00000217 2910   clrc INTM
    3278                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    3279 00000218 FF69          SPM       #0                    ; [CPU_] 
    3280              $C$DW$187       .dwtag  DW_TAG_TI_branch
    3281                      .dwattr $C$DW$187, DW_AT_low_pc(0x00)
    3282                      .dwattr $C$DW$187, DW_AT_TI_return
    3283 00000219 0006          LRETR     ; [CPU_] 
    3284                      ; return occurs ; [] 
    3285                      .dwattr $C$DW$186, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boot
    3286                      .dwattr $C$DW$186, DW_AT_TI_end_line(0x34e)
    3287                      .dwattr $C$DW$186, DW_AT_TI_end_column(0x01)
    3288                      .dwendentry
    3289                      .dwendtag $C$DW$186
    3290              
    3291              ;**************************************************************
    3292              ;* UNDEFINED EXTERNAL REFERENCES                              *
    3293              ;**************************************************************
    3294                      .global _c2brom_set_c2c1_boot_status
    3295                      .global _load_itrap_address
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   69

    3296                      .global _branch_to_entryaddress
    3297                      .global _c2brom_c1c2_ipc_read_data_protected_32
    3298                      .global _c2brom_c1c2_ipc_write_data_32
    3299                      .global _c2brom_c1c2_ipc_write_data_16
    3300                      .global _c2brom_c1c2_ipc_read_data_32
    3301                      .global _c2brom_c1c2_ipc_read_data_16
    3302                      .global _c2brom_c1c2_ipc_set_bits_32
    3303                      .global _c2brom_c1c2_ipc_set_bits_16
    3304                      .global _c2brom_c1c2_ipc_clear_bits_32
    3305                      .global _c2brom_c1c2_ipc_write_data_protected_16
    3306                      .global _c2brom_c1c2_ipc_clear_bits_protected_32
    3307                      .global _c2brom_c1c2_ipc_read_data_protected_16
    3308                      .global _c2brom_c1c2_ipc_write_data_protected_32
    3309                      .global _c2brom_c1c2_ipc_set_bits_protected_16
    3310                      .global _c2brom_c1c2_ipc_clear_bits_16
    3311                      .global _c2brom_c1c2_ipc_clear_bits_protected_16
    3312                      .global _c2brom_c1c2_ipc_set_bits_protected_32
    3313                      .global _c2brom_status
    3314                      .global _c2brom_send_ipc_to_c1
    3315                      .global _c2brom_c1c2_ipc_func_call_command
    3316                      .global _SCI_Boot
    3317                      .global _SPI_Boot
    3318                      .global _Parallel_Boot
    3319                      .global _I2C_Boot
    3320                      .global _c2brom_current_c1c2_ipc
    3321                      .global _NmiIntruptRegs
    3322                      .global _PieCtrlRegs
    3323                      .global _IpcRegs
    3324                      .global _CpuSysRegs
    3325                      .global _PieVectTable
    3326              
    3327              ;***************************************************************
    3328              ;* TYPE INFORMATION                                            *
    3329              ;***************************************************************
    3330              
    3331              $C$DW$T$159     .dwtag  DW_TAG_enumeration_type
    3332                      .dwattr $C$DW$T$159, DW_AT_byte_size(0x01)
    3333              $C$DW$188       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
    3334              $C$DW$189       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
    3335              $C$DW$190       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
    3336              $C$DW$191       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
    3337                      .dwendtag $C$DW$T$159
    3338              
    3339              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
    3340                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$159)
    3341                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3342              
    3343              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    3344                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
    3345                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    3346              $C$DW$192       .dwtag  DW_TAG_member
    3347                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3348                      .dwattr $C$DW$192, DW_AT_name("VMAPS")
    3349                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_VMAPS")
    3350                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   70

    3351                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3352                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3353              $C$DW$193       .dwtag  DW_TAG_member
    3354                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    3355                      .dwattr $C$DW$193, DW_AT_name("MONPRIV")
    3356                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_MONPRIV")
    3357                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3358                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3359                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3360              $C$DW$194       .dwtag  DW_TAG_member
    3361                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    3362                      .dwattr $C$DW$194, DW_AT_name("ENPROT")
    3363                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_ENPROT")
    3364                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3365                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3366                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3367              $C$DW$195       .dwtag  DW_TAG_member
    3368                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3369                      .dwattr $C$DW$195, DW_AT_name("rsvd1")
    3370                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd1")
    3371                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    3372                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3373                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3374              $C$DW$196       .dwtag  DW_TAG_member
    3375                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3376                      .dwattr $C$DW$196, DW_AT_name("rsvd2")
    3377                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd2")
    3378                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3379                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3380                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3381                      .dwendtag $C$DW$T$20
    3382              
    3383              
    3384              $C$DW$T$22      .dwtag  DW_TAG_union_type
    3385                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
    3386                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    3387              $C$DW$197       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    3389                      .dwattr $C$DW$197, DW_AT_name("all")
    3390                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    3391                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3392                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3393              $C$DW$198       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    3395                      .dwattr $C$DW$198, DW_AT_name("bit")
    3396                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    3397                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3398                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3399                      .dwendtag $C$DW$T$22
    3400              
    3401              
    3402              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    3403                      .dwattr $C$DW$T$23, DW_AT_name("CPUSYSLOCK1_BITS")
    3404                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    3405              $C$DW$199       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   71

    3406                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3407                      .dwattr $C$DW$199, DW_AT_name("HIBBOOTMODE")
    3408                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    3409                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3410                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3411                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$200       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3414                      .dwattr $C$DW$200, DW_AT_name("IORESTOREADDR")
    3415                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_IORESTOREADDR")
    3416                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3417                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3418                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3419              $C$DW$201       .dwtag  DW_TAG_member
    3420                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3421                      .dwattr $C$DW$201, DW_AT_name("PIEVERRADDR")
    3422                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3423                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3424                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3425                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3426              $C$DW$202       .dwtag  DW_TAG_member
    3427                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3428                      .dwattr $C$DW$202, DW_AT_name("PCLKCR0")
    3429                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCLKCR0")
    3430                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3431                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3432                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3433              $C$DW$203       .dwtag  DW_TAG_member
    3434                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3435                      .dwattr $C$DW$203, DW_AT_name("PCLKCR1")
    3436                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_PCLKCR1")
    3437                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3438                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3439                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3440              $C$DW$204       .dwtag  DW_TAG_member
    3441                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3442                      .dwattr $C$DW$204, DW_AT_name("PCLKCR2")
    3443                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_PCLKCR2")
    3444                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3445                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3446                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3447              $C$DW$205       .dwtag  DW_TAG_member
    3448                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3449                      .dwattr $C$DW$205, DW_AT_name("PCLKCR3")
    3450                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_PCLKCR3")
    3451                      .dwattr $C$DW$205, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3452                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3453                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3454              $C$DW$206       .dwtag  DW_TAG_member
    3455                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3456                      .dwattr $C$DW$206, DW_AT_name("PCLKCR4")
    3457                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_PCLKCR4")
    3458                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3459                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3460                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   72

    3461              $C$DW$207       .dwtag  DW_TAG_member
    3462                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3463                      .dwattr $C$DW$207, DW_AT_name("PCLKCR5")
    3464                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_PCLKCR5")
    3465                      .dwattr $C$DW$207, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3466                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3467                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3468              $C$DW$208       .dwtag  DW_TAG_member
    3469                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3470                      .dwattr $C$DW$208, DW_AT_name("PCLKCR6")
    3471                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_PCLKCR6")
    3472                      .dwattr $C$DW$208, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3473                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3474                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3475              $C$DW$209       .dwtag  DW_TAG_member
    3476                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3477                      .dwattr $C$DW$209, DW_AT_name("PCLKCR7")
    3478                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_PCLKCR7")
    3479                      .dwattr $C$DW$209, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3480                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3481                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3482              $C$DW$210       .dwtag  DW_TAG_member
    3483                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3484                      .dwattr $C$DW$210, DW_AT_name("PCLKCR8")
    3485                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_PCLKCR8")
    3486                      .dwattr $C$DW$210, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3487                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3488                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3489              $C$DW$211       .dwtag  DW_TAG_member
    3490                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3491                      .dwattr $C$DW$211, DW_AT_name("PCLKCR9")
    3492                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_PCLKCR9")
    3493                      .dwattr $C$DW$211, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3494                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3495                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3496              $C$DW$212       .dwtag  DW_TAG_member
    3497                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3498                      .dwattr $C$DW$212, DW_AT_name("PCLKCR10")
    3499                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_PCLKCR10")
    3500                      .dwattr $C$DW$212, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3501                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3502                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3503              $C$DW$213       .dwtag  DW_TAG_member
    3504                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3505                      .dwattr $C$DW$213, DW_AT_name("PCLKCR11")
    3506                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_PCLKCR11")
    3507                      .dwattr $C$DW$213, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3508                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3509                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3510              $C$DW$214       .dwtag  DW_TAG_member
    3511                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3512                      .dwattr $C$DW$214, DW_AT_name("PCLKCR12")
    3513                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_PCLKCR12")
    3514                      .dwattr $C$DW$214, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3515                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   73

    3516                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3517              $C$DW$215       .dwtag  DW_TAG_member
    3518                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3519                      .dwattr $C$DW$215, DW_AT_name("PCLKCR13")
    3520                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_PCLKCR13")
    3521                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3522                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3523                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3524              $C$DW$216       .dwtag  DW_TAG_member
    3525                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3526                      .dwattr $C$DW$216, DW_AT_name("PCLKCR14")
    3527                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_PCLKCR14")
    3528                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3529                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3530                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3531              $C$DW$217       .dwtag  DW_TAG_member
    3532                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3533                      .dwattr $C$DW$217, DW_AT_name("PCLKCR15")
    3534                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_PCLKCR15")
    3535                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3536                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3537                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3538              $C$DW$218       .dwtag  DW_TAG_member
    3539                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3540                      .dwattr $C$DW$218, DW_AT_name("PCLKCR16")
    3541                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_PCLKCR16")
    3542                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3543                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3544                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3545              $C$DW$219       .dwtag  DW_TAG_member
    3546                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3547                      .dwattr $C$DW$219, DW_AT_name("SECMSEL")
    3548                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_SECMSEL")
    3549                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3550                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3551                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3552              $C$DW$220       .dwtag  DW_TAG_member
    3553                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3554                      .dwattr $C$DW$220, DW_AT_name("LPMCR")
    3555                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_LPMCR")
    3556                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3557                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3558                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3559              $C$DW$221       .dwtag  DW_TAG_member
    3560                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3561                      .dwattr $C$DW$221, DW_AT_name("GPIOLPMSEL0")
    3562                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    3563                      .dwattr $C$DW$221, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3564                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3565                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3566              $C$DW$222       .dwtag  DW_TAG_member
    3567                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3568                      .dwattr $C$DW$222, DW_AT_name("GPIOLPMSEL1")
    3569                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    3570                      .dwattr $C$DW$222, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   74

    3571                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3572                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3573              $C$DW$223       .dwtag  DW_TAG_member
    3574                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3575                      .dwattr $C$DW$223, DW_AT_name("rsvd1")
    3576                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_rsvd1")
    3577                      .dwattr $C$DW$223, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3578                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3579                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3580                      .dwendtag $C$DW$T$23
    3581              
    3582              
    3583              $C$DW$T$24      .dwtag  DW_TAG_union_type
    3584                      .dwattr $C$DW$T$24, DW_AT_name("CPUSYSLOCK1_REG")
    3585                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    3586              $C$DW$224       .dwtag  DW_TAG_member
    3587                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$21)
    3588                      .dwattr $C$DW$224, DW_AT_name("all")
    3589                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_all")
    3590                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3591                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3592              $C$DW$225       .dwtag  DW_TAG_member
    3593                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$23)
    3594                      .dwattr $C$DW$225, DW_AT_name("bit")
    3595                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_bit")
    3596                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3597                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3598                      .dwendtag $C$DW$T$24
    3599              
    3600              
    3601              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3602                      .dwattr $C$DW$T$29, DW_AT_name("CPU_SYS_REGS")
    3603                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x82)
    3604              $C$DW$226       .dwtag  DW_TAG_member
    3605                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$24)
    3606                      .dwattr $C$DW$226, DW_AT_name("CPUSYSLOCK1")
    3607                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    3608                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3609                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3610              $C$DW$227       .dwtag  DW_TAG_member
    3611                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$25)
    3612                      .dwattr $C$DW$227, DW_AT_name("rsvd1")
    3613                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_rsvd1")
    3614                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3615                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3616              $C$DW$228       .dwtag  DW_TAG_member
    3617                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    3618                      .dwattr $C$DW$228, DW_AT_name("HIBBOOTMODE")
    3619                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    3620                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3621                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3622              $C$DW$229       .dwtag  DW_TAG_member
    3623                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$35)
    3624                      .dwattr $C$DW$229, DW_AT_name("IORESTOREADDR")
    3625                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_IORESTOREADDR")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   75

    3626                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3627                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3628              $C$DW$230       .dwtag  DW_TAG_member
    3629                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$145)
    3630                      .dwattr $C$DW$230, DW_AT_name("PIEVERRADDR")
    3631                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_PIEVERRADDR")
    3632                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3633                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3634              $C$DW$231       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$26)
    3636                      .dwattr $C$DW$231, DW_AT_name("rsvd2")
    3637                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd2")
    3638                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3639                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3640              $C$DW$232       .dwtag  DW_TAG_member
    3641                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$61)
    3642                      .dwattr $C$DW$232, DW_AT_name("PCLKCR0")
    3643                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_PCLKCR0")
    3644                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3645                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3646              $C$DW$233       .dwtag  DW_TAG_member
    3647                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$75)
    3648                      .dwattr $C$DW$233, DW_AT_name("PCLKCR1")
    3649                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_PCLKCR1")
    3650                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3651                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3652              $C$DW$234       .dwtag  DW_TAG_member
    3653                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$77)
    3654                      .dwattr $C$DW$234, DW_AT_name("PCLKCR2")
    3655                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_PCLKCR2")
    3656                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3657                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3658              $C$DW$235       .dwtag  DW_TAG_member
    3659                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$79)
    3660                      .dwattr $C$DW$235, DW_AT_name("PCLKCR3")
    3661                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_PCLKCR3")
    3662                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3663                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3664              $C$DW$236       .dwtag  DW_TAG_member
    3665                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$81)
    3666                      .dwattr $C$DW$236, DW_AT_name("PCLKCR4")
    3667                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_PCLKCR4")
    3668                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3669                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3670              $C$DW$237       .dwtag  DW_TAG_member
    3671                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$83)
    3672                      .dwattr $C$DW$237, DW_AT_name("PCLKCR5")
    3673                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_PCLKCR5")
    3674                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3675                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3676              $C$DW$238       .dwtag  DW_TAG_member
    3677                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$85)
    3678                      .dwattr $C$DW$238, DW_AT_name("PCLKCR6")
    3679                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_PCLKCR6")
    3680                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   76

    3681                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3682              $C$DW$239       .dwtag  DW_TAG_member
    3683                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$87)
    3684                      .dwattr $C$DW$239, DW_AT_name("PCLKCR7")
    3685                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_PCLKCR7")
    3686                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3687                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3688              $C$DW$240       .dwtag  DW_TAG_member
    3689                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$89)
    3690                      .dwattr $C$DW$240, DW_AT_name("PCLKCR8")
    3691                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_PCLKCR8")
    3692                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    3693                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3694              $C$DW$241       .dwtag  DW_TAG_member
    3695                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$91)
    3696                      .dwattr $C$DW$241, DW_AT_name("PCLKCR9")
    3697                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_PCLKCR9")
    3698                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3699                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3700              $C$DW$242       .dwtag  DW_TAG_member
    3701                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$63)
    3702                      .dwattr $C$DW$242, DW_AT_name("PCLKCR10")
    3703                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_PCLKCR10")
    3704                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    3705                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3706              $C$DW$243       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$65)
    3708                      .dwattr $C$DW$243, DW_AT_name("PCLKCR11")
    3709                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_PCLKCR11")
    3710                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3711                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$244       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$67)
    3714                      .dwattr $C$DW$244, DW_AT_name("PCLKCR12")
    3715                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_PCLKCR12")
    3716                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    3717                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3718              $C$DW$245       .dwtag  DW_TAG_member
    3719                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$69)
    3720                      .dwattr $C$DW$245, DW_AT_name("PCLKCR13")
    3721                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_PCLKCR13")
    3722                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3723                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3724              $C$DW$246       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$71)
    3726                      .dwattr $C$DW$246, DW_AT_name("PCLKCR14")
    3727                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_PCLKCR14")
    3728                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    3729                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$247       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    3732                      .dwattr $C$DW$247, DW_AT_name("rsvd3")
    3733                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_rsvd3")
    3734                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3735                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   77

    3736              $C$DW$248       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$73)
    3738                      .dwattr $C$DW$248, DW_AT_name("PCLKCR16")
    3739                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_PCLKCR16")
    3740                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    3741                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$249       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$28)
    3744                      .dwattr $C$DW$249, DW_AT_name("rsvd4")
    3745                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_rsvd4")
    3746                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3747                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$250       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$22)
    3750                      .dwattr $C$DW$250, DW_AT_name("CCR")
    3751                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_CCR")
    3752                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    3753                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3754              $C$DW$251       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$156)
    3756                      .dwattr $C$DW$251, DW_AT_name("SECMSEL")
    3757                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_SECMSEL")
    3758                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3759                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$252       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$48)
    3762                      .dwattr $C$DW$252, DW_AT_name("LPMCR")
    3763                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_LPMCR")
    3764                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    3765                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3766              $C$DW$253       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$31)
    3768                      .dwattr $C$DW$253, DW_AT_name("GPIOLPMSEL0")
    3769                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    3770                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    3771                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3772              $C$DW$254       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$33)
    3774                      .dwattr $C$DW$254, DW_AT_name("GPIOLPMSEL1")
    3775                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    3776                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    3777                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$255       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$158)
    3780                      .dwattr $C$DW$255, DW_AT_name("TMR2CLKCTL")
    3781                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    3782                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    3783                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3784              $C$DW$256       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    3786                      .dwattr $C$DW$256, DW_AT_name("rsvd5")
    3787                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd5")
    3788                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    3789                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$257       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   78

    3791                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$154)
    3792                      .dwattr $C$DW$257, DW_AT_name("RESC")
    3793                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_RESC")
    3794                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    3795                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3796                      .dwendtag $C$DW$T$29
    3797              
    3798              $C$DW$258       .dwtag  DW_TAG_TI_far_type
    3799                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$29)
    3800              $C$DW$T$165     .dwtag  DW_TAG_volatile_type
    3801                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$258)
    3802              
    3803              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3804                      .dwattr $C$DW$T$30, DW_AT_name("GPIOLPMSEL0_BITS")
    3805                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    3806              $C$DW$259       .dwtag  DW_TAG_member
    3807                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3808                      .dwattr $C$DW$259, DW_AT_name("GPIO0")
    3809                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPIO0")
    3810                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3811                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3812                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3813              $C$DW$260       .dwtag  DW_TAG_member
    3814                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3815                      .dwattr $C$DW$260, DW_AT_name("GPIO1")
    3816                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPIO1")
    3817                      .dwattr $C$DW$260, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3818                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3819                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3820              $C$DW$261       .dwtag  DW_TAG_member
    3821                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3822                      .dwattr $C$DW$261, DW_AT_name("GPIO2")
    3823                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_GPIO2")
    3824                      .dwattr $C$DW$261, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3825                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3826                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3827              $C$DW$262       .dwtag  DW_TAG_member
    3828                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3829                      .dwattr $C$DW$262, DW_AT_name("GPIO3")
    3830                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPIO3")
    3831                      .dwattr $C$DW$262, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3832                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3833                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3834              $C$DW$263       .dwtag  DW_TAG_member
    3835                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3836                      .dwattr $C$DW$263, DW_AT_name("GPIO4")
    3837                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_GPIO4")
    3838                      .dwattr $C$DW$263, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3839                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3840                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3841              $C$DW$264       .dwtag  DW_TAG_member
    3842                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3843                      .dwattr $C$DW$264, DW_AT_name("GPIO5")
    3844                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPIO5")
    3845                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   79

    3846                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3847                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3848              $C$DW$265       .dwtag  DW_TAG_member
    3849                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3850                      .dwattr $C$DW$265, DW_AT_name("GPIO6")
    3851                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPIO6")
    3852                      .dwattr $C$DW$265, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3853                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3854                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3855              $C$DW$266       .dwtag  DW_TAG_member
    3856                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3857                      .dwattr $C$DW$266, DW_AT_name("GPIO7")
    3858                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPIO7")
    3859                      .dwattr $C$DW$266, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3860                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3861                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3862              $C$DW$267       .dwtag  DW_TAG_member
    3863                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3864                      .dwattr $C$DW$267, DW_AT_name("GPIO8")
    3865                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_GPIO8")
    3866                      .dwattr $C$DW$267, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3867                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3868                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3869              $C$DW$268       .dwtag  DW_TAG_member
    3870                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3871                      .dwattr $C$DW$268, DW_AT_name("GPIO9")
    3872                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_GPIO9")
    3873                      .dwattr $C$DW$268, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3874                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3875                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3876              $C$DW$269       .dwtag  DW_TAG_member
    3877                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3878                      .dwattr $C$DW$269, DW_AT_name("GPIO10")
    3879                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_GPIO10")
    3880                      .dwattr $C$DW$269, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3881                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3882                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3883              $C$DW$270       .dwtag  DW_TAG_member
    3884                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3885                      .dwattr $C$DW$270, DW_AT_name("GPIO11")
    3886                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_GPIO11")
    3887                      .dwattr $C$DW$270, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3888                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3889                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3890              $C$DW$271       .dwtag  DW_TAG_member
    3891                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3892                      .dwattr $C$DW$271, DW_AT_name("GPIO12")
    3893                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_GPIO12")
    3894                      .dwattr $C$DW$271, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3895                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3896                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3897              $C$DW$272       .dwtag  DW_TAG_member
    3898                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$19)
    3899                      .dwattr $C$DW$272, DW_AT_name("GPIO13")
    3900                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_GPIO13")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   80

    3901                      .dwattr $C$DW$272, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3902                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3903                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3904              $C$DW$273       .dwtag  DW_TAG_member
    3905                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    3906                      .dwattr $C$DW$273, DW_AT_name("GPIO14")
    3907                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_GPIO14")
    3908                      .dwattr $C$DW$273, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3909                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3910                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3911              $C$DW$274       .dwtag  DW_TAG_member
    3912                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3913                      .dwattr $C$DW$274, DW_AT_name("GPIO15")
    3914                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_GPIO15")
    3915                      .dwattr $C$DW$274, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3916                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3917                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3918              $C$DW$275       .dwtag  DW_TAG_member
    3919                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    3920                      .dwattr $C$DW$275, DW_AT_name("GPIO16")
    3921                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_GPIO16")
    3922                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3923                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3924                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3925              $C$DW$276       .dwtag  DW_TAG_member
    3926                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    3927                      .dwattr $C$DW$276, DW_AT_name("GPIO17")
    3928                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_GPIO17")
    3929                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3930                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3931                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3932              $C$DW$277       .dwtag  DW_TAG_member
    3933                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3934                      .dwattr $C$DW$277, DW_AT_name("GPIO18")
    3935                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_GPIO18")
    3936                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3937                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3938                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3939              $C$DW$278       .dwtag  DW_TAG_member
    3940                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    3941                      .dwattr $C$DW$278, DW_AT_name("GPIO19")
    3942                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_GPIO19")
    3943                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3944                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3945                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3946              $C$DW$279       .dwtag  DW_TAG_member
    3947                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    3948                      .dwattr $C$DW$279, DW_AT_name("GPIO20")
    3949                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_GPIO20")
    3950                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3951                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3952                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3953              $C$DW$280       .dwtag  DW_TAG_member
    3954                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    3955                      .dwattr $C$DW$280, DW_AT_name("GPIO21")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   81

    3956                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_GPIO21")
    3957                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3958                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3959                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3960              $C$DW$281       .dwtag  DW_TAG_member
    3961                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    3962                      .dwattr $C$DW$281, DW_AT_name("GPIO22")
    3963                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_GPIO22")
    3964                      .dwattr $C$DW$281, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3965                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3966                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3967              $C$DW$282       .dwtag  DW_TAG_member
    3968                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    3969                      .dwattr $C$DW$282, DW_AT_name("GPIO23")
    3970                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_GPIO23")
    3971                      .dwattr $C$DW$282, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3972                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3973                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3974              $C$DW$283       .dwtag  DW_TAG_member
    3975                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    3976                      .dwattr $C$DW$283, DW_AT_name("GPIO24")
    3977                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_GPIO24")
    3978                      .dwattr $C$DW$283, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3979                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3980                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3981              $C$DW$284       .dwtag  DW_TAG_member
    3982                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    3983                      .dwattr $C$DW$284, DW_AT_name("GPIO25")
    3984                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_GPIO25")
    3985                      .dwattr $C$DW$284, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3986                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3987                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3988              $C$DW$285       .dwtag  DW_TAG_member
    3989                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    3990                      .dwattr $C$DW$285, DW_AT_name("GPIO26")
    3991                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_GPIO26")
    3992                      .dwattr $C$DW$285, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3993                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3994                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3995              $C$DW$286       .dwtag  DW_TAG_member
    3996                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3997                      .dwattr $C$DW$286, DW_AT_name("GPIO27")
    3998                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_GPIO27")
    3999                      .dwattr $C$DW$286, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4000                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4001                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    4002              $C$DW$287       .dwtag  DW_TAG_member
    4003                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    4004                      .dwattr $C$DW$287, DW_AT_name("GPIO28")
    4005                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_GPIO28")
    4006                      .dwattr $C$DW$287, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4007                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4008                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4009              $C$DW$288       .dwtag  DW_TAG_member
    4010                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   82

    4011                      .dwattr $C$DW$288, DW_AT_name("GPIO29")
    4012                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_GPIO29")
    4013                      .dwattr $C$DW$288, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4014                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4015                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4016              $C$DW$289       .dwtag  DW_TAG_member
    4017                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    4018                      .dwattr $C$DW$289, DW_AT_name("GPIO30")
    4019                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_GPIO30")
    4020                      .dwattr $C$DW$289, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4021                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4022                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4023              $C$DW$290       .dwtag  DW_TAG_member
    4024                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    4025                      .dwattr $C$DW$290, DW_AT_name("GPIO31")
    4026                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_GPIO31")
    4027                      .dwattr $C$DW$290, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4028                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4029                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4030                      .dwendtag $C$DW$T$30
    4031              
    4032              
    4033              $C$DW$T$31      .dwtag  DW_TAG_union_type
    4034                      .dwattr $C$DW$T$31, DW_AT_name("GPIOLPMSEL0_REG")
    4035                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    4036              $C$DW$291       .dwtag  DW_TAG_member
    4037                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$21)
    4038                      .dwattr $C$DW$291, DW_AT_name("all")
    4039                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_all")
    4040                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4041                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4042              $C$DW$292       .dwtag  DW_TAG_member
    4043                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$30)
    4044                      .dwattr $C$DW$292, DW_AT_name("bit")
    4045                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_bit")
    4046                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4047                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4048                      .dwendtag $C$DW$T$31
    4049              
    4050              
    4051              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    4052                      .dwattr $C$DW$T$32, DW_AT_name("GPIOLPMSEL1_BITS")
    4053                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    4054              $C$DW$293       .dwtag  DW_TAG_member
    4055                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    4056                      .dwattr $C$DW$293, DW_AT_name("GPIO32")
    4057                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_GPIO32")
    4058                      .dwattr $C$DW$293, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4059                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4060                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4061              $C$DW$294       .dwtag  DW_TAG_member
    4062                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    4063                      .dwattr $C$DW$294, DW_AT_name("GPIO33")
    4064                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_GPIO33")
    4065                      .dwattr $C$DW$294, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   83

    4066                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4067                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4068              $C$DW$295       .dwtag  DW_TAG_member
    4069                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    4070                      .dwattr $C$DW$295, DW_AT_name("GPIO34")
    4071                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_GPIO34")
    4072                      .dwattr $C$DW$295, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4073                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4074                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4075              $C$DW$296       .dwtag  DW_TAG_member
    4076                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    4077                      .dwattr $C$DW$296, DW_AT_name("GPIO35")
    4078                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_GPIO35")
    4079                      .dwattr $C$DW$296, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4080                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4081                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4082              $C$DW$297       .dwtag  DW_TAG_member
    4083                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    4084                      .dwattr $C$DW$297, DW_AT_name("GPIO36")
    4085                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_GPIO36")
    4086                      .dwattr $C$DW$297, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4087                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4088                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4089              $C$DW$298       .dwtag  DW_TAG_member
    4090                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    4091                      .dwattr $C$DW$298, DW_AT_name("GPIO37")
    4092                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_GPIO37")
    4093                      .dwattr $C$DW$298, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4094                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4095                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4096              $C$DW$299       .dwtag  DW_TAG_member
    4097                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    4098                      .dwattr $C$DW$299, DW_AT_name("GPIO38")
    4099                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_GPIO38")
    4100                      .dwattr $C$DW$299, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4101                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4102                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4103              $C$DW$300       .dwtag  DW_TAG_member
    4104                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    4105                      .dwattr $C$DW$300, DW_AT_name("GPIO39")
    4106                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_GPIO39")
    4107                      .dwattr $C$DW$300, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4108                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4109                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4110              $C$DW$301       .dwtag  DW_TAG_member
    4111                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    4112                      .dwattr $C$DW$301, DW_AT_name("GPIO40")
    4113                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_GPIO40")
    4114                      .dwattr $C$DW$301, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4115                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4116                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$302       .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    4119                      .dwattr $C$DW$302, DW_AT_name("GPIO41")
    4120                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_GPIO41")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   84

    4121                      .dwattr $C$DW$302, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4122                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4123                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4124              $C$DW$303       .dwtag  DW_TAG_member
    4125                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$19)
    4126                      .dwattr $C$DW$303, DW_AT_name("GPIO42")
    4127                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_GPIO42")
    4128                      .dwattr $C$DW$303, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4129                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4130                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4131              $C$DW$304       .dwtag  DW_TAG_member
    4132                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$19)
    4133                      .dwattr $C$DW$304, DW_AT_name("GPIO43")
    4134                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_GPIO43")
    4135                      .dwattr $C$DW$304, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4136                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4137                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4138              $C$DW$305       .dwtag  DW_TAG_member
    4139                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$19)
    4140                      .dwattr $C$DW$305, DW_AT_name("GPIO44")
    4141                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_GPIO44")
    4142                      .dwattr $C$DW$305, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4143                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4144                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4145              $C$DW$306       .dwtag  DW_TAG_member
    4146                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$19)
    4147                      .dwattr $C$DW$306, DW_AT_name("GPIO45")
    4148                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_GPIO45")
    4149                      .dwattr $C$DW$306, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4150                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4151                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4152              $C$DW$307       .dwtag  DW_TAG_member
    4153                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$19)
    4154                      .dwattr $C$DW$307, DW_AT_name("GPIO46")
    4155                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_GPIO46")
    4156                      .dwattr $C$DW$307, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4157                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4158                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$308       .dwtag  DW_TAG_member
    4160                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$19)
    4161                      .dwattr $C$DW$308, DW_AT_name("GPIO47")
    4162                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_GPIO47")
    4163                      .dwattr $C$DW$308, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4164                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4165                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4166              $C$DW$309       .dwtag  DW_TAG_member
    4167                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$19)
    4168                      .dwattr $C$DW$309, DW_AT_name("GPIO48")
    4169                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_GPIO48")
    4170                      .dwattr $C$DW$309, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4171                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4172                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4173              $C$DW$310       .dwtag  DW_TAG_member
    4174                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$19)
    4175                      .dwattr $C$DW$310, DW_AT_name("GPIO49")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   85

    4176                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_GPIO49")
    4177                      .dwattr $C$DW$310, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4178                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4179                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4180              $C$DW$311       .dwtag  DW_TAG_member
    4181                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    4182                      .dwattr $C$DW$311, DW_AT_name("GPIO50")
    4183                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_GPIO50")
    4184                      .dwattr $C$DW$311, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4185                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4186                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4187              $C$DW$312       .dwtag  DW_TAG_member
    4188                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    4189                      .dwattr $C$DW$312, DW_AT_name("GPIO51")
    4190                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_GPIO51")
    4191                      .dwattr $C$DW$312, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4192                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4193                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4194              $C$DW$313       .dwtag  DW_TAG_member
    4195                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    4196                      .dwattr $C$DW$313, DW_AT_name("GPIO52")
    4197                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_GPIO52")
    4198                      .dwattr $C$DW$313, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4199                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4200                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4201              $C$DW$314       .dwtag  DW_TAG_member
    4202                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    4203                      .dwattr $C$DW$314, DW_AT_name("GPIO53")
    4204                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_GPIO53")
    4205                      .dwattr $C$DW$314, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4206                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4207                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4208              $C$DW$315       .dwtag  DW_TAG_member
    4209                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    4210                      .dwattr $C$DW$315, DW_AT_name("GPIO54")
    4211                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_GPIO54")
    4212                      .dwattr $C$DW$315, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4213                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4214                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4215              $C$DW$316       .dwtag  DW_TAG_member
    4216                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    4217                      .dwattr $C$DW$316, DW_AT_name("GPIO55")
    4218                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_GPIO55")
    4219                      .dwattr $C$DW$316, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4220                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4221                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4222              $C$DW$317       .dwtag  DW_TAG_member
    4223                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    4224                      .dwattr $C$DW$317, DW_AT_name("GPIO56")
    4225                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_GPIO56")
    4226                      .dwattr $C$DW$317, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4227                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4228                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4229              $C$DW$318       .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   86

    4231                      .dwattr $C$DW$318, DW_AT_name("GPIO57")
    4232                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_GPIO57")
    4233                      .dwattr $C$DW$318, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4234                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4235                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4236              $C$DW$319       .dwtag  DW_TAG_member
    4237                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    4238                      .dwattr $C$DW$319, DW_AT_name("GPIO58")
    4239                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_GPIO58")
    4240                      .dwattr $C$DW$319, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4241                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4242                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4243              $C$DW$320       .dwtag  DW_TAG_member
    4244                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    4245                      .dwattr $C$DW$320, DW_AT_name("GPIO59")
    4246                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_GPIO59")
    4247                      .dwattr $C$DW$320, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4248                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4249                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4250              $C$DW$321       .dwtag  DW_TAG_member
    4251                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$19)
    4252                      .dwattr $C$DW$321, DW_AT_name("GPIO60")
    4253                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_GPIO60")
    4254                      .dwattr $C$DW$321, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4255                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4256                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4257              $C$DW$322       .dwtag  DW_TAG_member
    4258                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    4259                      .dwattr $C$DW$322, DW_AT_name("GPIO61")
    4260                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_GPIO61")
    4261                      .dwattr $C$DW$322, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4262                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4263                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4264              $C$DW$323       .dwtag  DW_TAG_member
    4265                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$19)
    4266                      .dwattr $C$DW$323, DW_AT_name("GPIO62")
    4267                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_GPIO62")
    4268                      .dwattr $C$DW$323, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4269                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4270                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4271              $C$DW$324       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    4273                      .dwattr $C$DW$324, DW_AT_name("GPIO63")
    4274                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_GPIO63")
    4275                      .dwattr $C$DW$324, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4276                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4277                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4278                      .dwendtag $C$DW$T$32
    4279              
    4280              
    4281              $C$DW$T$33      .dwtag  DW_TAG_union_type
    4282                      .dwattr $C$DW$T$33, DW_AT_name("GPIOLPMSEL1_REG")
    4283                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    4284              $C$DW$325       .dwtag  DW_TAG_member
    4285                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   87

    4286                      .dwattr $C$DW$325, DW_AT_name("all")
    4287                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_all")
    4288                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4289                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4290              $C$DW$326       .dwtag  DW_TAG_member
    4291                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$32)
    4292                      .dwattr $C$DW$326, DW_AT_name("bit")
    4293                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_bit")
    4294                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4295                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4296                      .dwendtag $C$DW$T$33
    4297              
    4298              
    4299              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    4300                      .dwattr $C$DW$T$34, DW_AT_name("IORESTOREADDR_BITS")
    4301                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    4302              $C$DW$327       .dwtag  DW_TAG_member
    4303                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$21)
    4304                      .dwattr $C$DW$327, DW_AT_name("ADDR")
    4305                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_ADDR")
    4306                      .dwattr $C$DW$327, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x16)
    4307                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4308                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4309              $C$DW$328       .dwtag  DW_TAG_member
    4310                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    4311                      .dwattr $C$DW$328, DW_AT_name("rsvd1")
    4312                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_rsvd1")
    4313                      .dwattr $C$DW$328, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    4314                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4315                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4316                      .dwendtag $C$DW$T$34
    4317              
    4318              
    4319              $C$DW$T$35      .dwtag  DW_TAG_union_type
    4320                      .dwattr $C$DW$T$35, DW_AT_name("IORESTOREADDR_REG")
    4321                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    4322              $C$DW$329       .dwtag  DW_TAG_member
    4323                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$21)
    4324                      .dwattr $C$DW$329, DW_AT_name("all")
    4325                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_all")
    4326                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4327                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4328              $C$DW$330       .dwtag  DW_TAG_member
    4329                      .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$34)
    4330                      .dwattr $C$DW$330, DW_AT_name("bit")
    4331                      .dwattr $C$DW$330, DW_AT_TI_symbol_name("_bit")
    4332                      .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4333                      .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4334                      .dwendtag $C$DW$T$35
    4335              
    4336              
    4337              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    4338                      .dwattr $C$DW$T$36, DW_AT_name("IPCACK_BITS")
    4339                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    4340              $C$DW$331       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   88

    4341                      .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    4342                      .dwattr $C$DW$331, DW_AT_name("IPC0")
    4343                      .dwattr $C$DW$331, DW_AT_TI_symbol_name("_IPC0")
    4344                      .dwattr $C$DW$331, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4345                      .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4346                      .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4347              $C$DW$332       .dwtag  DW_TAG_member
    4348                      .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    4349                      .dwattr $C$DW$332, DW_AT_name("IPC1")
    4350                      .dwattr $C$DW$332, DW_AT_TI_symbol_name("_IPC1")
    4351                      .dwattr $C$DW$332, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4352                      .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4353                      .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4354              $C$DW$333       .dwtag  DW_TAG_member
    4355                      .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$19)
    4356                      .dwattr $C$DW$333, DW_AT_name("IPC2")
    4357                      .dwattr $C$DW$333, DW_AT_TI_symbol_name("_IPC2")
    4358                      .dwattr $C$DW$333, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4359                      .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4360                      .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4361              $C$DW$334       .dwtag  DW_TAG_member
    4362                      .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$19)
    4363                      .dwattr $C$DW$334, DW_AT_name("IPC3")
    4364                      .dwattr $C$DW$334, DW_AT_TI_symbol_name("_IPC3")
    4365                      .dwattr $C$DW$334, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4366                      .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4367                      .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4368              $C$DW$335       .dwtag  DW_TAG_member
    4369                      .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$19)
    4370                      .dwattr $C$DW$335, DW_AT_name("IPC4")
    4371                      .dwattr $C$DW$335, DW_AT_TI_symbol_name("_IPC4")
    4372                      .dwattr $C$DW$335, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4373                      .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4374                      .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4375              $C$DW$336       .dwtag  DW_TAG_member
    4376                      .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$19)
    4377                      .dwattr $C$DW$336, DW_AT_name("IPC5")
    4378                      .dwattr $C$DW$336, DW_AT_TI_symbol_name("_IPC5")
    4379                      .dwattr $C$DW$336, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4380                      .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4381                      .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4382              $C$DW$337       .dwtag  DW_TAG_member
    4383                      .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$19)
    4384                      .dwattr $C$DW$337, DW_AT_name("IPC6")
    4385                      .dwattr $C$DW$337, DW_AT_TI_symbol_name("_IPC6")
    4386                      .dwattr $C$DW$337, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4387                      .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4388                      .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4389              $C$DW$338       .dwtag  DW_TAG_member
    4390                      .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$19)
    4391                      .dwattr $C$DW$338, DW_AT_name("IPC7")
    4392                      .dwattr $C$DW$338, DW_AT_TI_symbol_name("_IPC7")
    4393                      .dwattr $C$DW$338, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4394                      .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4395                      .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   89

    4396              $C$DW$339       .dwtag  DW_TAG_member
    4397                      .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$19)
    4398                      .dwattr $C$DW$339, DW_AT_name("IPC8")
    4399                      .dwattr $C$DW$339, DW_AT_TI_symbol_name("_IPC8")
    4400                      .dwattr $C$DW$339, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4401                      .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4402                      .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    4403              $C$DW$340       .dwtag  DW_TAG_member
    4404                      .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$19)
    4405                      .dwattr $C$DW$340, DW_AT_name("IPC9")
    4406                      .dwattr $C$DW$340, DW_AT_TI_symbol_name("_IPC9")
    4407                      .dwattr $C$DW$340, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4408                      .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4409                      .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    4410              $C$DW$341       .dwtag  DW_TAG_member
    4411                      .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$19)
    4412                      .dwattr $C$DW$341, DW_AT_name("IPC10")
    4413                      .dwattr $C$DW$341, DW_AT_TI_symbol_name("_IPC10")
    4414                      .dwattr $C$DW$341, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4415                      .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4416                      .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    4417              $C$DW$342       .dwtag  DW_TAG_member
    4418                      .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$19)
    4419                      .dwattr $C$DW$342, DW_AT_name("IPC11")
    4420                      .dwattr $C$DW$342, DW_AT_TI_symbol_name("_IPC11")
    4421                      .dwattr $C$DW$342, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4422                      .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4423                      .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    4424              $C$DW$343       .dwtag  DW_TAG_member
    4425                      .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$19)
    4426                      .dwattr $C$DW$343, DW_AT_name("IPC12")
    4427                      .dwattr $C$DW$343, DW_AT_TI_symbol_name("_IPC12")
    4428                      .dwattr $C$DW$343, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    4429                      .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4430                      .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
    4431              $C$DW$344       .dwtag  DW_TAG_member
    4432                      .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$19)
    4433                      .dwattr $C$DW$344, DW_AT_name("IPC13")
    4434                      .dwattr $C$DW$344, DW_AT_TI_symbol_name("_IPC13")
    4435                      .dwattr $C$DW$344, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    4436                      .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4437                      .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    4438              $C$DW$345       .dwtag  DW_TAG_member
    4439                      .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$19)
    4440                      .dwattr $C$DW$345, DW_AT_name("IPC14")
    4441                      .dwattr $C$DW$345, DW_AT_TI_symbol_name("_IPC14")
    4442                      .dwattr $C$DW$345, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    4443                      .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4444                      .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    4445              $C$DW$346       .dwtag  DW_TAG_member
    4446                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$19)
    4447                      .dwattr $C$DW$346, DW_AT_name("IPC15")
    4448                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_IPC15")
    4449                      .dwattr $C$DW$346, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4450                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:08 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0818810                         PAGE   90

    4451                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    4452              $C$DW$347       .dwtag  DW_TAG_member
    4453                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$19)
    4454                      .dwattr $C$DW$347, DW_AT_name("IPC16")
    4455                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_IPC16")
    4456                      .dwattr $C$DW$347, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4457                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4458                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    4459              $C$DW$348       .dwtag  DW_TAG_member
    4460                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$19)
    4461                      .dwattr $C$DW$348, DW_AT_name("IPC17")
    4462                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_IPC17")
    4463                      .dwattr $C$DW$348, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4464                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4465                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    4466              $C$DW$349       .dwtag  DW_TAG_member
    4467                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$19)
    4468                      .dwattr $C$DW$349, DW_AT_name("IPC18")
    4469                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_IPC18")
    4470                      .dwattr $C$DW$349, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4471                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4472                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    4473              $C$DW$350       .dwtag  DW_TAG_member
    4474                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$19)
    4475                      .dwattr $C$DW$350, DW_AT_name("IPC19")
    4476                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_IPC19")
    4477                      .dwattr $C$DW$350, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
