TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:32:21 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ReadReservedFn")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_ReadReservedFn")

     254 00000054 FE82          SUBB      SP,#2                 ; [CPU_U] 
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE    6

     255                      .dwcfi  cfa_offset, -2
     256              $C$DW$16        .dwtag  DW_TAG_TI_branch
     257                      .dwattr $C$DW$16, DW_AT_low_pc(0x00)
     258                      .dwattr $C$DW$16, DW_AT_TI_return
     259 00000055 0006          LRETR     ; [CPU_] 
     260                      ; return occurs ; [] 
     261              
     262              $C$DW$17        .dwtag  DW_TAG_TI_loop
     263                      .dwattr $C$DW$17, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0608410:$C$L6:1:1391099542")
     264                      .dwattr $C$DW$17, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     265                      .dwattr $C$DW$17, DW_AT_TI_begin_line(0x8b)
     266                      .dwattr $C$DW$17, DW_AT_TI_end_line(0x8b)
     267              $C$DW$18        .dwtag  DW_TAG_TI_loop_range
     268                      .dwattr $C$DW$18, DW_AT_low_pc($C$DW$L$_Parallel_GetWordData_8bit$8$B)
     269                      .dwattr $C$DW$18, DW_AT_high_pc($C$DW$L$_Parallel_GetWordData_8bit$8$E)
     270                      .dwendtag $C$DW$17
     271              
     272              
     273              $C$DW$19        .dwtag  DW_TAG_TI_loop
     274                      .dwattr $C$DW$19, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0608410:$C$L5:1:1391099542")
     275                      .dwattr $C$DW$19, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     276                      .dwattr $C$DW$19, DW_AT_TI_begin_line(0x82)
     277                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x82)
     278              $C$DW$20        .dwtag  DW_TAG_TI_loop_range
     279                      .dwattr $C$DW$20, DW_AT_low_pc($C$DW$L$_Parallel_GetWordData_8bit$6$B)
     280                      .dwattr $C$DW$20, DW_AT_high_pc($C$DW$L$_Parallel_GetWordData_8bit$6$E)
     281                      .dwendtag $C$DW$19
     282              
     283              
     284              $C$DW$21        .dwtag  DW_TAG_TI_loop
     285                      .dwattr $C$DW$21, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0608410:$C$L4:1:1391099542")
     286                      .dwattr $C$DW$21, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     287                      .dwattr $C$DW$21, DW_AT_TI_begin_line(0x78)
     288                      .dwattr $C$DW$21, DW_AT_TI_end_line(0x78)
     289              $C$DW$22        .dwtag  DW_TAG_TI_loop_range
     290                      .dwattr $C$DW$22, DW_AT_low_pc($C$DW$L$_Parallel_GetWordData_8bit$4$B)
     291                      .dwattr $C$DW$22, DW_AT_high_pc($C$DW$L$_Parallel_GetWordData_8bit$4$E)
     292                      .dwendtag $C$DW$21
     293              
     294              
     295              $C$DW$23        .dwtag  DW_TAG_TI_loop
     296                      .dwattr $C$DW$23, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0608410:$C$L3:1:1391099542")
     297                      .dwattr $C$DW$23, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     298                      .dwattr $C$DW$23, DW_AT_TI_begin_line(0x6f)
     299                      .dwattr $C$DW$23, DW_AT_TI_end_line(0x6f)
     300              $C$DW$24        .dwtag  DW_TAG_TI_loop_range
     301                      .dwattr $C$DW$24, DW_AT_low_pc($C$DW$L$_Parallel_GetWordData_8bit$2$B)
     302                      .dwattr $C$DW$24, DW_AT_high_pc($C$DW$L$_Parallel_GetWordData_8bit$2$E)
     303                      .dwendtag $C$DW$23
     304              
     305                      .dwattr $C$DW$14, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     306                      .dwattr $C$DW$14, DW_AT_TI_end_line(0x8e)
     307                      .dwattr $C$DW$14, DW_AT_TI_end_column(0x01)
     308                      .dwendentry
     309                      .dwendtag $C$DW$14
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE    7

     310              
     311              ;**************************************************************
     312              ;* UNDEFINED EXTERNAL REFERENCES                              *
     313              ;**************************************************************
     314                      .global _ReadReservedFn
     315                      .global _CopyData
     316                      .global _GetWordData
     317                      .global _GetLongData
     318                      .global _GpioDataRegs
     319              
     320              ;***************************************************************
     321              ;* TYPE INFORMATION                                            *
     322              ;***************************************************************
     323              
     324              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     325                      .dwattr $C$DW$T$20, DW_AT_name("GPACLEAR_BITS")
     326                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     327              $C$DW$25        .dwtag  DW_TAG_member
     328                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     329                      .dwattr $C$DW$25, DW_AT_name("GPIO0")
     330                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_GPIO0")
     331                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     332                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     334              $C$DW$26        .dwtag  DW_TAG_member
     335                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     336                      .dwattr $C$DW$26, DW_AT_name("GPIO1")
     337                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_GPIO1")
     338                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     339                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     341              $C$DW$27        .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     343                      .dwattr $C$DW$27, DW_AT_name("GPIO2")
     344                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_GPIO2")
     345                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     346                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     348              $C$DW$28        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     350                      .dwattr $C$DW$28, DW_AT_name("GPIO3")
     351                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_GPIO3")
     352                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     353                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     354                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     355              $C$DW$29        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$29, DW_AT_name("GPIO4")
     358                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO4")
     359                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     360                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     361                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     362              $C$DW$30        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$30, DW_AT_name("GPIO5")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE    8

     365                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO5")
     366                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     367                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     368                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     369              $C$DW$31        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     371                      .dwattr $C$DW$31, DW_AT_name("GPIO6")
     372                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIO6")
     373                      .dwattr $C$DW$31, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     374                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     376              $C$DW$32        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     378                      .dwattr $C$DW$32, DW_AT_name("GPIO7")
     379                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIO7")
     380                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     381                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     382                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     383              $C$DW$33        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     385                      .dwattr $C$DW$33, DW_AT_name("GPIO8")
     386                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO8")
     387                      .dwattr $C$DW$33, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     388                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     390              $C$DW$34        .dwtag  DW_TAG_member
     391                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     392                      .dwattr $C$DW$34, DW_AT_name("GPIO9")
     393                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO9")
     394                      .dwattr $C$DW$34, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     395                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     396                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     397              $C$DW$35        .dwtag  DW_TAG_member
     398                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     399                      .dwattr $C$DW$35, DW_AT_name("GPIO10")
     400                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO10")
     401                      .dwattr $C$DW$35, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     402                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     403                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     404              $C$DW$36        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     406                      .dwattr $C$DW$36, DW_AT_name("GPIO11")
     407                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO11")
     408                      .dwattr $C$DW$36, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     409                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     410                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     411              $C$DW$37        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     413                      .dwattr $C$DW$37, DW_AT_name("GPIO12")
     414                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO12")
     415                      .dwattr $C$DW$37, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     416                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     417                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     418              $C$DW$38        .dwtag  DW_TAG_member
     419                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE    9

     420                      .dwattr $C$DW$38, DW_AT_name("GPIO13")
     421                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO13")
     422                      .dwattr $C$DW$38, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     423                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     425              $C$DW$39        .dwtag  DW_TAG_member
     426                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     427                      .dwattr $C$DW$39, DW_AT_name("GPIO14")
     428                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO14")
     429                      .dwattr $C$DW$39, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     430                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     431                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     432              $C$DW$40        .dwtag  DW_TAG_member
     433                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     434                      .dwattr $C$DW$40, DW_AT_name("GPIO15")
     435                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO15")
     436                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     437                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     438                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     439              $C$DW$41        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     441                      .dwattr $C$DW$41, DW_AT_name("GPIO16")
     442                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO16")
     443                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     444                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     445                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     446              $C$DW$42        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     448                      .dwattr $C$DW$42, DW_AT_name("GPIO17")
     449                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO17")
     450                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     451                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     452                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     453              $C$DW$43        .dwtag  DW_TAG_member
     454                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     455                      .dwattr $C$DW$43, DW_AT_name("GPIO18")
     456                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO18")
     457                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     458                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     459                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     460              $C$DW$44        .dwtag  DW_TAG_member
     461                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     462                      .dwattr $C$DW$44, DW_AT_name("GPIO19")
     463                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO19")
     464                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     465                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     466                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     467              $C$DW$45        .dwtag  DW_TAG_member
     468                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     469                      .dwattr $C$DW$45, DW_AT_name("GPIO20")
     470                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO20")
     471                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     472                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     473                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     474              $C$DW$46        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   10

     475                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     476                      .dwattr $C$DW$46, DW_AT_name("GPIO21")
     477                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO21")
     478                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     479                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     480                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     481              $C$DW$47        .dwtag  DW_TAG_member
     482                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     483                      .dwattr $C$DW$47, DW_AT_name("GPIO22")
     484                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO22")
     485                      .dwattr $C$DW$47, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     486                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     487                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     488              $C$DW$48        .dwtag  DW_TAG_member
     489                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     490                      .dwattr $C$DW$48, DW_AT_name("GPIO23")
     491                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO23")
     492                      .dwattr $C$DW$48, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     493                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     494                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     495              $C$DW$49        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     497                      .dwattr $C$DW$49, DW_AT_name("GPIO24")
     498                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO24")
     499                      .dwattr $C$DW$49, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     500                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     501                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     502              $C$DW$50        .dwtag  DW_TAG_member
     503                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     504                      .dwattr $C$DW$50, DW_AT_name("GPIO25")
     505                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO25")
     506                      .dwattr $C$DW$50, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     507                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     508                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     509              $C$DW$51        .dwtag  DW_TAG_member
     510                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     511                      .dwattr $C$DW$51, DW_AT_name("GPIO26")
     512                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO26")
     513                      .dwattr $C$DW$51, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     514                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     515                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     516              $C$DW$52        .dwtag  DW_TAG_member
     517                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     518                      .dwattr $C$DW$52, DW_AT_name("GPIO27")
     519                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO27")
     520                      .dwattr $C$DW$52, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     521                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     522                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     523              $C$DW$53        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     525                      .dwattr $C$DW$53, DW_AT_name("GPIO28")
     526                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO28")
     527                      .dwattr $C$DW$53, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     528                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     529                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   11

     530              $C$DW$54        .dwtag  DW_TAG_member
     531                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     532                      .dwattr $C$DW$54, DW_AT_name("GPIO29")
     533                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO29")
     534                      .dwattr $C$DW$54, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     535                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     536                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     537              $C$DW$55        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     539                      .dwattr $C$DW$55, DW_AT_name("GPIO30")
     540                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO30")
     541                      .dwattr $C$DW$55, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     542                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     543                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     544              $C$DW$56        .dwtag  DW_TAG_member
     545                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     546                      .dwattr $C$DW$56, DW_AT_name("GPIO31")
     547                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO31")
     548                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     549                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     550                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     551                      .dwendtag $C$DW$T$20
     552              
     553              
     554              $C$DW$T$22      .dwtag  DW_TAG_union_type
     555                      .dwattr $C$DW$T$22, DW_AT_name("GPACLEAR_REG")
     556                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     557              $C$DW$57        .dwtag  DW_TAG_member
     558                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     559                      .dwattr $C$DW$57, DW_AT_name("all")
     560                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_all")
     561                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     563              $C$DW$58        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     565                      .dwattr $C$DW$58, DW_AT_name("bit")
     566                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_bit")
     567                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     568                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     569                      .dwendtag $C$DW$T$22
     570              
     571              
     572              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     573                      .dwattr $C$DW$T$23, DW_AT_name("GPADAT_BITS")
     574                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     575              $C$DW$59        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     577                      .dwattr $C$DW$59, DW_AT_name("GPIO0")
     578                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO0")
     579                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     580                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     582              $C$DW$60        .dwtag  DW_TAG_member
     583                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     584                      .dwattr $C$DW$60, DW_AT_name("GPIO1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   12

     585                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO1")
     586                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     587                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     589              $C$DW$61        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     591                      .dwattr $C$DW$61, DW_AT_name("GPIO2")
     592                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO2")
     593                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     594                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     595                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     596              $C$DW$62        .dwtag  DW_TAG_member
     597                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     598                      .dwattr $C$DW$62, DW_AT_name("GPIO3")
     599                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO3")
     600                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     601                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     603              $C$DW$63        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     605                      .dwattr $C$DW$63, DW_AT_name("GPIO4")
     606                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO4")
     607                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     608                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     610              $C$DW$64        .dwtag  DW_TAG_member
     611                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     612                      .dwattr $C$DW$64, DW_AT_name("GPIO5")
     613                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO5")
     614                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     615                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     616                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     617              $C$DW$65        .dwtag  DW_TAG_member
     618                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     619                      .dwattr $C$DW$65, DW_AT_name("GPIO6")
     620                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO6")
     621                      .dwattr $C$DW$65, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     622                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     623                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     624              $C$DW$66        .dwtag  DW_TAG_member
     625                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     626                      .dwattr $C$DW$66, DW_AT_name("GPIO7")
     627                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO7")
     628                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     629                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     631              $C$DW$67        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     633                      .dwattr $C$DW$67, DW_AT_name("GPIO8")
     634                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO8")
     635                      .dwattr $C$DW$67, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     636                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     637                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     638              $C$DW$68        .dwtag  DW_TAG_member
     639                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   13

     640                      .dwattr $C$DW$68, DW_AT_name("GPIO9")
     641                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO9")
     642                      .dwattr $C$DW$68, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     643                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     645              $C$DW$69        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     647                      .dwattr $C$DW$69, DW_AT_name("GPIO10")
     648                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO10")
     649                      .dwattr $C$DW$69, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     650                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     652              $C$DW$70        .dwtag  DW_TAG_member
     653                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     654                      .dwattr $C$DW$70, DW_AT_name("GPIO11")
     655                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO11")
     656                      .dwattr $C$DW$70, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     657                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     658                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     659              $C$DW$71        .dwtag  DW_TAG_member
     660                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     661                      .dwattr $C$DW$71, DW_AT_name("GPIO12")
     662                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO12")
     663                      .dwattr $C$DW$71, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     664                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     665                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     666              $C$DW$72        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$72, DW_AT_name("GPIO13")
     669                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO13")
     670                      .dwattr $C$DW$72, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     671                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$73        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     675                      .dwattr $C$DW$73, DW_AT_name("GPIO14")
     676                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO14")
     677                      .dwattr $C$DW$73, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     678                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     680              $C$DW$74        .dwtag  DW_TAG_member
     681                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     682                      .dwattr $C$DW$74, DW_AT_name("GPIO15")
     683                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO15")
     684                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     685                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     686                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     687              $C$DW$75        .dwtag  DW_TAG_member
     688                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     689                      .dwattr $C$DW$75, DW_AT_name("GPIO16")
     690                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO16")
     691                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     692                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     693                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     694              $C$DW$76        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   14

     695                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     696                      .dwattr $C$DW$76, DW_AT_name("GPIO17")
     697                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO17")
     698                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     699                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     700                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     701              $C$DW$77        .dwtag  DW_TAG_member
     702                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     703                      .dwattr $C$DW$77, DW_AT_name("GPIO18")
     704                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO18")
     705                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     706                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     707                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     708              $C$DW$78        .dwtag  DW_TAG_member
     709                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     710                      .dwattr $C$DW$78, DW_AT_name("GPIO19")
     711                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO19")
     712                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     713                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     714                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$79        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     717                      .dwattr $C$DW$79, DW_AT_name("GPIO20")
     718                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO20")
     719                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     720                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     721                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     722              $C$DW$80        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     724                      .dwattr $C$DW$80, DW_AT_name("GPIO21")
     725                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO21")
     726                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     727                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     728                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     729              $C$DW$81        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     731                      .dwattr $C$DW$81, DW_AT_name("GPIO22")
     732                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO22")
     733                      .dwattr $C$DW$81, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     734                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     735                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     736              $C$DW$82        .dwtag  DW_TAG_member
     737                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     738                      .dwattr $C$DW$82, DW_AT_name("GPIO23")
     739                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO23")
     740                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     741                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     742                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     743              $C$DW$83        .dwtag  DW_TAG_member
     744                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     745                      .dwattr $C$DW$83, DW_AT_name("GPIO24")
     746                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO24")
     747                      .dwattr $C$DW$83, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     748                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     749                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   15

     750              $C$DW$84        .dwtag  DW_TAG_member
     751                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     752                      .dwattr $C$DW$84, DW_AT_name("GPIO25")
     753                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO25")
     754                      .dwattr $C$DW$84, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     755                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     756                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     757              $C$DW$85        .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     759                      .dwattr $C$DW$85, DW_AT_name("GPIO26")
     760                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO26")
     761                      .dwattr $C$DW$85, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     762                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     763                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     764              $C$DW$86        .dwtag  DW_TAG_member
     765                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     766                      .dwattr $C$DW$86, DW_AT_name("GPIO27")
     767                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO27")
     768                      .dwattr $C$DW$86, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     769                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     770                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     771              $C$DW$87        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     773                      .dwattr $C$DW$87, DW_AT_name("GPIO28")
     774                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO28")
     775                      .dwattr $C$DW$87, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     776                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     777                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     778              $C$DW$88        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     780                      .dwattr $C$DW$88, DW_AT_name("GPIO29")
     781                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO29")
     782                      .dwattr $C$DW$88, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     783                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     784                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     785              $C$DW$89        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     787                      .dwattr $C$DW$89, DW_AT_name("GPIO30")
     788                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO30")
     789                      .dwattr $C$DW$89, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     790                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     791                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$90        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$90, DW_AT_name("GPIO31")
     795                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO31")
     796                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     797                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     798                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     799                      .dwendtag $C$DW$T$23
     800              
     801              
     802              $C$DW$T$24      .dwtag  DW_TAG_union_type
     803                      .dwattr $C$DW$T$24, DW_AT_name("GPADAT_REG")
     804                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   16

     805              $C$DW$91        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
     807                      .dwattr $C$DW$91, DW_AT_name("all")
     808                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
     809                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$92        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$23)
     813                      .dwattr $C$DW$92, DW_AT_name("bit")
     814                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
     815                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     817                      .dwendtag $C$DW$T$24
     818              
     819              
     820              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     821                      .dwattr $C$DW$T$25, DW_AT_name("GPASET_BITS")
     822                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     823              $C$DW$93        .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     825                      .dwattr $C$DW$93, DW_AT_name("GPIO0")
     826                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO0")
     827                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     828                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     830              $C$DW$94        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$94, DW_AT_name("GPIO1")
     833                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO1")
     834                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     835                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     837              $C$DW$95        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$95, DW_AT_name("GPIO2")
     840                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO2")
     841                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     842                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     844              $C$DW$96        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$96, DW_AT_name("GPIO3")
     847                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO3")
     848                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     849                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     851              $C$DW$97        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$97, DW_AT_name("GPIO4")
     854                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO4")
     855                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     856                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     857                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     858              $C$DW$98        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   17

     860                      .dwattr $C$DW$98, DW_AT_name("GPIO5")
     861                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO5")
     862                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     863                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     864                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$99        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$99, DW_AT_name("GPIO6")
     868                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO6")
     869                      .dwattr $C$DW$99, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     870                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     872              $C$DW$100       .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     874                      .dwattr $C$DW$100, DW_AT_name("GPIO7")
     875                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO7")
     876                      .dwattr $C$DW$100, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     877                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     878                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     879              $C$DW$101       .dwtag  DW_TAG_member
     880                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     881                      .dwattr $C$DW$101, DW_AT_name("GPIO8")
     882                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO8")
     883                      .dwattr $C$DW$101, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     884                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     886              $C$DW$102       .dwtag  DW_TAG_member
     887                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     888                      .dwattr $C$DW$102, DW_AT_name("GPIO9")
     889                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO9")
     890                      .dwattr $C$DW$102, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     891                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     893              $C$DW$103       .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     895                      .dwattr $C$DW$103, DW_AT_name("GPIO10")
     896                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO10")
     897                      .dwattr $C$DW$103, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     898                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     900              $C$DW$104       .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$104, DW_AT_name("GPIO11")
     903                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO11")
     904                      .dwattr $C$DW$104, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     905                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$105       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     909                      .dwattr $C$DW$105, DW_AT_name("GPIO12")
     910                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO12")
     911                      .dwattr $C$DW$105, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     912                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     914              $C$DW$106       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   18

     915                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$106, DW_AT_name("GPIO13")
     917                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO13")
     918                      .dwattr $C$DW$106, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     919                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     921              $C$DW$107       .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$107, DW_AT_name("GPIO14")
     924                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO14")
     925                      .dwattr $C$DW$107, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     926                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$108       .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$108, DW_AT_name("GPIO15")
     931                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO15")
     932                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     933                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$109       .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$109, DW_AT_name("GPIO16")
     938                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO16")
     939                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     940                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     941                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$110       .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$110, DW_AT_name("GPIO17")
     945                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO17")
     946                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     947                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     948                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$111       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$111, DW_AT_name("GPIO18")
     952                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO18")
     953                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     954                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     955                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$112       .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$112, DW_AT_name("GPIO19")
     959                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO19")
     960                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     961                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     962                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     963              $C$DW$113       .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$113, DW_AT_name("GPIO20")
     966                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO20")
     967                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     968                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     969                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   19

     970              $C$DW$114       .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     972                      .dwattr $C$DW$114, DW_AT_name("GPIO21")
     973                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO21")
     974                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     975                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     976                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     977              $C$DW$115       .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$115, DW_AT_name("GPIO22")
     980                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO22")
     981                      .dwattr $C$DW$115, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     982                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     983                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     984              $C$DW$116       .dwtag  DW_TAG_member
     985                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
     986                      .dwattr $C$DW$116, DW_AT_name("GPIO23")
     987                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO23")
     988                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     989                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     990                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     991              $C$DW$117       .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
     993                      .dwattr $C$DW$117, DW_AT_name("GPIO24")
     994                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO24")
     995                      .dwattr $C$DW$117, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     996                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     997                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     998              $C$DW$118       .dwtag  DW_TAG_member
     999                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1000                      .dwattr $C$DW$118, DW_AT_name("GPIO25")
    1001                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO25")
    1002                      .dwattr $C$DW$118, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1003                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1004                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1005              $C$DW$119       .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1007                      .dwattr $C$DW$119, DW_AT_name("GPIO26")
    1008                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO26")
    1009                      .dwattr $C$DW$119, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1010                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1011                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1012              $C$DW$120       .dwtag  DW_TAG_member
    1013                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1014                      .dwattr $C$DW$120, DW_AT_name("GPIO27")
    1015                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO27")
    1016                      .dwattr $C$DW$120, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1017                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1018                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1019              $C$DW$121       .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1021                      .dwattr $C$DW$121, DW_AT_name("GPIO28")
    1022                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO28")
    1023                      .dwattr $C$DW$121, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1024                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   20

    1025                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1026              $C$DW$122       .dwtag  DW_TAG_member
    1027                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1028                      .dwattr $C$DW$122, DW_AT_name("GPIO29")
    1029                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO29")
    1030                      .dwattr $C$DW$122, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1031                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1032                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$123       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1035                      .dwattr $C$DW$123, DW_AT_name("GPIO30")
    1036                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO30")
    1037                      .dwattr $C$DW$123, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1038                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1039                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1040              $C$DW$124       .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$124, DW_AT_name("GPIO31")
    1043                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO31")
    1044                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1045                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1046                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1047                      .dwendtag $C$DW$T$25
    1048              
    1049              
    1050              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1051                      .dwattr $C$DW$T$26, DW_AT_name("GPASET_REG")
    1052                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1053              $C$DW$125       .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1055                      .dwattr $C$DW$125, DW_AT_name("all")
    1056                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1057                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$126       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$25)
    1061                      .dwattr $C$DW$126, DW_AT_name("bit")
    1062                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1063                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1065                      .dwendtag $C$DW$T$26
    1066              
    1067              
    1068              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1069                      .dwattr $C$DW$T$27, DW_AT_name("GPATOGGLE_BITS")
    1070                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1071              $C$DW$127       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$127, DW_AT_name("GPIO0")
    1074                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO0")
    1075                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1076                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$128       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   21

    1080                      .dwattr $C$DW$128, DW_AT_name("GPIO1")
    1081                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO1")
    1082                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1083                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$129       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$129, DW_AT_name("GPIO2")
    1088                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO2")
    1089                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1090                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1091                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1092              $C$DW$130       .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$130, DW_AT_name("GPIO3")
    1095                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO3")
    1096                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1097                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1098                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$131       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$131, DW_AT_name("GPIO4")
    1102                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO4")
    1103                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1104                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1106              $C$DW$132       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$132, DW_AT_name("GPIO5")
    1109                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO5")
    1110                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1111                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$133       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$133, DW_AT_name("GPIO6")
    1116                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO6")
    1117                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1118                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$134       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$134, DW_AT_name("GPIO7")
    1123                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO7")
    1124                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1125                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1127              $C$DW$135       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$135, DW_AT_name("GPIO8")
    1130                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO8")
    1131                      .dwattr $C$DW$135, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1132                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1133                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1134              $C$DW$136       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   22

    1135                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1136                      .dwattr $C$DW$136, DW_AT_name("GPIO9")
    1137                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO9")
    1138                      .dwattr $C$DW$136, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1139                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1140                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$137       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1143                      .dwattr $C$DW$137, DW_AT_name("GPIO10")
    1144                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO10")
    1145                      .dwattr $C$DW$137, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1146                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1147                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1148              $C$DW$138       .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$138, DW_AT_name("GPIO11")
    1151                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO11")
    1152                      .dwattr $C$DW$138, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1153                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1155              $C$DW$139       .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$139, DW_AT_name("GPIO12")
    1158                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO12")
    1159                      .dwattr $C$DW$139, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1160                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1162              $C$DW$140       .dwtag  DW_TAG_member
    1163                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1164                      .dwattr $C$DW$140, DW_AT_name("GPIO13")
    1165                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO13")
    1166                      .dwattr $C$DW$140, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1167                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1169              $C$DW$141       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1171                      .dwattr $C$DW$141, DW_AT_name("GPIO14")
    1172                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO14")
    1173                      .dwattr $C$DW$141, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1174                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1176              $C$DW$142       .dwtag  DW_TAG_member
    1177                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1178                      .dwattr $C$DW$142, DW_AT_name("GPIO15")
    1179                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO15")
    1180                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1181                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1183              $C$DW$143       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$143, DW_AT_name("GPIO16")
    1186                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO16")
    1187                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1189                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   23

    1190              $C$DW$144       .dwtag  DW_TAG_member
    1191                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$144, DW_AT_name("GPIO17")
    1193                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO17")
    1194                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1195                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1196                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1197              $C$DW$145       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1199                      .dwattr $C$DW$145, DW_AT_name("GPIO18")
    1200                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO18")
    1201                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1202                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1203                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1204              $C$DW$146       .dwtag  DW_TAG_member
    1205                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1206                      .dwattr $C$DW$146, DW_AT_name("GPIO19")
    1207                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO19")
    1208                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1209                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1210                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1211              $C$DW$147       .dwtag  DW_TAG_member
    1212                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1213                      .dwattr $C$DW$147, DW_AT_name("GPIO20")
    1214                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO20")
    1215                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1216                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1217                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1218              $C$DW$148       .dwtag  DW_TAG_member
    1219                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1220                      .dwattr $C$DW$148, DW_AT_name("GPIO21")
    1221                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO21")
    1222                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1223                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1224                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1225              $C$DW$149       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$149, DW_AT_name("GPIO22")
    1228                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO22")
    1229                      .dwattr $C$DW$149, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1230                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1231                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1232              $C$DW$150       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$150, DW_AT_name("GPIO23")
    1235                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO23")
    1236                      .dwattr $C$DW$150, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1237                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1238                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1239              $C$DW$151       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$151, DW_AT_name("GPIO24")
    1242                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO24")
    1243                      .dwattr $C$DW$151, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1244                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   24

    1245                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1246              $C$DW$152       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1248                      .dwattr $C$DW$152, DW_AT_name("GPIO25")
    1249                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO25")
    1250                      .dwattr $C$DW$152, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1251                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1252                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$153       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$153, DW_AT_name("GPIO26")
    1256                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO26")
    1257                      .dwattr $C$DW$153, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1258                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1259                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1260              $C$DW$154       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$154, DW_AT_name("GPIO27")
    1263                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO27")
    1264                      .dwattr $C$DW$154, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1265                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1266                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$155       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$155, DW_AT_name("GPIO28")
    1270                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO28")
    1271                      .dwattr $C$DW$155, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1272                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1273                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1274              $C$DW$156       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1276                      .dwattr $C$DW$156, DW_AT_name("GPIO29")
    1277                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO29")
    1278                      .dwattr $C$DW$156, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1279                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1280                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1281              $C$DW$157       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$157, DW_AT_name("GPIO30")
    1284                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO30")
    1285                      .dwattr $C$DW$157, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1286                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1287                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1288              $C$DW$158       .dwtag  DW_TAG_member
    1289                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1290                      .dwattr $C$DW$158, DW_AT_name("GPIO31")
    1291                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO31")
    1292                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1293                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1294                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1295                      .dwendtag $C$DW$T$27
    1296              
    1297              
    1298              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1299                      .dwattr $C$DW$T$28, DW_AT_name("GPATOGGLE_REG")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   25

    1300                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1301              $C$DW$159       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    1303                      .dwattr $C$DW$159, DW_AT_name("all")
    1304                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    1305                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$160       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$27)
    1309                      .dwattr $C$DW$160, DW_AT_name("bit")
    1310                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    1311                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1313                      .dwendtag $C$DW$T$28
    1314              
    1315              
    1316              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1317                      .dwattr $C$DW$T$29, DW_AT_name("GPBCLEAR_BITS")
    1318                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1319              $C$DW$161       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$161, DW_AT_name("GPIO32")
    1322                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO32")
    1323                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$162       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$162, DW_AT_name("GPIO33")
    1329                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO33")
    1330                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1331                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$163       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$163, DW_AT_name("GPIO34")
    1336                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO34")
    1337                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$164       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$164, DW_AT_name("GPIO35")
    1343                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO35")
    1344                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1345                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$165       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$165, DW_AT_name("GPIO36")
    1350                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO36")
    1351                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1352                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$166       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   26

    1355                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$166, DW_AT_name("GPIO37")
    1357                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO37")
    1358                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1359                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1360                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1361              $C$DW$167       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$167, DW_AT_name("GPIO38")
    1364                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO38")
    1365                      .dwattr $C$DW$167, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1366                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$168       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$168, DW_AT_name("GPIO39")
    1371                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO39")
    1372                      .dwattr $C$DW$168, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1373                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1374                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1375              $C$DW$169       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1377                      .dwattr $C$DW$169, DW_AT_name("GPIO40")
    1378                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO40")
    1379                      .dwattr $C$DW$169, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1380                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1381                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$170       .dwtag  DW_TAG_member
    1383                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1384                      .dwattr $C$DW$170, DW_AT_name("GPIO41")
    1385                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO41")
    1386                      .dwattr $C$DW$170, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1387                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1389              $C$DW$171       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1391                      .dwattr $C$DW$171, DW_AT_name("GPIO42")
    1392                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO42")
    1393                      .dwattr $C$DW$171, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1394                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1396              $C$DW$172       .dwtag  DW_TAG_member
    1397                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1398                      .dwattr $C$DW$172, DW_AT_name("GPIO43")
    1399                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO43")
    1400                      .dwattr $C$DW$172, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1401                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1403              $C$DW$173       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$173, DW_AT_name("GPIO44")
    1406                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO44")
    1407                      .dwattr $C$DW$173, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1408                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1409                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0608410                         PAGE   27

    1410              $C$DW$174       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1412                      .dwattr $C$DW$174, DW_AT_name("GPIO45")
    1413                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO45")
    1414                      .dwattr $C$DW$174, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1415                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1416                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1417              $C$DW$175       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1419                      .dwattr $C$DW$175, DW_AT_name("GPIO46")
    1420                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO46")
    1421                      .dwattr $C$DW$175, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1422                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$176       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1426                      .dwattr $C$DW$176, DW_AT_name("GPIO47")
    1427                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO47")
    1428                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1429                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1430                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1431              $C$DW$177       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1433                      .dwattr $C$DW$177, DW_AT_name("GPIO48")
    1434                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO48")
    1435                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1436                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1437                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1438              $C$DW$178       .dwtag  DW_TAG_member
    1439                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1440                      .dwattr $C$DW$178, DW_AT_name("GPIO49")
    1441                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO49")
    1442                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1443                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1444                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1445              $C$DW$179       .dwtag  DW_TAG_member
    1446                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1447                      .dwattr $C$DW$179, DW_AT_name("GPIO50")
    1448                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO50")
    1449                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1450                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1451                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1452              $C$DW$180       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$180, DW_AT_name("GPIO51")
    1455                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO51")
