TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:32:27 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("ReadReservedFn")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_ReadReservedFn")

     321 00000067       $C$DW$L$_SCIA_GetWordData$4$B:
     322                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     323 00000067 CC05!         AND       AL,@_SciaRegs+5,#0x0040 ; [CPU_] |157| 
         00000068 0040 
     324 00000069 FFC5          LSR       AL,6                  ; [CPU_] |157| 
     325 0000006a 5201          CMPB      AL,#1                 ; [CPU_] |157| 
     326 0000006b EDFC          BF        $C$L7,NEQ             ; [CPU_] |157| 
     327                      ; branchcc occurs ; [] |157| 
     328 0000006c       $C$DW$L$_SCIA_GetWordData$4$E:
     329                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     330 0000006c C607!         MOVB      AL.LSB,@_SciaRegs+7   ; [CPU_] |158| 
     331 0000006d 9642          MOV       *-SP[2],AL            ; [CPU_] |158| 
     332                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     333 0000006e 9609!         MOV       @_SciaRegs+9,AL       ; [CPU_] |159| 
     334                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     335 0000006f 5603          MOV       ACC,*-SP[2] << #8     ; [CPU_] |162| 
         00000070 0842 
     336 00000071 9841          OR        *-SP[1],AL            ; [CPU_] |162| 
     337                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     338 00000072 9241          MOV       AL,*-SP[1]            ; [CPU_] |164| 
     339                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     340 00000073 FE82          SUBB      SP,#2                 ; [CPU_U] 
     341                      .dwcfi  cfa_offset, -2
     342              $C$DW$24        .dwtag  DW_TAG_TI_branch
     343                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     344                      .dwattr $C$DW$24, DW_AT_TI_return
     345 00000074 0006          LRETR     ; [CPU_] 
     346                      ; return occurs ; [] 
     347              
     348              $C$DW$25        .dwtag  DW_TAG_TI_loop
     349                      .dwattr $C$DW$25, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0396410:$C$L7:1:1391099547")
     350                      .dwattr $C$DW$25, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     351                      .dwattr $C$DW$25, DW_AT_TI_begin_line(0x9d)
     352                      .dwattr $C$DW$25, DW_AT_TI_end_line(0x9d)
     353              $C$DW$26        .dwtag  DW_TAG_TI_loop_range
     354                      .dwattr $C$DW$26, DW_AT_low_pc($C$DW$L$_SCIA_GetWordData$4$B)
     355                      .dwattr $C$DW$26, DW_AT_high_pc($C$DW$L$_SCIA_GetWordData$4$E)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE    8

     356                      .dwendtag $C$DW$25
     357              
     358              
     359              $C$DW$27        .dwtag  DW_TAG_TI_loop
     360                      .dwattr $C$DW$27, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0396410:$C$L6:1:1391099547")
     361                      .dwattr $C$DW$27, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     362                      .dwattr $C$DW$27, DW_AT_TI_begin_line(0x98)
     363                      .dwattr $C$DW$27, DW_AT_TI_end_line(0x98)
     364              $C$DW$28        .dwtag  DW_TAG_TI_loop_range
     365                      .dwattr $C$DW$28, DW_AT_low_pc($C$DW$L$_SCIA_GetWordData$2$B)
     366                      .dwattr $C$DW$28, DW_AT_high_pc($C$DW$L$_SCIA_GetWordData$2$E)
     367                      .dwendtag $C$DW$27
     368              
     369                      .dwattr $C$DW$21, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     370                      .dwattr $C$DW$21, DW_AT_TI_end_line(0xa5)
     371                      .dwattr $C$DW$21, DW_AT_TI_end_column(0x01)
     372                      .dwendentry
     373                      .dwendtag $C$DW$21
     374              
     375              ;**************************************************************
     376              ;* UNDEFINED EXTERNAL REFERENCES                              *
     377              ;**************************************************************
     378                      .global _ReadReservedFn
     379                      .global _CopyData
     380                      .global _GetLongData
     381                      .global _GetWordData
     382                      .global _SciaRegs
     383                      .global _ClkCfgRegs
     384                      .global _CpuSysRegs
     385              
     386              ;***************************************************************
     387              ;* TYPE INFORMATION                                            *
     388              ;***************************************************************
     389              
     390              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     391                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
     392                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     393              $C$DW$29        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     395                      .dwattr $C$DW$29, DW_AT_name("AUXPLLDIV")
     396                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_AUXPLLDIV")
     397                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     398                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     399                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     400              $C$DW$30        .dwtag  DW_TAG_member
     401                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     402                      .dwattr $C$DW$30, DW_AT_name("rsvd1")
     403                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd1")
     404                      .dwattr $C$DW$30, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     405                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     406                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     407              $C$DW$31        .dwtag  DW_TAG_member
     408                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     409                      .dwattr $C$DW$31, DW_AT_name("rsvd2")
     410                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE    9

     411                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     412                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     413                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     414                      .dwendtag $C$DW$T$20
     415              
     416              
     417              $C$DW$T$22      .dwtag  DW_TAG_union_type
     418                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
     419                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     420              $C$DW$32        .dwtag  DW_TAG_member
     421                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$21)
     422                      .dwattr $C$DW$32, DW_AT_name("all")
     423                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_all")
     424                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     425                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     426              $C$DW$33        .dwtag  DW_TAG_member
     427                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     428                      .dwattr $C$DW$33, DW_AT_name("bit")
     429                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bit")
     430                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     431                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     432                      .dwendtag $C$DW$T$22
     433              
     434              
     435              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     436                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
     437                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     438              $C$DW$34        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     440                      .dwattr $C$DW$34, DW_AT_name("PLLEN")
     441                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_PLLEN")
     442                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     443                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     445              $C$DW$35        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     447                      .dwattr $C$DW$35, DW_AT_name("PLLCLKEN")
     448                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_PLLCLKEN")
     449                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     450                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     451                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     452              $C$DW$36        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$36, DW_AT_name("rsvd1")
     455                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_rsvd1")
     456                      .dwattr $C$DW$36, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     457                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     458                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     459              $C$DW$37        .dwtag  DW_TAG_member
     460                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     461                      .dwattr $C$DW$37, DW_AT_name("rsvd2")
     462                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd2")
     463                      .dwattr $C$DW$37, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     464                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     465                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   10

     466                      .dwendtag $C$DW$T$23
     467              
     468              
     469              $C$DW$T$24      .dwtag  DW_TAG_union_type
     470                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
     471                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     472              $C$DW$38        .dwtag  DW_TAG_member
     473                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$21)
     474                      .dwattr $C$DW$38, DW_AT_name("all")
     475                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_all")
     476                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     477                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     478              $C$DW$39        .dwtag  DW_TAG_member
     479                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$23)
     480                      .dwattr $C$DW$39, DW_AT_name("bit")
     481                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_bit")
     482                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     484                      .dwendtag $C$DW$T$24
     485              
     486              
     487              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     488                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
     489                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     490              $C$DW$40        .dwtag  DW_TAG_member
     491                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     492                      .dwattr $C$DW$40, DW_AT_name("IMULT")
     493                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_IMULT")
     494                      .dwattr $C$DW$40, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
     495                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     496                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     497              $C$DW$41        .dwtag  DW_TAG_member
     498                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     499                      .dwattr $C$DW$41, DW_AT_name("rsvd1")
     500                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_rsvd1")
     501                      .dwattr $C$DW$41, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     502                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     503                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     504              $C$DW$42        .dwtag  DW_TAG_member
     505                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     506                      .dwattr $C$DW$42, DW_AT_name("FMULT")
     507                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_FMULT")
     508                      .dwattr $C$DW$42, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     509                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     510                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     511              $C$DW$43        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$43, DW_AT_name("rsvd2")
     514                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_rsvd2")
     515                      .dwattr $C$DW$43, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     516                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     517                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     518              $C$DW$44        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$44, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   11

     521                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_rsvd3")
     522                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     523                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     524                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     525                      .dwendtag $C$DW$T$25
     526              
     527              
     528              $C$DW$T$26      .dwtag  DW_TAG_union_type
     529                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
     530                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     531              $C$DW$45        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$21)
     533                      .dwattr $C$DW$45, DW_AT_name("all")
     534                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_all")
     535                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     537              $C$DW$46        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$25)
     539                      .dwattr $C$DW$46, DW_AT_name("bit")
     540                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_bit")
     541                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     543                      .dwendtag $C$DW$T$26
     544              
     545              
     546              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     547                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
     548                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     549              $C$DW$47        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     551                      .dwattr $C$DW$47, DW_AT_name("LOCKS")
     552                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_LOCKS")
     553                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     554                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     555                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     556              $C$DW$48        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$48, DW_AT_name("SLIPS")
     559                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_SLIPS")
     560                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     561                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     563              $C$DW$49        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     565                      .dwattr $C$DW$49, DW_AT_name("rsvd1")
     566                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_rsvd1")
     567                      .dwattr $C$DW$49, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     568                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     570              $C$DW$50        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$50, DW_AT_name("rsvd2")
     573                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd2")
     574                      .dwattr $C$DW$50, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     575                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   12

     576                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     577                      .dwendtag $C$DW$T$27
     578              
     579              
     580              $C$DW$T$28      .dwtag  DW_TAG_union_type
     581                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
     582                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     583              $C$DW$51        .dwtag  DW_TAG_member
     584                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$21)
     585                      .dwattr $C$DW$51, DW_AT_name("all")
     586                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_all")
     587                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     588                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     589              $C$DW$52        .dwtag  DW_TAG_member
     590                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$27)
     591                      .dwattr $C$DW$52, DW_AT_name("bit")
     592                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_bit")
     593                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     594                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     595                      .dwendtag $C$DW$T$28
     596              
     597              
     598              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     599                      .dwattr $C$DW$T$29, DW_AT_name("CCR_BITS")
     600                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     601              $C$DW$53        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$53, DW_AT_name("VMAPS")
     604                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_VMAPS")
     605                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     606                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     608              $C$DW$54        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     610                      .dwattr $C$DW$54, DW_AT_name("MONPRIV")
     611                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_MONPRIV")
     612                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     613                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     615              $C$DW$55        .dwtag  DW_TAG_member
     616                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     617                      .dwattr $C$DW$55, DW_AT_name("ENPROT")
     618                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_ENPROT")
     619                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     620                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     621                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     622              $C$DW$56        .dwtag  DW_TAG_member
     623                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     624                      .dwattr $C$DW$56, DW_AT_name("rsvd1")
     625                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd1")
     626                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     627                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     628                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     629              $C$DW$57        .dwtag  DW_TAG_member
     630                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   13

     631                      .dwattr $C$DW$57, DW_AT_name("rsvd2")
     632                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd2")
     633                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     634                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     635                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     636                      .dwendtag $C$DW$T$29
     637              
     638              
     639              $C$DW$T$30      .dwtag  DW_TAG_union_type
     640                      .dwattr $C$DW$T$30, DW_AT_name("CCR_REG")
     641                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     642              $C$DW$58        .dwtag  DW_TAG_member
     643                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     644                      .dwattr $C$DW$58, DW_AT_name("all")
     645                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     646                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     647                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     648              $C$DW$59        .dwtag  DW_TAG_member
     649                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$29)
     650                      .dwattr $C$DW$59, DW_AT_name("bit")
     651                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     652                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     653                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     654                      .dwendtag $C$DW$T$30
     655              
     656              
     657              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     658                      .dwattr $C$DW$T$31, DW_AT_name("CLKCFGLOCK1_BITS")
     659                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     660              $C$DW$60        .dwtag  DW_TAG_member
     661                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     662                      .dwattr $C$DW$60, DW_AT_name("CLKSRCCTL1")
     663                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CLKSRCCTL1")
     664                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     665                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     666                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     667              $C$DW$61        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$61, DW_AT_name("CLKSRCCTL2")
     670                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CLKSRCCTL2")
     671                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     672                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     673                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     674              $C$DW$62        .dwtag  DW_TAG_member
     675                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     676                      .dwattr $C$DW$62, DW_AT_name("CLKSRCCTL3")
     677                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_CLKSRCCTL3")
     678                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     679                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     680                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     681              $C$DW$63        .dwtag  DW_TAG_member
     682                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     683                      .dwattr $C$DW$63, DW_AT_name("SYSPLLCTL1")
     684                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_SYSPLLCTL1")
     685                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   14

     686                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     687                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     688              $C$DW$64        .dwtag  DW_TAG_member
     689                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     690                      .dwattr $C$DW$64, DW_AT_name("SYSPLLCTL2")
     691                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_SYSPLLCTL2")
     692                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     693                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     694                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     695              $C$DW$65        .dwtag  DW_TAG_member
     696                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     697                      .dwattr $C$DW$65, DW_AT_name("SYSPLLCTL3")
     698                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_SYSPLLCTL3")
     699                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     700                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     701                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     702              $C$DW$66        .dwtag  DW_TAG_member
     703                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     704                      .dwattr $C$DW$66, DW_AT_name("SYSPLLMULT")
     705                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_SYSPLLMULT")
     706                      .dwattr $C$DW$66, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     707                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     708                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     709              $C$DW$67        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     711                      .dwattr $C$DW$67, DW_AT_name("AUXPLLCTL1")
     712                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_AUXPLLCTL1")
     713                      .dwattr $C$DW$67, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     714                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     716              $C$DW$68        .dwtag  DW_TAG_member
     717                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     718                      .dwattr $C$DW$68, DW_AT_name("rsvd1")
     719                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd1")
     720                      .dwattr $C$DW$68, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     721                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     723              $C$DW$69        .dwtag  DW_TAG_member
     724                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     725                      .dwattr $C$DW$69, DW_AT_name("AUXPLLMULT")
     726                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_AUXPLLMULT")
     727                      .dwattr $C$DW$69, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     728                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     730              $C$DW$70        .dwtag  DW_TAG_member
     731                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     732                      .dwattr $C$DW$70, DW_AT_name("SYSCLKDIVSEL")
     733                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
     734                      .dwattr $C$DW$70, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     735                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     737              $C$DW$71        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     739                      .dwattr $C$DW$71, DW_AT_name("AUXCLKDIVSEL")
     740                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   15

     741                      .dwattr $C$DW$71, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     742                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     743                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     744              $C$DW$72        .dwtag  DW_TAG_member
     745                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     746                      .dwattr $C$DW$72, DW_AT_name("PERCLKDIVSEL")
     747                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
     748                      .dwattr $C$DW$72, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     749                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     750                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$73        .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     753                      .dwattr $C$DW$73, DW_AT_name("rsvd2")
     754                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd2")
     755                      .dwattr $C$DW$73, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     756                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     757                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     758              $C$DW$74        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$74, DW_AT_name("LOSPCP")
     761                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_LOSPCP")
     762                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     763                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     765              $C$DW$75        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$75, DW_AT_name("rsvd3")
     768                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd3")
     769                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     770                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     771                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     772                      .dwendtag $C$DW$T$31
     773              
     774              
     775              $C$DW$T$32      .dwtag  DW_TAG_union_type
     776                      .dwattr $C$DW$T$32, DW_AT_name("CLKCFGLOCK1_REG")
     777                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     778              $C$DW$76        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
     780                      .dwattr $C$DW$76, DW_AT_name("all")
     781                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
     782                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     784              $C$DW$77        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$31)
     786                      .dwattr $C$DW$77, DW_AT_name("bit")
     787                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     788                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     790                      .dwendtag $C$DW$T$32
     791              
     792              
     793              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     794                      .dwattr $C$DW$T$33, DW_AT_name("CLKSEM_BITS")
     795                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   16

     796              $C$DW$78        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$78, DW_AT_name("SEM")
     799                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_SEM")
     800                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     801                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     803              $C$DW$79        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
     806                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
     807                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     808                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     810              $C$DW$80        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$80, DW_AT_name("KEY")
     813                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_KEY")
     814                      .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     815                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     816                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     817                      .dwendtag $C$DW$T$33
     818              
     819              
     820              $C$DW$T$34      .dwtag  DW_TAG_union_type
     821                      .dwattr $C$DW$T$34, DW_AT_name("CLKSEM_REG")
     822                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
     823              $C$DW$81        .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
     825                      .dwattr $C$DW$81, DW_AT_name("all")
     826                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_all")
     827                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     828                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$82        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$33)
     831                      .dwattr $C$DW$82, DW_AT_name("bit")
     832                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_bit")
     833                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     835                      .dwendtag $C$DW$T$34
     836              
     837              
     838              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     839                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL1_BITS")
     840                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
     841              $C$DW$83        .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     843                      .dwattr $C$DW$83, DW_AT_name("OSCCLKSRCSEL")
     844                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
     845                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     846                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     847                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     848              $C$DW$84        .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     850                      .dwattr $C$DW$84, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   17

     851                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd1")
     852                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     853                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     855              $C$DW$85        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$85, DW_AT_name("INTOSC2OFF")
     858                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_INTOSC2OFF")
     859                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     860                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     862              $C$DW$86        .dwtag  DW_TAG_member
     863                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     864                      .dwattr $C$DW$86, DW_AT_name("XTALOFF")
     865                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_XTALOFF")
     866                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     867                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     869              $C$DW$87        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     871                      .dwattr $C$DW$87, DW_AT_name("WDHALTI")
     872                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_WDHALTI")
     873                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     874                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     876              $C$DW$88        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$88, DW_AT_name("rsvd2")
     879                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd2")
     880                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
     881                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$89        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$89, DW_AT_name("rsvd3")
     886                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd3")
     887                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     888                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     889                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     890                      .dwendtag $C$DW$T$35
     891              
     892              
     893              $C$DW$T$36      .dwtag  DW_TAG_union_type
     894                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL1_REG")
     895                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
     896              $C$DW$90        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
     898                      .dwattr $C$DW$90, DW_AT_name("all")
     899                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
     900                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     902              $C$DW$91        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$35)
     904                      .dwattr $C$DW$91, DW_AT_name("bit")
     905                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   18

     906                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     907                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     908                      .dwendtag $C$DW$T$36
     909              
     910              
     911              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     912                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL2_BITS")
     913                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
     914              $C$DW$92        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$92, DW_AT_name("AUXOSCCLKSRCSEL")
     917                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
     918                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     919                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     921              $C$DW$93        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$93, DW_AT_name("CANABCLKSEL")
     924                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CANABCLKSEL")
     925                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     926                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$94        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$94, DW_AT_name("CANBBCLKSEL")
     931                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_CANBBCLKSEL")
     932                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     933                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$95        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
     938                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
     939                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
     940                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$96        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$96, DW_AT_name("rsvd2")
     945                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd2")
     946                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     947                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     948                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     949                      .dwendtag $C$DW$T$37
     950              
     951              
     952              $C$DW$T$38      .dwtag  DW_TAG_union_type
     953                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL2_REG")
     954                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
     955              $C$DW$97        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
     957                      .dwattr $C$DW$97, DW_AT_name("all")
     958                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
     959                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   19

     961              $C$DW$98        .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$37)
     963                      .dwattr $C$DW$98, DW_AT_name("bit")
     964                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
     965                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     967                      .dwendtag $C$DW$T$38
     968              
     969              
     970              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     971                      .dwattr $C$DW$T$39, DW_AT_name("CLKSRCCTL3_BITS")
     972                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
     973              $C$DW$99        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$99, DW_AT_name("XCLKOUTSEL")
     976                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_XCLKOUTSEL")
     977                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
     978                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     980              $C$DW$100       .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
     983                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
     984                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     985                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     987              $C$DW$101       .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     989                      .dwattr $C$DW$101, DW_AT_name("rsvd2")
     990                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd2")
     991                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     992                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     993                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     994                      .dwendtag $C$DW$T$39
     995              
     996              
     997              $C$DW$T$40      .dwtag  DW_TAG_union_type
     998                      .dwattr $C$DW$T$40, DW_AT_name("CLKSRCCTL3_REG")
     999                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1000              $C$DW$102       .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
    1002                      .dwattr $C$DW$102, DW_AT_name("all")
    1003                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1004                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1006              $C$DW$103       .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$39)
    1008                      .dwattr $C$DW$103, DW_AT_name("bit")
    1009                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1010                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1012                      .dwendtag $C$DW$T$40
    1013              
    1014              
    1015              $C$DW$T$43      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   20

    1016                      .dwattr $C$DW$T$43, DW_AT_name("CLK_CFG_REGS")
    1017                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x32)
    1018              $C$DW$104       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$34)
    1020                      .dwattr $C$DW$104, DW_AT_name("CLKSEM")
    1021                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_CLKSEM")
    1022                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$105       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$32)
    1026                      .dwattr $C$DW$105, DW_AT_name("CLKCFGLOCK1")
    1027                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    1028                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1029                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$106       .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$41)
    1032                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    1033                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    1034                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1035                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$107       .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
    1038                      .dwattr $C$DW$107, DW_AT_name("CLKSRCCTL1")
    1039                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1040                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1041                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$108       .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$38)
    1044                      .dwattr $C$DW$108, DW_AT_name("CLKSRCCTL2")
    1045                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1046                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1047                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1048              $C$DW$109       .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$40)
    1050                      .dwattr $C$DW$109, DW_AT_name("CLKSRCCTL3")
    1051                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1052                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1053                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1054              $C$DW$110       .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$123)
    1056                      .dwattr $C$DW$110, DW_AT_name("SYSPLLCTL1")
    1057                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1058                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1059                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1060              $C$DW$111       .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$125)
    1062                      .dwattr $C$DW$111, DW_AT_name("SYSPLLCTL2")
    1063                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1064                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1065                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1066              $C$DW$112       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$127)
    1068                      .dwattr $C$DW$112, DW_AT_name("SYSPLLCTL3")
    1069                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1070                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   21

    1071                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$113       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$129)
    1074                      .dwattr $C$DW$113, DW_AT_name("SYSPLLMULT")
    1075                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1076                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1077                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$114       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$131)
    1080                      .dwattr $C$DW$114, DW_AT_name("SYSPLLSTS")
    1081                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SYSPLLSTS")
    1082                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1083                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$115       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$24)
    1086                      .dwattr $C$DW$115, DW_AT_name("AUXPLLCTL1")
    1087                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1088                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1089                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$116       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$41)
    1092                      .dwattr $C$DW$116, DW_AT_name("rsvd2")
    1093                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd2")
    1094                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1095                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1096              $C$DW$117       .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$26)
    1098                      .dwattr $C$DW$117, DW_AT_name("AUXPLLMULT")
    1099                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1100                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1101                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1102              $C$DW$118       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$28)
    1104                      .dwattr $C$DW$118, DW_AT_name("AUXPLLSTS")
    1105                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_AUXPLLSTS")
    1106                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1107                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1108              $C$DW$119       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$121)
    1110                      .dwattr $C$DW$119, DW_AT_name("SYSCLKDIVSEL")
    1111                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1112                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1113                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$120       .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$22)
    1116                      .dwattr $C$DW$120, DW_AT_name("AUXCLKDIVSEL")
    1117                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1118                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1119                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$121       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$94)
    1122                      .dwattr $C$DW$121, DW_AT_name("PERCLKDIVSEL")
    1123                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1124                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1125                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   22

    1126              $C$DW$122       .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$137)
    1128                      .dwattr $C$DW$122, DW_AT_name("XCLKOUTDIVSEL")
    1129                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    1130                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1131                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1132              $C$DW$123       .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$42)
    1134                      .dwattr $C$DW$123, DW_AT_name("rsvd3")
    1135                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd3")
    1136                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1137                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$124       .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$56)
    1140                      .dwattr $C$DW$124, DW_AT_name("LOSPCP")
    1141                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_LOSPCP")
    1142                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1143                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$125       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$60)
    1146                      .dwattr $C$DW$125, DW_AT_name("MCDCR")
    1147                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_MCDCR")
    1148                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1149                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$126       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$135)
    1152                      .dwattr $C$DW$126, DW_AT_name("X1CNT")
    1153                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_X1CNT")
    1154                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1155                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1156                      .dwendtag $C$DW$T$43
    1157              
    1158              $C$DW$127       .dwtag  DW_TAG_TI_far_type
    1159                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$43)
    1160              $C$DW$T$139     .dwtag  DW_TAG_volatile_type
    1161                      .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$127)
    1162              
    1163              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1164                      .dwattr $C$DW$T$44, DW_AT_name("CPUSYSLOCK1_BITS")
    1165                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1166              $C$DW$128       .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$128, DW_AT_name("HIBBOOTMODE")
    1169                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1170                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1171                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1173              $C$DW$129       .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$129, DW_AT_name("IORESTOREADDR")
    1176                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1177                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1178                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1180              $C$DW$130       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   23

    1181                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$130, DW_AT_name("PIEVERRADDR")
    1183                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1184                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1185                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1187              $C$DW$131       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$131, DW_AT_name("PCLKCR0")
    1190                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PCLKCR0")
    1191                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1192                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$132       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$132, DW_AT_name("PCLKCR1")
    1197                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PCLKCR1")
    1198                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1199                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$133       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1203                      .dwattr $C$DW$133, DW_AT_name("PCLKCR2")
    1204                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PCLKCR2")
    1205                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1206                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1208              $C$DW$134       .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$134, DW_AT_name("PCLKCR3")
    1211                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PCLKCR3")
    1212                      .dwattr $C$DW$134, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1215              $C$DW$135       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$135, DW_AT_name("PCLKCR4")
    1218                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PCLKCR4")
    1219                      .dwattr $C$DW$135, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1220                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$136       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1224                      .dwattr $C$DW$136, DW_AT_name("PCLKCR5")
    1225                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PCLKCR5")
    1226                      .dwattr $C$DW$136, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$137       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$137, DW_AT_name("PCLKCR6")
    1232                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PCLKCR6")
    1233                      .dwattr $C$DW$137, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1234                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   24

    1236              $C$DW$138       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$138, DW_AT_name("PCLKCR7")
    1239                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PCLKCR7")
    1240                      .dwattr $C$DW$138, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$139       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$139, DW_AT_name("PCLKCR8")
    1246                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PCLKCR8")
    1247                      .dwattr $C$DW$139, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1248                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$140       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$140, DW_AT_name("PCLKCR9")
    1253                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PCLKCR9")
    1254                      .dwattr $C$DW$140, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1255                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1257              $C$DW$141       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$141, DW_AT_name("PCLKCR10")
    1260                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PCLKCR10")
    1261                      .dwattr $C$DW$141, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1262                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$142       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$142, DW_AT_name("PCLKCR11")
    1267                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PCLKCR11")
    1268                      .dwattr $C$DW$142, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1269                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$143       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$143, DW_AT_name("PCLKCR12")
    1274                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PCLKCR12")
    1275                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$144       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$144, DW_AT_name("PCLKCR13")
    1281                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PCLKCR13")
    1282                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1283                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1284                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$145       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$145, DW_AT_name("PCLKCR14")
    1288                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PCLKCR14")
    1289                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1290                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   25

    1291                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$146       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1294                      .dwattr $C$DW$146, DW_AT_name("PCLKCR15")
    1295                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PCLKCR15")
    1296                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1297                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1298                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$147       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$147, DW_AT_name("PCLKCR16")
    1302                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PCLKCR16")
    1303                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1305                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$148       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$148, DW_AT_name("SECMSEL")
    1309                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_SECMSEL")
    1310                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1312                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$149       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$149, DW_AT_name("LPMCR")
    1316                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_LPMCR")
    1317                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1319                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$150       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$150, DW_AT_name("GPIOLPMSEL0")
    1323                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1324                      .dwattr $C$DW$150, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1325                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1326                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$151       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$151, DW_AT_name("GPIOLPMSEL1")
    1330                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1331                      .dwattr $C$DW$151, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$152       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    1337                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    1338                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1339                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1340                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1341                      .dwendtag $C$DW$T$44
    1342              
    1343              
    1344              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1345                      .dwattr $C$DW$T$45, DW_AT_name("CPUSYSLOCK1_REG")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   26

    1346                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1347              $C$DW$153       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
    1349                      .dwattr $C$DW$153, DW_AT_name("all")
    1350                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    1351                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1352                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1353              $C$DW$154       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$44)
    1355                      .dwattr $C$DW$154, DW_AT_name("bit")
    1356                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    1357                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1358                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1359                      .dwendtag $C$DW$T$45
    1360              
    1361              
    1362              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1363                      .dwattr $C$DW$T$48, DW_AT_name("CPU_SYS_REGS")
    1364                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x82)
    1365              $C$DW$155       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$45)
    1367                      .dwattr $C$DW$155, DW_AT_name("CPUSYSLOCK1")
    1368                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    1369                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$156       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$41)
    1373                      .dwattr $C$DW$156, DW_AT_name("rsvd1")
    1374                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd1")
    1375                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1376                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$157       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    1379                      .dwattr $C$DW$157, DW_AT_name("HIBBOOTMODE")
    1380                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1381                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1382                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$158       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$54)
    1385                      .dwattr $C$DW$158, DW_AT_name("IORESTOREADDR")
    1386                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1387                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1388                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1389              $C$DW$159       .dwtag  DW_TAG_member
    1390                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$96)
    1391                      .dwattr $C$DW$159, DW_AT_name("PIEVERRADDR")
    1392                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1393                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1394                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1395              $C$DW$160       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$46)
    1397                      .dwattr $C$DW$160, DW_AT_name("rsvd2")
    1398                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd2")
    1399                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1400                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   27

    1401              $C$DW$161       .dwtag  DW_TAG_member
    1402                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$62)
    1403                      .dwattr $C$DW$161, DW_AT_name("PCLKCR0")
    1404                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PCLKCR0")
    1405                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1406                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$162       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$76)
    1409                      .dwattr $C$DW$162, DW_AT_name("PCLKCR1")
    1410                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PCLKCR1")
    1411                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1412                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$163       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$78)
    1415                      .dwattr $C$DW$163, DW_AT_name("PCLKCR2")
    1416                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PCLKCR2")
    1417                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1418                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1419              $C$DW$164       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$80)
    1421                      .dwattr $C$DW$164, DW_AT_name("PCLKCR3")
    1422                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PCLKCR3")
    1423                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1424                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$165       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$82)
    1427                      .dwattr $C$DW$165, DW_AT_name("PCLKCR4")
    1428                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PCLKCR4")
    1429                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1430                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1431              $C$DW$166       .dwtag  DW_TAG_member
    1432                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$84)
    1433                      .dwattr $C$DW$166, DW_AT_name("PCLKCR5")
    1434                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PCLKCR5")
    1435                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1436                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1437              $C$DW$167       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$86)
    1439                      .dwattr $C$DW$167, DW_AT_name("PCLKCR6")
    1440                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PCLKCR6")
    1441                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1442                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1443              $C$DW$168       .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$88)
    1445                      .dwattr $C$DW$168, DW_AT_name("PCLKCR7")
    1446                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PCLKCR7")
    1447                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1448                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1449              $C$DW$169       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$90)
    1451                      .dwattr $C$DW$169, DW_AT_name("PCLKCR8")
    1452                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PCLKCR8")
    1453                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1454                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1455              $C$DW$170       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   28

    1456                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$92)
    1457                      .dwattr $C$DW$170, DW_AT_name("PCLKCR9")
    1458                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PCLKCR9")
    1459                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1460                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$171       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$64)
    1463                      .dwattr $C$DW$171, DW_AT_name("PCLKCR10")
    1464                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PCLKCR10")
    1465                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1466                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1467              $C$DW$172       .dwtag  DW_TAG_member
    1468                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$66)
    1469                      .dwattr $C$DW$172, DW_AT_name("PCLKCR11")
    1470                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PCLKCR11")
    1471                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1472                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1473              $C$DW$173       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$68)
    1475                      .dwattr $C$DW$173, DW_AT_name("PCLKCR12")
    1476                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PCLKCR12")
    1477                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1478                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1479              $C$DW$174       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$70)
    1481                      .dwattr $C$DW$174, DW_AT_name("PCLKCR13")
    1482                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PCLKCR13")
    1483                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1484                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1485              $C$DW$175       .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$72)
    1487                      .dwattr $C$DW$175, DW_AT_name("PCLKCR14")
    1488                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PCLKCR14")
    1489                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1490                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$176       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$42)
    1493                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    1494                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    1495                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1496                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1497              $C$DW$177       .dwtag  DW_TAG_member
    1498                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$74)
    1499                      .dwattr $C$DW$177, DW_AT_name("PCLKCR16")
    1500                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PCLKCR16")
    1501                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1502                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$178       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$47)
    1505                      .dwattr $C$DW$178, DW_AT_name("rsvd4")
    1506                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd4")
    1507                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1508                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1509              $C$DW$179       .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$30)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:27 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0396410                         PAGE   29

    1511                      .dwattr $C$DW$179, DW_AT_name("CCR")
    1512                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_CCR")
    1513                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1514                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1515              $C$DW$180       .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$119)
    1517                      .dwattr $C$DW$180, DW_AT_name("SECMSEL")
    1518                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_SECMSEL")
    1519                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1520                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$181       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$58)
    1523                      .dwattr $C$DW$181, DW_AT_name("LPMCR")
    1524                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_LPMCR")
    1525                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1526                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$182       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$50)
    1529                      .dwattr $C$DW$182, DW_AT_name("GPIOLPMSEL0")
    1530                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1531                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1532                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1533              $C$DW$183       .dwtag  DW_TAG_member
    1534                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$52)
    1535                      .dwattr $C$DW$183, DW_AT_name("GPIOLPMSEL1")
    1536                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1537                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1538                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$184       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$133)
    1541                      .dwattr $C$DW$184, DW_AT_name("TMR2CLKCTL")
    1542                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    1543                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1544                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$185       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$42)
    1547                      .dwattr $C$DW$185, DW_AT_name("rsvd5")
    1548                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd5")
    1549                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    1550                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1551              $C$DW$186       .dwtag  DW_TAG_member
    1552                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$98)
    1553                      .dwattr $C$DW$186, DW_AT_name("RESC")
    1554                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_RESC")
    1555                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
