TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:32:38 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("EmuKey")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EmuKey")

     151                      ; branch occurs ; [] |78| 
     152 0000002d       $C$L2:    
     153                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     154 0000002d CC00!         AND       AL,@_EmuKey,#0xff00   ; [CPU_] |81| 
         0000002e FF00 
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE    4

     155 0000002f FFC7          LSR       AL,8                  ; [CPU_] |81| 
     156 00000030 9641          MOV       *-SP[1],AL            ; [CPU_] |81| 
     157                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     158 00000031 6F0F          B         $C$L4,UNC             ; [CPU_] |84| 
     159                      ; branch occurs ; [] |84| 
     160 00000032       $C$L3:    
     161                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     162 00000032 FF69          SPM       #0                    ; [CPU_] 
     163              $C$DW$13        .dwtag  DW_TAG_TI_branch
     164                      .dwattr $C$DW$13, DW_AT_low_pc(0x00)
     165                      .dwattr $C$DW$13, DW_AT_name("_c2brom_read_otp_bootmode")
     166                      .dwattr $C$DW$13, DW_AT_TI_call
     167 00000033 7640!         LCR       #_c2brom_read_otp_bootmode ; [CPU_] |88| 
         00000034 0000 
     168                      ; call occurs [#_c2brom_read_otp_bootmode] ; [] |88| 
     169 00000035 9641          MOV       *-SP[1],AL            ; [CPU_] |88| 
     170                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     171 00000036 9B01          MOVB      AH,#1                 ; [CPU_] |89| 
     172              $C$DW$14        .dwtag  DW_TAG_TI_branch
     173                      .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     174                      .dwattr $C$DW$14, DW_AT_name("_c2brom_evaluate_bootmode")
     175                      .dwattr $C$DW$14, DW_AT_TI_call
     176 00000037 7640!         LCR       #_c2brom_evaluate_bootmode ; [CPU_] |89| 
         00000038 0000 
     177                      ; call occurs [#_c2brom_evaluate_bootmode] ; [] |89| 
     178 00000039 9641          MOV       *-SP[1],AL            ; [CPU_] |89| 
     179                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     180 0000003a 761F!         MOVW      DP,#_EmuKey           ; [CPU_U] 
         0000003b 0000 
     181 0000003c 5603          MOV       ACC,*-SP[1] << #8     ; [CPU_] |91| 
         0000003d 0841 
     182 0000003e 505A          ORB       AL,#0x5a              ; [CPU_] |91| 
     183 0000003f 9600!         MOV       @_EmuKey,AL           ; [CPU_] |91| 
     184 00000040       $C$L4:    
     185                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     186 00000040 761A   EDIS
     187                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     188 00000041 9241          MOV       AL,*-SP[1]            ; [CPU_] |96| 
     189                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     190 00000042 FE82          SUBB      SP,#2                 ; [CPU_U] 
     191                      .dwcfi  cfa_offset, -2
     192 00000043 FF69          SPM       #0                    ; [CPU_] 
     193              $C$DW$15        .dwtag  DW_TAG_TI_branch
     194                      .dwattr $C$DW$15, DW_AT_low_pc(0x00)
     195                      .dwattr $C$DW$15, DW_AT_TI_return
     196 00000044 0006          LRETR     ; [CPU_] 
     197                      ; return occurs ; [] 
     198                      .dwattr $C$DW$7, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootRO
     199                      .dwattr $C$DW$7, DW_AT_TI_end_line(0x61)
     200                      .dwattr $C$DW$7, DW_AT_TI_end_column(0x01)
     201                      .dwendentry
     202                      .dwendtag $C$DW$7
     203              
     204              ;**************************************************************
     205              ;* UNDEFINED EXTERNAL REFERENCES                              *
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE    5

     206              ;**************************************************************
     207                      .global _EmuKey
     208                      .global _c2brom_read_otp_bootmode
     209                      .global _c2brom_evaluate_bootmode
     210                      .global _CpuSysRegs
     211              
     212              ;***************************************************************
     213              ;* TYPE INFORMATION                                            *
     214              ;***************************************************************
     215              
     216              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     217                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
     218                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     219              $C$DW$16        .dwtag  DW_TAG_member
     220                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     221                      .dwattr $C$DW$16, DW_AT_name("VMAPS")
     222                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_VMAPS")
     223                      .dwattr $C$DW$16, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     224                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     225                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     226              $C$DW$17        .dwtag  DW_TAG_member
     227                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     228                      .dwattr $C$DW$17, DW_AT_name("MONPRIV")
     229                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_MONPRIV")
     230                      .dwattr $C$DW$17, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     231                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     232                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     233              $C$DW$18        .dwtag  DW_TAG_member
     234                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     235                      .dwattr $C$DW$18, DW_AT_name("ENPROT")
     236                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_ENPROT")
     237                      .dwattr $C$DW$18, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     238                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     239                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     240              $C$DW$19        .dwtag  DW_TAG_member
     241                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     242                      .dwattr $C$DW$19, DW_AT_name("rsvd1")
     243                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_rsvd1")
     244                      .dwattr $C$DW$19, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     245                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     246                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     247              $C$DW$20        .dwtag  DW_TAG_member
     248                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     249                      .dwattr $C$DW$20, DW_AT_name("rsvd2")
     250                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_rsvd2")
     251                      .dwattr $C$DW$20, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     252                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     253                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     254                      .dwendtag $C$DW$T$20
     255              
     256              
     257              $C$DW$T$22      .dwtag  DW_TAG_union_type
     258                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
     259                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     260              $C$DW$21        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE    6

     261                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     262                      .dwattr $C$DW$21, DW_AT_name("all")
     263                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_all")
     264                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     265                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     266              $C$DW$22        .dwtag  DW_TAG_member
     267                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$20)
     268                      .dwattr $C$DW$22, DW_AT_name("bit")
     269                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_bit")
     270                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     271                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     272                      .dwendtag $C$DW$T$22
     273              
     274              
     275              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     276                      .dwattr $C$DW$T$23, DW_AT_name("CPUSYSLOCK1_BITS")
     277                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     278              $C$DW$23        .dwtag  DW_TAG_member
     279                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     280                      .dwattr $C$DW$23, DW_AT_name("HIBBOOTMODE")
     281                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_HIBBOOTMODE")
     282                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     283                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     284                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     285              $C$DW$24        .dwtag  DW_TAG_member
     286                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     287                      .dwattr $C$DW$24, DW_AT_name("IORESTOREADDR")
     288                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_IORESTOREADDR")
     289                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     290                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     291                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     292              $C$DW$25        .dwtag  DW_TAG_member
     293                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     294                      .dwattr $C$DW$25, DW_AT_name("PIEVERRADDR")
     295                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_PIEVERRADDR")
     296                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     297                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     298                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     299              $C$DW$26        .dwtag  DW_TAG_member
     300                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     301                      .dwattr $C$DW$26, DW_AT_name("PCLKCR0")
     302                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_PCLKCR0")
     303                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     304                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     305                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     306              $C$DW$27        .dwtag  DW_TAG_member
     307                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     308                      .dwattr $C$DW$27, DW_AT_name("PCLKCR1")
     309                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_PCLKCR1")
     310                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     311                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     312                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     313              $C$DW$28        .dwtag  DW_TAG_member
     314                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     315                      .dwattr $C$DW$28, DW_AT_name("PCLKCR2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE    7

     316                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_PCLKCR2")
     317                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     318                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     319                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     320              $C$DW$29        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     322                      .dwattr $C$DW$29, DW_AT_name("PCLKCR3")
     323                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_PCLKCR3")
     324                      .dwattr $C$DW$29, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     325                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     326                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     327              $C$DW$30        .dwtag  DW_TAG_member
     328                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     329                      .dwattr $C$DW$30, DW_AT_name("PCLKCR4")
     330                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_PCLKCR4")
     331                      .dwattr $C$DW$30, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     332                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     333                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     334              $C$DW$31        .dwtag  DW_TAG_member
     335                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     336                      .dwattr $C$DW$31, DW_AT_name("PCLKCR5")
     337                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_PCLKCR5")
     338                      .dwattr $C$DW$31, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     339                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     340                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     341              $C$DW$32        .dwtag  DW_TAG_member
     342                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     343                      .dwattr $C$DW$32, DW_AT_name("PCLKCR6")
     344                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_PCLKCR6")
     345                      .dwattr $C$DW$32, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     346                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     347                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     348              $C$DW$33        .dwtag  DW_TAG_member
     349                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     350                      .dwattr $C$DW$33, DW_AT_name("PCLKCR7")
     351                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_PCLKCR7")
     352                      .dwattr $C$DW$33, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     353                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     354                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     355              $C$DW$34        .dwtag  DW_TAG_member
     356                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     357                      .dwattr $C$DW$34, DW_AT_name("PCLKCR8")
     358                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_PCLKCR8")
     359                      .dwattr $C$DW$34, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     360                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     361                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     362              $C$DW$35        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     364                      .dwattr $C$DW$35, DW_AT_name("PCLKCR9")
     365                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_PCLKCR9")
     366                      .dwattr $C$DW$35, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     367                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     368                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     369              $C$DW$36        .dwtag  DW_TAG_member
     370                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE    8

     371                      .dwattr $C$DW$36, DW_AT_name("PCLKCR10")
     372                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_PCLKCR10")
     373                      .dwattr $C$DW$36, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     374                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     376              $C$DW$37        .dwtag  DW_TAG_member
     377                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     378                      .dwattr $C$DW$37, DW_AT_name("PCLKCR11")
     379                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_PCLKCR11")
     380                      .dwattr $C$DW$37, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     381                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     382                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     383              $C$DW$38        .dwtag  DW_TAG_member
     384                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     385                      .dwattr $C$DW$38, DW_AT_name("PCLKCR12")
     386                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_PCLKCR12")
     387                      .dwattr $C$DW$38, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     388                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     390              $C$DW$39        .dwtag  DW_TAG_member
     391                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     392                      .dwattr $C$DW$39, DW_AT_name("PCLKCR13")
     393                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_PCLKCR13")
     394                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     395                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     396                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     397              $C$DW$40        .dwtag  DW_TAG_member
     398                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     399                      .dwattr $C$DW$40, DW_AT_name("PCLKCR14")
     400                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_PCLKCR14")
     401                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     402                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     403                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     404              $C$DW$41        .dwtag  DW_TAG_member
     405                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     406                      .dwattr $C$DW$41, DW_AT_name("PCLKCR15")
     407                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_PCLKCR15")
     408                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     409                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     410                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     411              $C$DW$42        .dwtag  DW_TAG_member
     412                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     413                      .dwattr $C$DW$42, DW_AT_name("PCLKCR16")
     414                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_PCLKCR16")
     415                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     416                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     417                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     418              $C$DW$43        .dwtag  DW_TAG_member
     419                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     420                      .dwattr $C$DW$43, DW_AT_name("SECMSEL")
     421                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_SECMSEL")
     422                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     423                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     424                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     425              $C$DW$44        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE    9

     426                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     427                      .dwattr $C$DW$44, DW_AT_name("LPMCR")
     428                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_LPMCR")
     429                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     430                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     431                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     432              $C$DW$45        .dwtag  DW_TAG_member
     433                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     434                      .dwattr $C$DW$45, DW_AT_name("GPIOLPMSEL0")
     435                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
     436                      .dwattr $C$DW$45, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     437                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     438                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     439              $C$DW$46        .dwtag  DW_TAG_member
     440                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     441                      .dwattr $C$DW$46, DW_AT_name("GPIOLPMSEL1")
     442                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
     443                      .dwattr $C$DW$46, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     444                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     445                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     446              $C$DW$47        .dwtag  DW_TAG_member
     447                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     448                      .dwattr $C$DW$47, DW_AT_name("rsvd1")
     449                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_rsvd1")
     450                      .dwattr $C$DW$47, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     451                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     452                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     453                      .dwendtag $C$DW$T$23
     454              
     455              
     456              $C$DW$T$24      .dwtag  DW_TAG_union_type
     457                      .dwattr $C$DW$T$24, DW_AT_name("CPUSYSLOCK1_REG")
     458                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     459              $C$DW$48        .dwtag  DW_TAG_member
     460                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$21)
     461                      .dwattr $C$DW$48, DW_AT_name("all")
     462                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_all")
     463                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     464                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     465              $C$DW$49        .dwtag  DW_TAG_member
     466                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$23)
     467                      .dwattr $C$DW$49, DW_AT_name("bit")
     468                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_bit")
     469                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     470                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     471                      .dwendtag $C$DW$T$24
     472              
     473              
     474              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     475                      .dwattr $C$DW$T$29, DW_AT_name("CPU_SYS_REGS")
     476                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x82)
     477              $C$DW$50        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$24)
     479                      .dwattr $C$DW$50, DW_AT_name("CPUSYSLOCK1")
     480                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   10

     481                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     482                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     483              $C$DW$51        .dwtag  DW_TAG_member
     484                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$25)
     485                      .dwattr $C$DW$51, DW_AT_name("rsvd1")
     486                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd1")
     487                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     488                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     489              $C$DW$52        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$21)
     491                      .dwattr $C$DW$52, DW_AT_name("HIBBOOTMODE")
     492                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_HIBBOOTMODE")
     493                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     494                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     495              $C$DW$53        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$35)
     497                      .dwattr $C$DW$53, DW_AT_name("IORESTOREADDR")
     498                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_IORESTOREADDR")
     499                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     500                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     501              $C$DW$54        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$71)
     503                      .dwattr $C$DW$54, DW_AT_name("PIEVERRADDR")
     504                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_PIEVERRADDR")
     505                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     506                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     507              $C$DW$55        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$26)
     509                      .dwattr $C$DW$55, DW_AT_name("rsvd2")
     510                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd2")
     511                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     512                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     513              $C$DW$56        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$39)
     515                      .dwattr $C$DW$56, DW_AT_name("PCLKCR0")
     516                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_PCLKCR0")
     517                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     518                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     519              $C$DW$57        .dwtag  DW_TAG_member
     520                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$53)
     521                      .dwattr $C$DW$57, DW_AT_name("PCLKCR1")
     522                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PCLKCR1")
     523                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     524                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     525              $C$DW$58        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$55)
     527                      .dwattr $C$DW$58, DW_AT_name("PCLKCR2")
     528                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PCLKCR2")
     529                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     530                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     531              $C$DW$59        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$57)
     533                      .dwattr $C$DW$59, DW_AT_name("PCLKCR3")
     534                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PCLKCR3")
     535                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   11

     536                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     537              $C$DW$60        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$59)
     539                      .dwattr $C$DW$60, DW_AT_name("PCLKCR4")
     540                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PCLKCR4")
     541                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     542                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     543              $C$DW$61        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$61)
     545                      .dwattr $C$DW$61, DW_AT_name("PCLKCR5")
     546                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PCLKCR5")
     547                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     548                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     549              $C$DW$62        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$63)
     551                      .dwattr $C$DW$62, DW_AT_name("PCLKCR6")
     552                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PCLKCR6")
     553                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     554                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     555              $C$DW$63        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$65)
     557                      .dwattr $C$DW$63, DW_AT_name("PCLKCR7")
     558                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PCLKCR7")
     559                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     560                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     561              $C$DW$64        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$67)
     563                      .dwattr $C$DW$64, DW_AT_name("PCLKCR8")
     564                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PCLKCR8")
     565                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     566                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     567              $C$DW$65        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$69)
     569                      .dwattr $C$DW$65, DW_AT_name("PCLKCR9")
     570                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PCLKCR9")
     571                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     572                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     573              $C$DW$66        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$41)
     575                      .dwattr $C$DW$66, DW_AT_name("PCLKCR10")
     576                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PCLKCR10")
     577                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     578                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     579              $C$DW$67        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$43)
     581                      .dwattr $C$DW$67, DW_AT_name("PCLKCR11")
     582                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PCLKCR11")
     583                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     584                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     585              $C$DW$68        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$45)
     587                      .dwattr $C$DW$68, DW_AT_name("PCLKCR12")
     588                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PCLKCR12")
     589                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     590                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   12

     591              $C$DW$69        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$47)
     593                      .dwattr $C$DW$69, DW_AT_name("PCLKCR13")
     594                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PCLKCR13")
     595                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     596                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     597              $C$DW$70        .dwtag  DW_TAG_member
     598                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$49)
     599                      .dwattr $C$DW$70, DW_AT_name("PCLKCR14")
     600                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PCLKCR14")
     601                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     602                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     603              $C$DW$71        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$27)
     605                      .dwattr $C$DW$71, DW_AT_name("rsvd3")
     606                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd3")
     607                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     608                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     609              $C$DW$72        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$51)
     611                      .dwattr $C$DW$72, DW_AT_name("PCLKCR16")
     612                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_PCLKCR16")
     613                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     614                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     615              $C$DW$73        .dwtag  DW_TAG_member
     616                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$28)
     617                      .dwattr $C$DW$73, DW_AT_name("rsvd4")
     618                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd4")
     619                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     620                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     621              $C$DW$74        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$22)
     623                      .dwattr $C$DW$74, DW_AT_name("CCR")
     624                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_CCR")
     625                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     626                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     627              $C$DW$75        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$75)
     629                      .dwattr $C$DW$75, DW_AT_name("SECMSEL")
     630                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_SECMSEL")
     631                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     632                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     633              $C$DW$76        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$37)
     635                      .dwattr $C$DW$76, DW_AT_name("LPMCR")
     636                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_LPMCR")
     637                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
     638                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     639              $C$DW$77        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$31)
     641                      .dwattr $C$DW$77, DW_AT_name("GPIOLPMSEL0")
     642                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
     643                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     644                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     645              $C$DW$78        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   13

     646                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$33)
     647                      .dwattr $C$DW$78, DW_AT_name("GPIOLPMSEL1")
     648                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
     649                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
     650                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     651              $C$DW$79        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$77)
     653                      .dwattr $C$DW$79, DW_AT_name("TMR2CLKCTL")
     654                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_TMR2CLKCTL")
     655                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     656                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     657              $C$DW$80        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$27)
     659                      .dwattr $C$DW$80, DW_AT_name("rsvd5")
     660                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd5")
     661                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
     662                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     663              $C$DW$81        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$73)
     665                      .dwattr $C$DW$81, DW_AT_name("RESC")
     666                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_RESC")
     667                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     668                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     669                      .dwendtag $C$DW$T$29
     670              
     671              $C$DW$82        .dwtag  DW_TAG_TI_far_type
     672                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$29)
     673              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
     674                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$82)
     675              
     676              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     677                      .dwattr $C$DW$T$30, DW_AT_name("GPIOLPMSEL0_BITS")
     678                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     679              $C$DW$83        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$83, DW_AT_name("GPIO0")
     682                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO0")
     683                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     684                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     685                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     686              $C$DW$84        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$84, DW_AT_name("GPIO1")
     689                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO1")
     690                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     691                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     693              $C$DW$85        .dwtag  DW_TAG_member
     694                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$85, DW_AT_name("GPIO2")
     696                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO2")
     697                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     698                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     700              $C$DW$86        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   14

     701                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$86, DW_AT_name("GPIO3")
     703                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO3")
     704                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     705                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     707              $C$DW$87        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$87, DW_AT_name("GPIO4")
     710                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO4")
     711                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     712                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     713                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     714              $C$DW$88        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$88, DW_AT_name("GPIO5")
     717                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO5")
     718                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     719                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     721              $C$DW$89        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     723                      .dwattr $C$DW$89, DW_AT_name("GPIO6")
     724                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO6")
     725                      .dwattr $C$DW$89, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     726                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     728              $C$DW$90        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     730                      .dwattr $C$DW$90, DW_AT_name("GPIO7")
     731                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO7")
     732                      .dwattr $C$DW$90, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     733                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     734                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     735              $C$DW$91        .dwtag  DW_TAG_member
     736                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     737                      .dwattr $C$DW$91, DW_AT_name("GPIO8")
     738                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO8")
     739                      .dwattr $C$DW$91, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     740                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     741                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     742              $C$DW$92        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$92, DW_AT_name("GPIO9")
     745                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO9")
     746                      .dwattr $C$DW$92, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     747                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     748                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     749              $C$DW$93        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     751                      .dwattr $C$DW$93, DW_AT_name("GPIO10")
     752                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO10")
     753                      .dwattr $C$DW$93, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     754                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   15

     756              $C$DW$94        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$94, DW_AT_name("GPIO11")
     759                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO11")
     760                      .dwattr $C$DW$94, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     761                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     763              $C$DW$95        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$95, DW_AT_name("GPIO12")
     766                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO12")
     767                      .dwattr $C$DW$95, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     768                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     770              $C$DW$96        .dwtag  DW_TAG_member
     771                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     772                      .dwattr $C$DW$96, DW_AT_name("GPIO13")
     773                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO13")
     774                      .dwattr $C$DW$96, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     775                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     777              $C$DW$97        .dwtag  DW_TAG_member
     778                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     779                      .dwattr $C$DW$97, DW_AT_name("GPIO14")
     780                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO14")
     781                      .dwattr $C$DW$97, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     782                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     784              $C$DW$98        .dwtag  DW_TAG_member
     785                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     786                      .dwattr $C$DW$98, DW_AT_name("GPIO15")
     787                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO15")
     788                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     789                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     790                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     791              $C$DW$99        .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     793                      .dwattr $C$DW$99, DW_AT_name("GPIO16")
     794                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO16")
     795                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     796                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     797                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     798              $C$DW$100       .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$100, DW_AT_name("GPIO17")
     801                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO17")
     802                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     803                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     804                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$101       .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$101, DW_AT_name("GPIO18")
     808                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO18")
     809                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     810                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   16

     811                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     812              $C$DW$102       .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     814                      .dwattr $C$DW$102, DW_AT_name("GPIO19")
     815                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO19")
     816                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     817                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     818                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     819              $C$DW$103       .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$103, DW_AT_name("GPIO20")
     822                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO20")
     823                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     824                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     825                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     826              $C$DW$104       .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$104, DW_AT_name("GPIO21")
     829                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO21")
     830                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     831                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     832                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     833              $C$DW$105       .dwtag  DW_TAG_member
     834                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     835                      .dwattr $C$DW$105, DW_AT_name("GPIO22")
     836                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO22")
     837                      .dwattr $C$DW$105, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     838                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     839                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     840              $C$DW$106       .dwtag  DW_TAG_member
     841                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     842                      .dwattr $C$DW$106, DW_AT_name("GPIO23")
     843                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO23")
     844                      .dwattr $C$DW$106, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     845                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     846                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$107       .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$107, DW_AT_name("GPIO24")
     850                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO24")
     851                      .dwattr $C$DW$107, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     852                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     853                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     854              $C$DW$108       .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     856                      .dwattr $C$DW$108, DW_AT_name("GPIO25")
     857                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO25")
     858                      .dwattr $C$DW$108, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     859                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     860                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     861              $C$DW$109       .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$109, DW_AT_name("GPIO26")
     864                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO26")
     865                      .dwattr $C$DW$109, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   17

     866                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     867                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     868              $C$DW$110       .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$110, DW_AT_name("GPIO27")
     871                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO27")
     872                      .dwattr $C$DW$110, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     874                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     875              $C$DW$111       .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$111, DW_AT_name("GPIO28")
     878                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO28")
     879                      .dwattr $C$DW$111, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     881                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$112       .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$112, DW_AT_name("GPIO29")
     885                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO29")
     886                      .dwattr $C$DW$112, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     887                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     888                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$113       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$113, DW_AT_name("GPIO30")
     892                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO30")
     893                      .dwattr $C$DW$113, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     894                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     895                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     896              $C$DW$114       .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$114, DW_AT_name("GPIO31")
     899                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO31")
     900                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     901                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     902                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     903                      .dwendtag $C$DW$T$30
     904              
     905              
     906              $C$DW$T$31      .dwtag  DW_TAG_union_type
     907                      .dwattr $C$DW$T$31, DW_AT_name("GPIOLPMSEL0_REG")
     908                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     909              $C$DW$115       .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
     911                      .dwattr $C$DW$115, DW_AT_name("all")
     912                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
     913                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     915              $C$DW$116       .dwtag  DW_TAG_member
     916                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$30)
     917                      .dwattr $C$DW$116, DW_AT_name("bit")
     918                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
     919                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   18

     921                      .dwendtag $C$DW$T$31
     922              
     923              
     924              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     925                      .dwattr $C$DW$T$32, DW_AT_name("GPIOLPMSEL1_BITS")
     926                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     927              $C$DW$117       .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
     929                      .dwattr $C$DW$117, DW_AT_name("GPIO32")
     930                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO32")
     931                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     932                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     933                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     934              $C$DW$118       .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$118, DW_AT_name("GPIO33")
     937                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO33")
     938                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     939                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$119       .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$119, DW_AT_name("GPIO34")
     944                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO34")
     945                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     946                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$120       .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$120, DW_AT_name("GPIO35")
     951                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO35")
     952                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     953                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$121       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$121, DW_AT_name("GPIO36")
     958                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO36")
     959                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     960                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$122       .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$122, DW_AT_name("GPIO37")
     965                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO37")
     966                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     967                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     969              $C$DW$123       .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$123, DW_AT_name("GPIO38")
     972                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO38")
     973                      .dwattr $C$DW$123, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     974                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   19

     976              $C$DW$124       .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$124, DW_AT_name("GPIO39")
     979                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO39")
     980                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     981                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     983              $C$DW$125       .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$125, DW_AT_name("GPIO40")
     986                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO40")
     987                      .dwattr $C$DW$125, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     988                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     990              $C$DW$126       .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$126, DW_AT_name("GPIO41")
     993                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO41")
     994                      .dwattr $C$DW$126, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     995                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$127       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$127, DW_AT_name("GPIO42")
    1000                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO42")
    1001                      .dwattr $C$DW$127, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1002                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$128       .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$128, DW_AT_name("GPIO43")
    1007                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO43")
    1008                      .dwattr $C$DW$128, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1009                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$129       .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$129, DW_AT_name("GPIO44")
    1014                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO44")
    1015                      .dwattr $C$DW$129, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$130       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1020                      .dwattr $C$DW$130, DW_AT_name("GPIO45")
    1021                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO45")
    1022                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1023                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1025              $C$DW$131       .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$131, DW_AT_name("GPIO46")
    1028                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO46")
    1029                      .dwattr $C$DW$131, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1030                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   20

    1031                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1032              $C$DW$132       .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$132, DW_AT_name("GPIO47")
    1035                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO47")
    1036                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1037                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$133       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$133, DW_AT_name("GPIO48")
    1042                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO48")
    1043                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1044                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1045                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1046              $C$DW$134       .dwtag  DW_TAG_member
    1047                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1048                      .dwattr $C$DW$134, DW_AT_name("GPIO49")
    1049                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO49")
    1050                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1051                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1052                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1053              $C$DW$135       .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$135, DW_AT_name("GPIO50")
    1056                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO50")
    1057                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1058                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1059                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1060              $C$DW$136       .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1062                      .dwattr $C$DW$136, DW_AT_name("GPIO51")
    1063                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO51")
    1064                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1065                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1066                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1067              $C$DW$137       .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1069                      .dwattr $C$DW$137, DW_AT_name("GPIO52")
    1070                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO52")
    1071                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1072                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1073                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1074              $C$DW$138       .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1076                      .dwattr $C$DW$138, DW_AT_name("GPIO53")
    1077                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO53")
    1078                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1079                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1080                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$139       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1083                      .dwattr $C$DW$139, DW_AT_name("GPIO54")
    1084                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO54")
    1085                      .dwattr $C$DW$139, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   21

    1086                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1087                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1088              $C$DW$140       .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1090                      .dwattr $C$DW$140, DW_AT_name("GPIO55")
    1091                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO55")
    1092                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1093                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1094                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1095              $C$DW$141       .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1097                      .dwattr $C$DW$141, DW_AT_name("GPIO56")
    1098                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO56")
    1099                      .dwattr $C$DW$141, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1100                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1101                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1102              $C$DW$142       .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1104                      .dwattr $C$DW$142, DW_AT_name("GPIO57")
    1105                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO57")
    1106                      .dwattr $C$DW$142, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1107                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1108                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1109              $C$DW$143       .dwtag  DW_TAG_member
    1110                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1111                      .dwattr $C$DW$143, DW_AT_name("GPIO58")
    1112                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO58")
    1113                      .dwattr $C$DW$143, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1114                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1115                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1116              $C$DW$144       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1118                      .dwattr $C$DW$144, DW_AT_name("GPIO59")
    1119                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO59")
    1120                      .dwattr $C$DW$144, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1121                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1122                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$145       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$145, DW_AT_name("GPIO60")
    1126                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO60")
    1127                      .dwattr $C$DW$145, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1128                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1129                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1130              $C$DW$146       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$146, DW_AT_name("GPIO61")
    1133                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO61")
    1134                      .dwattr $C$DW$146, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1135                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1136                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$147       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$147, DW_AT_name("GPIO62")
    1140                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO62")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   22

    1141                      .dwattr $C$DW$147, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1142                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1143                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$148       .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$148, DW_AT_name("GPIO63")
    1147                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO63")
    1148                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1149                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1150                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1151                      .dwendtag $C$DW$T$32
    1152              
    1153              
    1154              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1155                      .dwattr $C$DW$T$33, DW_AT_name("GPIOLPMSEL1_REG")
    1156                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1157              $C$DW$149       .dwtag  DW_TAG_member
    1158                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1159                      .dwattr $C$DW$149, DW_AT_name("all")
    1160                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    1161                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$150       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$32)
    1165                      .dwattr $C$DW$150, DW_AT_name("bit")
    1166                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    1167                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1169                      .dwendtag $C$DW$T$33
    1170              
    1171              
    1172              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1173                      .dwattr $C$DW$T$34, DW_AT_name("IORESTOREADDR_BITS")
    1174                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1175              $C$DW$151       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    1177                      .dwattr $C$DW$151, DW_AT_name("ADDR")
    1178                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ADDR")
    1179                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x16)
    1180                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$152       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    1185                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    1186                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1187                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1188                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1189                      .dwendtag $C$DW$T$34
    1190              
    1191              
    1192              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1193                      .dwattr $C$DW$T$35, DW_AT_name("IORESTOREADDR_REG")
    1194                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1195              $C$DW$153       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   23

    1196                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
    1197                      .dwattr $C$DW$153, DW_AT_name("all")
    1198                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    1199                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$154       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$34)
    1203                      .dwattr $C$DW$154, DW_AT_name("bit")
    1204                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
    1205                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1207                      .dwendtag $C$DW$T$35
    1208              
    1209              
    1210              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1211                      .dwattr $C$DW$T$36, DW_AT_name("LPMCR_BITS")
    1212                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1213              $C$DW$155       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$155, DW_AT_name("LPM")
    1216                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_LPM")
    1217                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1218                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1220              $C$DW$156       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$156, DW_AT_name("QUALSTDBY")
    1223                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_QUALSTDBY")
    1224                      .dwattr $C$DW$156, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    1225                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1227              $C$DW$157       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1229                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    1230                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    1231                      .dwattr $C$DW$157, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1232                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1233                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1234              $C$DW$158       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$158, DW_AT_name("WDINTE")
    1237                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_WDINTE")
    1238                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1239                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$159       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$159, DW_AT_name("M0M1MODE")
    1244                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_M0M1MODE")
    1245                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1246                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1247                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1248              $C$DW$160       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1250                      .dwattr $C$DW$160, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   24

    1251                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd2")
    1252                      .dwattr $C$DW$160, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0d)
    1253                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1254                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1255              $C$DW$161       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$161, DW_AT_name("IOISODIS")
    1258                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_IOISODIS")
    1259                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1260                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1261                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1262                      .dwendtag $C$DW$T$36
    1263              
    1264              
    1265              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1266                      .dwattr $C$DW$T$37, DW_AT_name("LPMCR_REG")
    1267                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1268              $C$DW$162       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    1270                      .dwattr $C$DW$162, DW_AT_name("all")
    1271                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_all")
    1272                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1273                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1274              $C$DW$163       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$36)
    1276                      .dwattr $C$DW$163, DW_AT_name("bit")
    1277                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_bit")
    1278                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1280                      .dwendtag $C$DW$T$37
    1281              
    1282              
    1283              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1284                      .dwattr $C$DW$T$38, DW_AT_name("PCLKCR0_BITS")
    1285                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1286              $C$DW$164       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$164, DW_AT_name("CLA1")
    1289                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_CLA1")
    1290                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1291                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1293              $C$DW$165       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$165, DW_AT_name("rsvd1")
    1296                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd1")
    1297                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1298                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$166       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1302                      .dwattr $C$DW$166, DW_AT_name("DMA")
    1303                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_DMA")
    1304                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1305                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0901610                         PAGE   25

    1306                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$167       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1309                      .dwattr $C$DW$167, DW_AT_name("CPUTIMER0")
    1310                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_CPUTIMER0")
    1311                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1312                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1313                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1314              $C$DW$168       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$168, DW_AT_name("CPUTIMER1")
    1317                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CPUTIMER1")
    1318                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1319                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$169       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$169, DW_AT_name("CPUTIMER2")
    1324                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_CPUTIMER2")
    1325                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1326                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1328              $C$DW$170       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$170, DW_AT_name("rsvd2")
    1331                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd2")
    1332                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1333                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1335              $C$DW$171       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$171, DW_AT_name("HRPWM")
    1338                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_HRPWM")
    1339                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1340                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1341                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$172       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$172, DW_AT_name("rsvd3")
    1345                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd3")
    1346                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1348                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1349              $C$DW$173       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$173, DW_AT_name("TBCLKSYNC")
    1352                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_TBCLKSYNC")
    1353                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1354                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1355                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$174       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$174, DW_AT_name("GTBCLKSYNC")
    1359                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GTBCLKSYNC")
    1360                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:38 2014

