TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:32:32 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

     669              ;***************************************************************
     670              
     671 0000009e       _SPIA_Init:
     672                      .dwcfi  cfa_offset, -2
     673                      .dwcfi  save_reg_to_mem, 26, 0
     674                      .dwcfi  save_reg_to_reg, 78, 26
     675                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     676 0000009e 7622   EALLOW
     677                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     678 0000009f 9A01          MOV       AL,#1                 ; [CPU_] |225| 
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   14

     679 000000a0 28A8          MOV       AH,#42405             ; [CPU_] |225| 
         000000a1 A5A5 
     680 000000a2 761F!         MOVW      DP,#_ClkCfgRegs       ; [CPU_U] 
         000000a3 0000 
     681 000000a4 1E00!         MOVL      @_ClkCfgRegs,ACC      ; [CPU_] |225| 
     682                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     683 000000a5 761F!         MOVW      DP,#_CpuSysRegs+50    ; [CPU_U] 
         000000a6 0000 
     684 000000a7 1A32!         OR        @_CpuSysRegs+50,#0x0001 ; [CPU_] |226| 
         000000a8 0001 
     685                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     686 000000a9 761F!         MOVW      DP,#_ClkCfgRegs+44    ; [CPU_U] 
         000000aa 0000 
     687 000000ab 0202          MOVB      ACC,#2                ; [CPU_] |227| 
     688 000000ac 1E2C!         MOVL      @_ClkCfgRegs+44,ACC   ; [CPU_] |227| 
     689                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     690 000000ad 761F!         MOVW      DP,#_SpiaRegs+10      ; [CPU_U] 
         000000ae 0000 
     691 000000af 280A!         MOV       @_SpiaRegs+10,#32768  ; [CPU_] |230| 
         000000b0 8000 
     692                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     693 000000b1 56BF!         MOVB      @_SpiaRegs,#7,UNC     ; [CPU_] |232| 
         000000b2 0700 
     694                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     695 000000b3 56BF!         MOVB      @_SpiaRegs+1,#14,UNC  ; [CPU_] |234| 
         000000b4 0E01 
     696                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     697 000000b5 56BF!         MOVB      @_SpiaRegs+4,#127,UNC ; [CPU_] |236| 
         000000b6 7F04 
     698                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     699 000000b7 56BF!         MOVB      @_SpiaRegs,#135,UNC   ; [CPU_] |238| 
         000000b8 8700 
     700                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     701 000000b9 761A   EDIS
     702                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     703 000000ba FF69          SPM       #0                    ; [CPU_] 
     704              $C$DW$53        .dwtag  DW_TAG_TI_branch
     705                      .dwattr $C$DW$53, DW_AT_low_pc(0x00)
     706                      .dwattr $C$DW$53, DW_AT_TI_return
     707 000000bb 0006          LRETR     ; [CPU_] 
     708                      ; return occurs ; [] 
     709                      .dwattr $C$DW$52, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     710                      .dwattr $C$DW$52, DW_AT_TI_end_line(0xf0)
     711                      .dwattr $C$DW$52, DW_AT_TI_end_column(0x01)
     712                      .dwendentry
     713                      .dwendtag $C$DW$52
     714              
     715              ;**************************************************************
     716              ;* UNDEFINED EXTERNAL REFERENCES                              *
     717              ;**************************************************************
     718                      .global _CopyData
     719                      .global _GetLongData
     720                      .global _GetWordData
     721                      .global _SpiaRegs
     722                      .global _GpioDataRegs
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   15

     723                      .global _ClkCfgRegs
     724                      .global _CpuSysRegs
     725              
     726              ;***************************************************************
     727              ;* TYPE INFORMATION                                            *
     728              ;***************************************************************
     729              
     730              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     731                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
     732                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     733              $C$DW$54        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$54, DW_AT_name("AUXPLLDIV")
     736                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_AUXPLLDIV")
     737                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     738                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$55        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
     743                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
     744                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     745                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     747              $C$DW$56        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$56, DW_AT_name("rsvd2")
     750                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd2")
     751                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     752                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     753                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     754                      .dwendtag $C$DW$T$20
     755              
     756              
     757              $C$DW$T$22      .dwtag  DW_TAG_union_type
     758                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
     759                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     760              $C$DW$57        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$21)
     762                      .dwattr $C$DW$57, DW_AT_name("all")
     763                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_all")
     764                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     765                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     766              $C$DW$58        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     768                      .dwattr $C$DW$58, DW_AT_name("bit")
     769                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_bit")
     770                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     771                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     772                      .dwendtag $C$DW$T$22
     773              
     774              
     775              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     776                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
     777                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   16

     778              $C$DW$59        .dwtag  DW_TAG_member
     779                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     780                      .dwattr $C$DW$59, DW_AT_name("PLLEN")
     781                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PLLEN")
     782                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     783                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     785              $C$DW$60        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     787                      .dwattr $C$DW$60, DW_AT_name("PLLCLKEN")
     788                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PLLCLKEN")
     789                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     790                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$61        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     794                      .dwattr $C$DW$61, DW_AT_name("rsvd1")
     795                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd1")
     796                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     797                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     798                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$62        .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     801                      .dwattr $C$DW$62, DW_AT_name("rsvd2")
     802                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_rsvd2")
     803                      .dwattr $C$DW$62, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     804                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     805                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     806                      .dwendtag $C$DW$T$23
     807              
     808              
     809              $C$DW$T$24      .dwtag  DW_TAG_union_type
     810                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
     811                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     812              $C$DW$63        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
     814                      .dwattr $C$DW$63, DW_AT_name("all")
     815                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_all")
     816                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$64        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
     820                      .dwattr $C$DW$64, DW_AT_name("bit")
     821                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_bit")
     822                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     824                      .dwendtag $C$DW$T$24
     825              
     826              
     827              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     828                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
     829                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     830              $C$DW$65        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     832                      .dwattr $C$DW$65, DW_AT_name("IMULT")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   17

     833                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_IMULT")
     834                      .dwattr $C$DW$65, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
     835                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     836                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     837              $C$DW$66        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$66, DW_AT_name("rsvd1")
     840                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd1")
     841                      .dwattr $C$DW$66, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     842                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     844              $C$DW$67        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$67, DW_AT_name("FMULT")
     847                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_FMULT")
     848                      .dwattr $C$DW$67, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     849                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     851              $C$DW$68        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     853                      .dwattr $C$DW$68, DW_AT_name("rsvd2")
     854                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd2")
     855                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     856                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     857                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     858              $C$DW$69        .dwtag  DW_TAG_member
     859                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     860                      .dwattr $C$DW$69, DW_AT_name("rsvd3")
     861                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd3")
     862                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     863                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     864                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     865                      .dwendtag $C$DW$T$25
     866              
     867              
     868              $C$DW$T$26      .dwtag  DW_TAG_union_type
     869                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
     870                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     871              $C$DW$70        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
     873                      .dwattr $C$DW$70, DW_AT_name("all")
     874                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     875                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$71        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$25)
     879                      .dwattr $C$DW$71, DW_AT_name("bit")
     880                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
     881                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     883                      .dwendtag $C$DW$T$26
     884              
     885              
     886              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     887                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   18

     888                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     889              $C$DW$72        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$72, DW_AT_name("LOCKS")
     892                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_LOCKS")
     893                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     894                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     896              $C$DW$73        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$73, DW_AT_name("SLIPS")
     899                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_SLIPS")
     900                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     901                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     903              $C$DW$74        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$74, DW_AT_name("rsvd1")
     906                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd1")
     907                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     908                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     910              $C$DW$75        .dwtag  DW_TAG_member
     911                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     912                      .dwattr $C$DW$75, DW_AT_name("rsvd2")
     913                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd2")
     914                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     915                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     916                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     917                      .dwendtag $C$DW$T$27
     918              
     919              
     920              $C$DW$T$28      .dwtag  DW_TAG_union_type
     921                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
     922                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     923              $C$DW$76        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$21)
     925                      .dwattr $C$DW$76, DW_AT_name("all")
     926                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
     927                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     928                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     929              $C$DW$77        .dwtag  DW_TAG_member
     930                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$27)
     931                      .dwattr $C$DW$77, DW_AT_name("bit")
     932                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     933                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     935                      .dwendtag $C$DW$T$28
     936              
     937              
     938              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     939                      .dwattr $C$DW$T$29, DW_AT_name("CCR_BITS")
     940                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     941              $C$DW$78        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   19

     943                      .dwattr $C$DW$78, DW_AT_name("VMAPS")
     944                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_VMAPS")
     945                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     946                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$79        .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$79, DW_AT_name("MONPRIV")
     951                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_MONPRIV")
     952                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     953                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$80        .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$80, DW_AT_name("ENPROT")
     958                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ENPROT")
     959                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     960                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$81        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$81, DW_AT_name("rsvd1")
     965                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd1")
     966                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     967                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     969              $C$DW$82        .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$82, DW_AT_name("rsvd2")
     972                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_rsvd2")
     973                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     974                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     975                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     976                      .dwendtag $C$DW$T$29
     977              
     978              
     979              $C$DW$T$30      .dwtag  DW_TAG_union_type
     980                      .dwattr $C$DW$T$30, DW_AT_name("CCR_REG")
     981                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     982              $C$DW$83        .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
     984                      .dwattr $C$DW$83, DW_AT_name("all")
     985                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
     986                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$84        .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$29)
     990                      .dwattr $C$DW$84, DW_AT_name("bit")
     991                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
     992                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     994                      .dwendtag $C$DW$T$30
     995              
     996              
     997              $C$DW$T$31      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   20

     998                      .dwattr $C$DW$T$31, DW_AT_name("CLKCFGLOCK1_BITS")
     999                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1000              $C$DW$85        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$85, DW_AT_name("CLKSRCCTL1")
    1003                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1004                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1005                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1007              $C$DW$86        .dwtag  DW_TAG_member
    1008                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1009                      .dwattr $C$DW$86, DW_AT_name("CLKSRCCTL2")
    1010                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1011                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1012                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1013                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1014              $C$DW$87        .dwtag  DW_TAG_member
    1015                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1016                      .dwattr $C$DW$87, DW_AT_name("CLKSRCCTL3")
    1017                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1018                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1019                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$88        .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1023                      .dwattr $C$DW$88, DW_AT_name("SYSPLLCTL1")
    1024                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1025                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1026                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1027                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1028              $C$DW$89        .dwtag  DW_TAG_member
    1029                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1030                      .dwattr $C$DW$89, DW_AT_name("SYSPLLCTL2")
    1031                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1032                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1033                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1034                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1035              $C$DW$90        .dwtag  DW_TAG_member
    1036                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1037                      .dwattr $C$DW$90, DW_AT_name("SYSPLLCTL3")
    1038                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1039                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1040                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1041                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1042              $C$DW$91        .dwtag  DW_TAG_member
    1043                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1044                      .dwattr $C$DW$91, DW_AT_name("SYSPLLMULT")
    1045                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1046                      .dwattr $C$DW$91, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1047                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1049              $C$DW$92        .dwtag  DW_TAG_member
    1050                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1051                      .dwattr $C$DW$92, DW_AT_name("AUXPLLCTL1")
    1052                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_AUXPLLCTL1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   21

    1053                      .dwattr $C$DW$92, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1054                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1056              $C$DW$93        .dwtag  DW_TAG_member
    1057                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1058                      .dwattr $C$DW$93, DW_AT_name("rsvd1")
    1059                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd1")
    1060                      .dwattr $C$DW$93, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1061                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$94        .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1065                      .dwattr $C$DW$94, DW_AT_name("AUXPLLMULT")
    1066                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1067                      .dwattr $C$DW$94, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1068                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1070              $C$DW$95        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$95, DW_AT_name("SYSCLKDIVSEL")
    1073                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1074                      .dwattr $C$DW$95, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$96        .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$96, DW_AT_name("AUXCLKDIVSEL")
    1080                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1081                      .dwattr $C$DW$96, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1082                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$97        .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$97, DW_AT_name("PERCLKDIVSEL")
    1087                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1088                      .dwattr $C$DW$97, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$98        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    1094                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    1095                      .dwattr $C$DW$98, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1096                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$99        .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$99, DW_AT_name("LOSPCP")
    1101                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_LOSPCP")
    1102                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1103                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$100       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$100, DW_AT_name("rsvd3")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   22

    1108                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd3")
    1109                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1110                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1111                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1112                      .dwendtag $C$DW$T$31
    1113              
    1114              
    1115              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1116                      .dwattr $C$DW$T$32, DW_AT_name("CLKCFGLOCK1_REG")
    1117                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1118              $C$DW$101       .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1120                      .dwattr $C$DW$101, DW_AT_name("all")
    1121                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1122                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1124              $C$DW$102       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$31)
    1126                      .dwattr $C$DW$102, DW_AT_name("bit")
    1127                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1128                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1130                      .dwendtag $C$DW$T$32
    1131              
    1132              
    1133              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1134                      .dwattr $C$DW$T$33, DW_AT_name("CLKSEM_BITS")
    1135                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1136              $C$DW$103       .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1138                      .dwattr $C$DW$103, DW_AT_name("SEM")
    1139                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_SEM")
    1140                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1141                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$104       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1145                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    1146                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    1147                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1148                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$105       .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1152                      .dwattr $C$DW$105, DW_AT_name("KEY")
    1153                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_KEY")
    1154                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1155                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1156                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1157                      .dwendtag $C$DW$T$33
    1158              
    1159              
    1160              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1161                      .dwattr $C$DW$T$34, DW_AT_name("CLKSEM_REG")
    1162                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   23

    1163              $C$DW$106       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1165                      .dwattr $C$DW$106, DW_AT_name("all")
    1166                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1167                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1168                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1169              $C$DW$107       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$33)
    1171                      .dwattr $C$DW$107, DW_AT_name("bit")
    1172                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1173                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1175                      .dwendtag $C$DW$T$34
    1176              
    1177              
    1178              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1179                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL1_BITS")
    1180                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1181              $C$DW$108       .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$108, DW_AT_name("OSCCLKSRCSEL")
    1184                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1185                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1186                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$109       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1191                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1192                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1193                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$110       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$110, DW_AT_name("INTOSC2OFF")
    1198                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1199                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1200                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1201                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1202              $C$DW$111       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1204                      .dwattr $C$DW$111, DW_AT_name("XTALOFF")
    1205                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_XTALOFF")
    1206                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1207                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1209              $C$DW$112       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1211                      .dwattr $C$DW$112, DW_AT_name("WDHALTI")
    1212                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_WDHALTI")
    1213                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1214                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1216              $C$DW$113       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   24

    1218                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    1219                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    1220                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1221                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1222                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1223              $C$DW$114       .dwtag  DW_TAG_member
    1224                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1225                      .dwattr $C$DW$114, DW_AT_name("rsvd3")
    1226                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd3")
    1227                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1228                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1229                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1230                      .dwendtag $C$DW$T$35
    1231              
    1232              
    1233              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1234                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL1_REG")
    1235                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1236              $C$DW$115       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1238                      .dwattr $C$DW$115, DW_AT_name("all")
    1239                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1240                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$116       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$35)
    1244                      .dwattr $C$DW$116, DW_AT_name("bit")
    1245                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    1246                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1248                      .dwendtag $C$DW$T$36
    1249              
    1250              
    1251              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1252                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL2_BITS")
    1253                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1254              $C$DW$117       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$117, DW_AT_name("AUXOSCCLKSRCSEL")
    1257                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    1258                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1259                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$118       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$118, DW_AT_name("CANABCLKSEL")
    1264                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_CANABCLKSEL")
    1265                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1266                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$119       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$119, DW_AT_name("CANBBCLKSEL")
    1271                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    1272                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   25

    1273                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1274                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1275              $C$DW$120       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    1278                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    1279                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1280                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1281                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$121       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    1285                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    1286                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1287                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1288                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1289                      .dwendtag $C$DW$T$37
    1290              
    1291              
    1292              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1293                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL2_REG")
    1294                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1295              $C$DW$122       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1297                      .dwattr $C$DW$122, DW_AT_name("all")
    1298                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1299                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$123       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$37)
    1303                      .dwattr $C$DW$123, DW_AT_name("bit")
    1304                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1305                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1307                      .dwendtag $C$DW$T$38
    1308              
    1309              
    1310              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1311                      .dwattr $C$DW$T$39, DW_AT_name("CLKSRCCTL3_BITS")
    1312                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1313              $C$DW$124       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$124, DW_AT_name("XCLKOUTSEL")
    1316                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    1317                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1318                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$125       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    1323                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    1324                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1325                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$126       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   26

    1328                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$126, DW_AT_name("rsvd2")
    1330                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2")
    1331                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1332                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1334                      .dwendtag $C$DW$T$39
    1335              
    1336              
    1337              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1338                      .dwattr $C$DW$T$40, DW_AT_name("CLKSRCCTL3_REG")
    1339                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1340              $C$DW$127       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
    1342                      .dwattr $C$DW$127, DW_AT_name("all")
    1343                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_all")
    1344                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1345                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1346              $C$DW$128       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$39)
    1348                      .dwattr $C$DW$128, DW_AT_name("bit")
    1349                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bit")
    1350                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1352                      .dwendtag $C$DW$T$40
    1353              
    1354              
    1355              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1356                      .dwattr $C$DW$T$43, DW_AT_name("CLK_CFG_REGS")
    1357                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x32)
    1358              $C$DW$129       .dwtag  DW_TAG_member
    1359                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$34)
    1360                      .dwattr $C$DW$129, DW_AT_name("CLKSEM")
    1361                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_CLKSEM")
    1362                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$130       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
    1366                      .dwattr $C$DW$130, DW_AT_name("CLKCFGLOCK1")
    1367                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    1368                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1369                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$131       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$41)
    1372                      .dwattr $C$DW$131, DW_AT_name("rsvd1")
    1373                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_rsvd1")
    1374                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1375                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$132       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$36)
    1378                      .dwattr $C$DW$132, DW_AT_name("CLKSRCCTL1")
    1379                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1380                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1381                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1382              $C$DW$133       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   27

    1383                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$38)
    1384                      .dwattr $C$DW$133, DW_AT_name("CLKSRCCTL2")
    1385                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1386                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1387                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1388              $C$DW$134       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$40)
    1390                      .dwattr $C$DW$134, DW_AT_name("CLKSRCCTL3")
    1391                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1392                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1393                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1394              $C$DW$135       .dwtag  DW_TAG_member
    1395                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$168)
    1396                      .dwattr $C$DW$135, DW_AT_name("SYSPLLCTL1")
    1397                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1398                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1399                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$136       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$170)
    1402                      .dwattr $C$DW$136, DW_AT_name("SYSPLLCTL2")
    1403                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1404                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1405                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$137       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$172)
    1408                      .dwattr $C$DW$137, DW_AT_name("SYSPLLCTL3")
    1409                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1410                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1411                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$138       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$174)
    1414                      .dwattr $C$DW$138, DW_AT_name("SYSPLLMULT")
    1415                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1416                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1417                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$139       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$176)
    1420                      .dwattr $C$DW$139, DW_AT_name("SYSPLLSTS")
    1421                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_SYSPLLSTS")
    1422                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1423                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1424              $C$DW$140       .dwtag  DW_TAG_member
    1425                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$24)
    1426                      .dwattr $C$DW$140, DW_AT_name("AUXPLLCTL1")
    1427                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1428                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1429                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$141       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$41)
    1432                      .dwattr $C$DW$141, DW_AT_name("rsvd2")
    1433                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd2")
    1434                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1435                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1436              $C$DW$142       .dwtag  DW_TAG_member
    1437                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$26)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   28

    1438                      .dwattr $C$DW$142, DW_AT_name("AUXPLLMULT")
    1439                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1440                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1441                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$143       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$28)
    1444                      .dwattr $C$DW$143, DW_AT_name("AUXPLLSTS")
    1445                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_AUXPLLSTS")
    1446                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1447                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$144       .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$166)
    1450                      .dwattr $C$DW$144, DW_AT_name("SYSCLKDIVSEL")
    1451                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1452                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1453                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$145       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    1456                      .dwattr $C$DW$145, DW_AT_name("AUXCLKDIVSEL")
    1457                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1458                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1459                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$146       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$143)
    1462                      .dwattr $C$DW$146, DW_AT_name("PERCLKDIVSEL")
    1463                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1464                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1465                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1466              $C$DW$147       .dwtag  DW_TAG_member
    1467                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$182)
    1468                      .dwattr $C$DW$147, DW_AT_name("XCLKOUTDIVSEL")
    1469                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    1470                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1471                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$148       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$42)
    1474                      .dwattr $C$DW$148, DW_AT_name("rsvd3")
    1475                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd3")
    1476                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1477                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1478              $C$DW$149       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$105)
    1480                      .dwattr $C$DW$149, DW_AT_name("LOSPCP")
    1481                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_LOSPCP")
    1482                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1483                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$150       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$109)
    1486                      .dwattr $C$DW$150, DW_AT_name("MCDCR")
    1487                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_MCDCR")
    1488                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1489                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1490              $C$DW$151       .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$180)
    1492                      .dwattr $C$DW$151, DW_AT_name("X1CNT")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   29

    1493                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_X1CNT")
    1494                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1495                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1496                      .dwendtag $C$DW$T$43
    1497              
    1498              $C$DW$152       .dwtag  DW_TAG_TI_far_type
    1499                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$43)
    1500              $C$DW$T$184     .dwtag  DW_TAG_volatile_type
    1501                      .dwattr $C$DW$T$184, DW_AT_type(*$C$DW$152)
    1502              
    1503              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1504                      .dwattr $C$DW$T$44, DW_AT_name("CPUSYSLOCK1_BITS")
    1505                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1506              $C$DW$153       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1508                      .dwattr $C$DW$153, DW_AT_name("HIBBOOTMODE")
    1509                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1510                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1511                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1513              $C$DW$154       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1515                      .dwattr $C$DW$154, DW_AT_name("IORESTOREADDR")
    1516                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1517                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1518                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1519                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1520              $C$DW$155       .dwtag  DW_TAG_member
    1521                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1522                      .dwattr $C$DW$155, DW_AT_name("PIEVERRADDR")
    1523                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1524                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1525                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1526                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1527              $C$DW$156       .dwtag  DW_TAG_member
    1528                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1529                      .dwattr $C$DW$156, DW_AT_name("PCLKCR0")
    1530                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PCLKCR0")
    1531                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1532                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1533                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1534              $C$DW$157       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1536                      .dwattr $C$DW$157, DW_AT_name("PCLKCR1")
    1537                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PCLKCR1")
    1538                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1539                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1540                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1541              $C$DW$158       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$158, DW_AT_name("PCLKCR2")
    1544                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PCLKCR2")
    1545                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1546                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1547                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   30

    1548              $C$DW$159       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$159, DW_AT_name("PCLKCR3")
    1551                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PCLKCR3")
    1552                      .dwattr $C$DW$159, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1553                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1555              $C$DW$160       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$160, DW_AT_name("PCLKCR4")
    1558                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PCLKCR4")
    1559                      .dwattr $C$DW$160, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1560                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$161       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$161, DW_AT_name("PCLKCR5")
    1565                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PCLKCR5")
    1566                      .dwattr $C$DW$161, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1567                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1569              $C$DW$162       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1571                      .dwattr $C$DW$162, DW_AT_name("PCLKCR6")
    1572                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_PCLKCR6")
    1573                      .dwattr $C$DW$162, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1574                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1576              $C$DW$163       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1578                      .dwattr $C$DW$163, DW_AT_name("PCLKCR7")
    1579                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_PCLKCR7")
    1580                      .dwattr $C$DW$163, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1581                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$164       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$164, DW_AT_name("PCLKCR8")
    1586                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_PCLKCR8")
    1587                      .dwattr $C$DW$164, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1588                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1590              $C$DW$165       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$165, DW_AT_name("PCLKCR9")
    1593                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PCLKCR9")
    1594                      .dwattr $C$DW$165, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1595                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1596                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1597              $C$DW$166       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1599                      .dwattr $C$DW$166, DW_AT_name("PCLKCR10")
    1600                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PCLKCR10")
    1601                      .dwattr $C$DW$166, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1602                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   31

    1603                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1604              $C$DW$167       .dwtag  DW_TAG_member
    1605                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1606                      .dwattr $C$DW$167, DW_AT_name("PCLKCR11")
    1607                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PCLKCR11")
    1608                      .dwattr $C$DW$167, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1609                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1610                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1611              $C$DW$168       .dwtag  DW_TAG_member
    1612                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1613                      .dwattr $C$DW$168, DW_AT_name("PCLKCR12")
    1614                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PCLKCR12")
    1615                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1616                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1617                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1618              $C$DW$169       .dwtag  DW_TAG_member
    1619                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1620                      .dwattr $C$DW$169, DW_AT_name("PCLKCR13")
    1621                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PCLKCR13")
    1622                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1623                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1624                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1625              $C$DW$170       .dwtag  DW_TAG_member
    1626                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1627                      .dwattr $C$DW$170, DW_AT_name("PCLKCR14")
    1628                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PCLKCR14")
    1629                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1630                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1631                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1632              $C$DW$171       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1634                      .dwattr $C$DW$171, DW_AT_name("PCLKCR15")
    1635                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PCLKCR15")
    1636                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1637                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1638                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$172       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1641                      .dwattr $C$DW$172, DW_AT_name("PCLKCR16")
    1642                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PCLKCR16")
    1643                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1644                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1645                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1646              $C$DW$173       .dwtag  DW_TAG_member
    1647                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1648                      .dwattr $C$DW$173, DW_AT_name("SECMSEL")
    1649                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SECMSEL")
    1650                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1651                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1652                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1653              $C$DW$174       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$174, DW_AT_name("LPMCR")
    1656                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_LPMCR")
    1657                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   32

    1658                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1659                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1660              $C$DW$175       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$175, DW_AT_name("GPIOLPMSEL0")
    1663                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1664                      .dwattr $C$DW$175, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1665                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1666                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1667              $C$DW$176       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$176, DW_AT_name("GPIOLPMSEL1")
    1670                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1671                      .dwattr $C$DW$176, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1672                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1673                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1674              $C$DW$177       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$177, DW_AT_name("rsvd1")
    1677                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd1")
    1678                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1679                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1680                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1681                      .dwendtag $C$DW$T$44
    1682              
    1683              
    1684              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1685                      .dwattr $C$DW$T$45, DW_AT_name("CPUSYSLOCK1_REG")
    1686                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1687              $C$DW$178       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    1689                      .dwattr $C$DW$178, DW_AT_name("all")
    1690                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_all")
    1691                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$179       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$44)
    1695                      .dwattr $C$DW$179, DW_AT_name("bit")
    1696                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_bit")
    1697                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1698                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1699                      .dwendtag $C$DW$T$45
    1700              
    1701              
    1702              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1703                      .dwattr $C$DW$T$48, DW_AT_name("CPU_SYS_REGS")
    1704                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x82)
    1705              $C$DW$180       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$45)
    1707                      .dwattr $C$DW$180, DW_AT_name("CPUSYSLOCK1")
    1708                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    1709                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$181       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$41)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   33

    1713                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
    1714                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
    1715                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1716                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$182       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    1719                      .dwattr $C$DW$182, DW_AT_name("HIBBOOTMODE")
    1720                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1721                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1722                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$183       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$103)
    1725                      .dwattr $C$DW$183, DW_AT_name("IORESTOREADDR")
    1726                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1727                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1728                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$184       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$145)
    1731                      .dwattr $C$DW$184, DW_AT_name("PIEVERRADDR")
    1732                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1733                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1734                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$185       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$46)
    1737                      .dwattr $C$DW$185, DW_AT_name("rsvd2")
    1738                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd2")
    1739                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1740                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$186       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$111)
    1743                      .dwattr $C$DW$186, DW_AT_name("PCLKCR0")
    1744                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PCLKCR0")
    1745                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1746                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$187       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$125)
    1749                      .dwattr $C$DW$187, DW_AT_name("PCLKCR1")
    1750                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PCLKCR1")
    1751                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1752                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1753              $C$DW$188       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$127)
    1755                      .dwattr $C$DW$188, DW_AT_name("PCLKCR2")
    1756                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PCLKCR2")
    1757                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1758                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$189       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$129)
    1761                      .dwattr $C$DW$189, DW_AT_name("PCLKCR3")
    1762                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PCLKCR3")
    1763                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1764                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$190       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$131)
    1767                      .dwattr $C$DW$190, DW_AT_name("PCLKCR4")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   34

    1768                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_PCLKCR4")
    1769                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1770                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$191       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$133)
    1773                      .dwattr $C$DW$191, DW_AT_name("PCLKCR5")
    1774                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PCLKCR5")
    1775                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1776                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$192       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$135)
    1779                      .dwattr $C$DW$192, DW_AT_name("PCLKCR6")
    1780                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_PCLKCR6")
    1781                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1782                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$193       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$137)
    1785                      .dwattr $C$DW$193, DW_AT_name("PCLKCR7")
    1786                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_PCLKCR7")
    1787                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1788                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$194       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$139)
    1791                      .dwattr $C$DW$194, DW_AT_name("PCLKCR8")
    1792                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_PCLKCR8")
    1793                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1794                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$195       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$141)
    1797                      .dwattr $C$DW$195, DW_AT_name("PCLKCR9")
    1798                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_PCLKCR9")
    1799                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1800                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$196       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$113)
    1803                      .dwattr $C$DW$196, DW_AT_name("PCLKCR10")
    1804                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PCLKCR10")
    1805                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1806                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$197       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$115)
    1809                      .dwattr $C$DW$197, DW_AT_name("PCLKCR11")
    1810                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_PCLKCR11")
    1811                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1812                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$198       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$117)
    1815                      .dwattr $C$DW$198, DW_AT_name("PCLKCR12")
    1816                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_PCLKCR12")
    1817                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1818                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$199       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$119)
    1821                      .dwattr $C$DW$199, DW_AT_name("PCLKCR13")
    1822                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_PCLKCR13")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   35

    1823                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1824                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$200       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$121)
    1827                      .dwattr $C$DW$200, DW_AT_name("PCLKCR14")
    1828                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_PCLKCR14")
    1829                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1830                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$201       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$42)
    1833                      .dwattr $C$DW$201, DW_AT_name("rsvd3")
    1834                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd3")
    1835                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1836                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$202       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$123)
    1839                      .dwattr $C$DW$202, DW_AT_name("PCLKCR16")
    1840                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_PCLKCR16")
    1841                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1842                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$203       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$47)
    1845                      .dwattr $C$DW$203, DW_AT_name("rsvd4")
    1846                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_rsvd4")
    1847                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1848                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$204       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$30)
    1851                      .dwattr $C$DW$204, DW_AT_name("CCR")
    1852                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_CCR")
    1853                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1854                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$205       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$149)
    1857                      .dwattr $C$DW$205, DW_AT_name("SECMSEL")
    1858                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_SECMSEL")
    1859                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1860                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$206       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$107)
    1863                      .dwattr $C$DW$206, DW_AT_name("LPMCR")
    1864                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_LPMCR")
    1865                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1866                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$207       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$98)
    1869                      .dwattr $C$DW$207, DW_AT_name("GPIOLPMSEL0")
    1870                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1871                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1872                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$208       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$100)
    1875                      .dwattr $C$DW$208, DW_AT_name("GPIOLPMSEL1")
    1876                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1877                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:32:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0518010                         PAGE   36

    1878                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$209       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$178)
    1881                      .dwattr $C$DW$209, DW_AT_name("TMR2CLKCTL")
    1882                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    1883                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1884                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$210       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$42)
    1887                      .dwattr $C$DW$210, DW_AT_name("rsvd5")
    1888                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_rsvd5")
    1889                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    1890                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$211       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$147)
    1893                      .dwattr $C$DW$211, DW_AT_name("RESC")
    1894                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_RESC")
