TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:26:12 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("load_itrap_address")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_load_itrap_address")

    2399                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    2400 00000122 2B19!         MOV       @_PieCtrlRegs+25,#0   ; [CPU_] |680| 
    2401                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    2402 00000123 1A00!         OR        @_PieCtrlRegs,#0x0001 ; [CPU_] |683| 
         00000124 0001 
    2403                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   50

    2404 00000125 2801!         MOV       @_PieCtrlRegs+1,#65535 ; [CPU_] |686| 
         00000126 FFFF 
    2405                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    2406 00000127 2910   clrc INTM
    2407                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    2408 00000128 FF69          SPM       #0                    ; [CPU_] 
    2409              $C$DW$130       .dwtag  DW_TAG_TI_branch
    2410                      .dwattr $C$DW$130, DW_AT_low_pc(0x00)
    2411                      .dwattr $C$DW$130, DW_AT_TI_return
    2412 00000129 0006          LRETR     ; [CPU_] 
    2413                      ; return occurs ; [] 
    2414                      .dwattr $C$DW$129, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boot
    2415                      .dwattr $C$DW$129, DW_AT_TI_end_line(0x2b3)
    2416                      .dwattr $C$DW$129, DW_AT_TI_end_column(0x01)
    2417                      .dwendentry
    2418                      .dwendtag $C$DW$129
    2419              
    2420              ;**************************************************************
    2421              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2422              ;**************************************************************
    2423                      .global _load_itrap_address
    2424                      .global _c1brom_c2c1_ipc_clear_bits_32
    2425                      .global _c1brom_c2c1_ipc_clear_bits_16
    2426                      .global _c1brom_c2c1_ipc_write_data_32
    2427                      .global _c1brom_c2c1_ipc_write_data_16
    2428                      .global _sysctl_wdog_enable
    2429                      .global _c1brom_c2c1_ipc_set_bits_32
    2430                      .global _c1brom_c2c1_ipc_set_bits_16
    2431                      .global _c1brom_c2c1_ipc_read_data_16
    2432                      .global _c1brom_c2c1_ipc_clear_bits_protected_32
    2433                      .global _c1brom_c2c1_ipc_write_data_protected_16
    2434                      .global _c1brom_c2c1_ipc_set_bits_protected_32
    2435                      .global _c1brom_c2c1_ipc_clear_bits_protected_16
    2436                      .global _c1brom_c2c1_ipc_read_data_protected_32
    2437                      .global _c1brom_c2c1_ipc_read_data_32
    2438                      .global _c1brom_c2c1_ipc_write_data_protected_32
    2439                      .global _c1brom_c2c1_ipc_read_data_protected_16
    2440                      .global _c1brom_c2c1_ipc_set_bits_protected_16
    2441                      .global _c1brom_status
    2442                      .global _c1brom_current_c2c1_ipc
    2443                      .global _NmiIntruptRegs
    2444                      .global _PieCtrlRegs
    2445                      .global _IpcRegs
    2446                      .global _CpuSysRegs
    2447                      .global _PieVectTable
    2448              
    2449              ;***************************************************************
    2450              ;* TYPE INFORMATION                                            *
    2451              ;***************************************************************
    2452              
    2453              $C$DW$T$159     .dwtag  DW_TAG_enumeration_type
    2454                      .dwattr $C$DW$T$159, DW_AT_byte_size(0x01)
    2455              $C$DW$131       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
    2456              $C$DW$132       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
    2457              $C$DW$133       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   51

    2458              $C$DW$134       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
    2459                      .dwendtag $C$DW$T$159
    2460              
    2461              $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
    2462                      .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$159)
    2463                      .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    2464              
    2465              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2466                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
    2467                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    2468              $C$DW$135       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$135, DW_AT_name("VMAPS")
    2471                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_VMAPS")
    2472                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2473                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2474                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2475              $C$DW$136       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2477                      .dwattr $C$DW$136, DW_AT_name("MONPRIV")
    2478                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_MONPRIV")
    2479                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2480                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2481                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2482              $C$DW$137       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2484                      .dwattr $C$DW$137, DW_AT_name("ENPROT")
    2485                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ENPROT")
    2486                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2487                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2488                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2489              $C$DW$138       .dwtag  DW_TAG_member
    2490                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2491                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    2492                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    2493                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    2494                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2495                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2496              $C$DW$139       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2498                      .dwattr $C$DW$139, DW_AT_name("rsvd2")
    2499                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd2")
    2500                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    2501                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2502                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2503                      .dwendtag $C$DW$T$20
    2504              
    2505              
    2506              $C$DW$T$22      .dwtag  DW_TAG_union_type
    2507                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
    2508                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    2509              $C$DW$140       .dwtag  DW_TAG_member
    2510                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    2511                      .dwattr $C$DW$140, DW_AT_name("all")
    2512                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   52

    2513                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2514                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2515              $C$DW$141       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    2517                      .dwattr $C$DW$141, DW_AT_name("bit")
    2518                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    2519                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2520                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2521                      .dwendtag $C$DW$T$22
    2522              
    2523              
    2524              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2525                      .dwattr $C$DW$T$23, DW_AT_name("CPUSYSLOCK1_BITS")
    2526                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    2527              $C$DW$142       .dwtag  DW_TAG_member
    2528                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2529                      .dwattr $C$DW$142, DW_AT_name("HIBBOOTMODE")
    2530                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2531                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2532                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2533                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2534              $C$DW$143       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2536                      .dwattr $C$DW$143, DW_AT_name("IORESTOREADDR")
    2537                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2538                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2539                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2540                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2541              $C$DW$144       .dwtag  DW_TAG_member
    2542                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2543                      .dwattr $C$DW$144, DW_AT_name("PIEVERRADDR")
    2544                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2545                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2546                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2547                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$145       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2550                      .dwattr $C$DW$145, DW_AT_name("PCLKCR0")
    2551                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PCLKCR0")
    2552                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2553                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2554                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2555              $C$DW$146       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$146, DW_AT_name("PCLKCR1")
    2558                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PCLKCR1")
    2559                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2560                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2561                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2562              $C$DW$147       .dwtag  DW_TAG_member
    2563                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2564                      .dwattr $C$DW$147, DW_AT_name("PCLKCR2")
    2565                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PCLKCR2")
    2566                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2567                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   53

    2568                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2569              $C$DW$148       .dwtag  DW_TAG_member
    2570                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2571                      .dwattr $C$DW$148, DW_AT_name("PCLKCR3")
    2572                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PCLKCR3")
    2573                      .dwattr $C$DW$148, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2574                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2575                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2576              $C$DW$149       .dwtag  DW_TAG_member
    2577                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2578                      .dwattr $C$DW$149, DW_AT_name("PCLKCR4")
    2579                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PCLKCR4")
    2580                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2581                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2582                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2583              $C$DW$150       .dwtag  DW_TAG_member
    2584                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2585                      .dwattr $C$DW$150, DW_AT_name("PCLKCR5")
    2586                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PCLKCR5")
    2587                      .dwattr $C$DW$150, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2588                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2589                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2590              $C$DW$151       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2592                      .dwattr $C$DW$151, DW_AT_name("PCLKCR6")
    2593                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PCLKCR6")
    2594                      .dwattr $C$DW$151, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2595                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2596                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2597              $C$DW$152       .dwtag  DW_TAG_member
    2598                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2599                      .dwattr $C$DW$152, DW_AT_name("PCLKCR7")
    2600                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PCLKCR7")
    2601                      .dwattr $C$DW$152, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2602                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2603                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2604              $C$DW$153       .dwtag  DW_TAG_member
    2605                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2606                      .dwattr $C$DW$153, DW_AT_name("PCLKCR8")
    2607                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PCLKCR8")
    2608                      .dwattr $C$DW$153, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2609                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2610                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2611              $C$DW$154       .dwtag  DW_TAG_member
    2612                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2613                      .dwattr $C$DW$154, DW_AT_name("PCLKCR9")
    2614                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PCLKCR9")
    2615                      .dwattr $C$DW$154, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2616                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2617                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2618              $C$DW$155       .dwtag  DW_TAG_member
    2619                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2620                      .dwattr $C$DW$155, DW_AT_name("PCLKCR10")
    2621                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PCLKCR10")
    2622                      .dwattr $C$DW$155, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   54

    2623                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2625              $C$DW$156       .dwtag  DW_TAG_member
    2626                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2627                      .dwattr $C$DW$156, DW_AT_name("PCLKCR11")
    2628                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PCLKCR11")
    2629                      .dwattr $C$DW$156, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2630                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2631                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2632              $C$DW$157       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2634                      .dwattr $C$DW$157, DW_AT_name("PCLKCR12")
    2635                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PCLKCR12")
    2636                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2637                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2639              $C$DW$158       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2641                      .dwattr $C$DW$158, DW_AT_name("PCLKCR13")
    2642                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PCLKCR13")
    2643                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2644                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2645                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2646              $C$DW$159       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2648                      .dwattr $C$DW$159, DW_AT_name("PCLKCR14")
    2649                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PCLKCR14")
    2650                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2651                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2652                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2653              $C$DW$160       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$160, DW_AT_name("PCLKCR15")
    2656                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PCLKCR15")
    2657                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2658                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2659                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2660              $C$DW$161       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2662                      .dwattr $C$DW$161, DW_AT_name("PCLKCR16")
    2663                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PCLKCR16")
    2664                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2665                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2666                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2667              $C$DW$162       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$162, DW_AT_name("SECMSEL")
    2670                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_SECMSEL")
    2671                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2672                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2673                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$163       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2676                      .dwattr $C$DW$163, DW_AT_name("LPMCR")
    2677                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_LPMCR")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   55

    2678                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2679                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2680                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2681              $C$DW$164       .dwtag  DW_TAG_member
    2682                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2683                      .dwattr $C$DW$164, DW_AT_name("GPIOLPMSEL0")
    2684                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2685                      .dwattr $C$DW$164, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2686                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2687                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2688              $C$DW$165       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$165, DW_AT_name("GPIOLPMSEL1")
    2691                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    2692                      .dwattr $C$DW$165, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2693                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2694                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2695              $C$DW$166       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    2698                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    2699                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2700                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2701                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2702                      .dwendtag $C$DW$T$23
    2703              
    2704              
    2705              $C$DW$T$24      .dwtag  DW_TAG_union_type
    2706                      .dwattr $C$DW$T$24, DW_AT_name("CPUSYSLOCK1_REG")
    2707                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    2708              $C$DW$167       .dwtag  DW_TAG_member
    2709                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    2710                      .dwattr $C$DW$167, DW_AT_name("all")
    2711                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    2712                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2714              $C$DW$168       .dwtag  DW_TAG_member
    2715                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$23)
    2716                      .dwattr $C$DW$168, DW_AT_name("bit")
    2717                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    2718                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2719                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2720                      .dwendtag $C$DW$T$24
    2721              
    2722              
    2723              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2724                      .dwattr $C$DW$T$29, DW_AT_name("CPU_SYS_REGS")
    2725                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x82)
    2726              $C$DW$169       .dwtag  DW_TAG_member
    2727                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$24)
    2728                      .dwattr $C$DW$169, DW_AT_name("CPUSYSLOCK1")
    2729                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    2730                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2732              $C$DW$170       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   56

    2733                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$25)
    2734                      .dwattr $C$DW$170, DW_AT_name("rsvd1")
    2735                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd1")
    2736                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2737                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2738              $C$DW$171       .dwtag  DW_TAG_member
    2739                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    2740                      .dwattr $C$DW$171, DW_AT_name("HIBBOOTMODE")
    2741                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    2742                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2743                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2744              $C$DW$172       .dwtag  DW_TAG_member
    2745                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$35)
    2746                      .dwattr $C$DW$172, DW_AT_name("IORESTOREADDR")
    2747                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_IORESTOREADDR")
    2748                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2749                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2750              $C$DW$173       .dwtag  DW_TAG_member
    2751                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$145)
    2752                      .dwattr $C$DW$173, DW_AT_name("PIEVERRADDR")
    2753                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PIEVERRADDR")
    2754                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2755                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2756              $C$DW$174       .dwtag  DW_TAG_member
    2757                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$26)
    2758                      .dwattr $C$DW$174, DW_AT_name("rsvd2")
    2759                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd2")
    2760                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2761                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2762              $C$DW$175       .dwtag  DW_TAG_member
    2763                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$61)
    2764                      .dwattr $C$DW$175, DW_AT_name("PCLKCR0")
    2765                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PCLKCR0")
    2766                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2767                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$176       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$75)
    2770                      .dwattr $C$DW$176, DW_AT_name("PCLKCR1")
    2771                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PCLKCR1")
    2772                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2773                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2774              $C$DW$177       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$77)
    2776                      .dwattr $C$DW$177, DW_AT_name("PCLKCR2")
    2777                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PCLKCR2")
    2778                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2779                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2780              $C$DW$178       .dwtag  DW_TAG_member
    2781                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$79)
    2782                      .dwattr $C$DW$178, DW_AT_name("PCLKCR3")
    2783                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PCLKCR3")
    2784                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2785                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2786              $C$DW$179       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$81)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   57

    2788                      .dwattr $C$DW$179, DW_AT_name("PCLKCR4")
    2789                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PCLKCR4")
    2790                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2791                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2792              $C$DW$180       .dwtag  DW_TAG_member
    2793                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$83)
    2794                      .dwattr $C$DW$180, DW_AT_name("PCLKCR5")
    2795                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PCLKCR5")
    2796                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2797                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2798              $C$DW$181       .dwtag  DW_TAG_member
    2799                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$85)
    2800                      .dwattr $C$DW$181, DW_AT_name("PCLKCR6")
    2801                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PCLKCR6")
    2802                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2803                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2804              $C$DW$182       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$87)
    2806                      .dwattr $C$DW$182, DW_AT_name("PCLKCR7")
    2807                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PCLKCR7")
    2808                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2809                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2810              $C$DW$183       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$89)
    2812                      .dwattr $C$DW$183, DW_AT_name("PCLKCR8")
    2813                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_PCLKCR8")
    2814                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2815                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2816              $C$DW$184       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$91)
    2818                      .dwattr $C$DW$184, DW_AT_name("PCLKCR9")
    2819                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_PCLKCR9")
    2820                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2821                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2822              $C$DW$185       .dwtag  DW_TAG_member
    2823                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$63)
    2824                      .dwattr $C$DW$185, DW_AT_name("PCLKCR10")
    2825                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_PCLKCR10")
    2826                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2827                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2828              $C$DW$186       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$65)
    2830                      .dwattr $C$DW$186, DW_AT_name("PCLKCR11")
    2831                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_PCLKCR11")
    2832                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2833                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2834              $C$DW$187       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$67)
    2836                      .dwattr $C$DW$187, DW_AT_name("PCLKCR12")
    2837                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_PCLKCR12")
    2838                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2839                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2840              $C$DW$188       .dwtag  DW_TAG_member
    2841                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$69)
    2842                      .dwattr $C$DW$188, DW_AT_name("PCLKCR13")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   58

    2843                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_PCLKCR13")
    2844                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2845                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2846              $C$DW$189       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$71)
    2848                      .dwattr $C$DW$189, DW_AT_name("PCLKCR14")
    2849                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_PCLKCR14")
    2850                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2851                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2852              $C$DW$190       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$27)
    2854                      .dwattr $C$DW$190, DW_AT_name("rsvd3")
    2855                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd3")
    2856                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2857                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2858              $C$DW$191       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$73)
    2860                      .dwattr $C$DW$191, DW_AT_name("PCLKCR16")
    2861                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_PCLKCR16")
    2862                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2863                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2864              $C$DW$192       .dwtag  DW_TAG_member
    2865                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$28)
    2866                      .dwattr $C$DW$192, DW_AT_name("rsvd4")
    2867                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd4")
    2868                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2869                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$193       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$22)
    2872                      .dwattr $C$DW$193, DW_AT_name("CCR")
    2873                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CCR")
    2874                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    2875                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2876              $C$DW$194       .dwtag  DW_TAG_member
    2877                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$156)
    2878                      .dwattr $C$DW$194, DW_AT_name("SECMSEL")
    2879                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SECMSEL")
    2880                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    2881                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2882              $C$DW$195       .dwtag  DW_TAG_member
    2883                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$48)
    2884                      .dwattr $C$DW$195, DW_AT_name("LPMCR")
    2885                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_LPMCR")
    2886                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    2887                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2888              $C$DW$196       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$31)
    2890                      .dwattr $C$DW$196, DW_AT_name("GPIOLPMSEL0")
    2891                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    2892                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2893                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2894              $C$DW$197       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$33)
    2896                      .dwattr $C$DW$197, DW_AT_name("GPIOLPMSEL1")
    2897                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   59

    2898                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    2899                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$198       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$158)
    2902                      .dwattr $C$DW$198, DW_AT_name("TMR2CLKCTL")
    2903                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    2904                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    2905                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2906              $C$DW$199       .dwtag  DW_TAG_member
    2907                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$27)
    2908                      .dwattr $C$DW$199, DW_AT_name("rsvd5")
    2909                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd5")
    2910                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    2911                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2912              $C$DW$200       .dwtag  DW_TAG_member
    2913                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$154)
    2914                      .dwattr $C$DW$200, DW_AT_name("RESC")
    2915                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_RESC")
    2916                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    2917                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2918                      .dwendtag $C$DW$T$29
    2919              
    2920              $C$DW$201       .dwtag  DW_TAG_TI_far_type
    2921                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$29)
    2922              $C$DW$T$165     .dwtag  DW_TAG_volatile_type
    2923                      .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$201)
    2924              
    2925              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2926                      .dwattr $C$DW$T$30, DW_AT_name("GPIOLPMSEL0_BITS")
    2927                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2928              $C$DW$202       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2930                      .dwattr $C$DW$202, DW_AT_name("GPIO0")
    2931                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO0")
    2932                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2933                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2934                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2935              $C$DW$203       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2937                      .dwattr $C$DW$203, DW_AT_name("GPIO1")
    2938                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIO1")
    2939                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2940                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2941                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2942              $C$DW$204       .dwtag  DW_TAG_member
    2943                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2944                      .dwattr $C$DW$204, DW_AT_name("GPIO2")
    2945                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPIO2")
    2946                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2947                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2948                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2949              $C$DW$205       .dwtag  DW_TAG_member
    2950                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2951                      .dwattr $C$DW$205, DW_AT_name("GPIO3")
    2952                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO3")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   60

    2953                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2954                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2955                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2956              $C$DW$206       .dwtag  DW_TAG_member
    2957                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2958                      .dwattr $C$DW$206, DW_AT_name("GPIO4")
    2959                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO4")
    2960                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2961                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2962                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2963              $C$DW$207       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2965                      .dwattr $C$DW$207, DW_AT_name("GPIO5")
    2966                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIO5")
    2967                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2968                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2969                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2970              $C$DW$208       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2972                      .dwattr $C$DW$208, DW_AT_name("GPIO6")
    2973                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIO6")
    2974                      .dwattr $C$DW$208, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2975                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2976                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2977              $C$DW$209       .dwtag  DW_TAG_member
    2978                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2979                      .dwattr $C$DW$209, DW_AT_name("GPIO7")
    2980                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIO7")
    2981                      .dwattr $C$DW$209, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2982                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2983                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2984              $C$DW$210       .dwtag  DW_TAG_member
    2985                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2986                      .dwattr $C$DW$210, DW_AT_name("GPIO8")
    2987                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIO8")
    2988                      .dwattr $C$DW$210, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2989                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2990                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2991              $C$DW$211       .dwtag  DW_TAG_member
    2992                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2993                      .dwattr $C$DW$211, DW_AT_name("GPIO9")
    2994                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GPIO9")
    2995                      .dwattr $C$DW$211, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2996                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2997                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2998              $C$DW$212       .dwtag  DW_TAG_member
    2999                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3000                      .dwattr $C$DW$212, DW_AT_name("GPIO10")
    3001                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GPIO10")
    3002                      .dwattr $C$DW$212, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3003                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3004                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3005              $C$DW$213       .dwtag  DW_TAG_member
    3006                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3007                      .dwattr $C$DW$213, DW_AT_name("GPIO11")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   61

    3008                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GPIO11")
    3009                      .dwattr $C$DW$213, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3010                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3011                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3012              $C$DW$214       .dwtag  DW_TAG_member
    3013                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3014                      .dwattr $C$DW$214, DW_AT_name("GPIO12")
    3015                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GPIO12")
    3016                      .dwattr $C$DW$214, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3017                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3018                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3019              $C$DW$215       .dwtag  DW_TAG_member
    3020                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3021                      .dwattr $C$DW$215, DW_AT_name("GPIO13")
    3022                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GPIO13")
    3023                      .dwattr $C$DW$215, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3024                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3026              $C$DW$216       .dwtag  DW_TAG_member
    3027                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3028                      .dwattr $C$DW$216, DW_AT_name("GPIO14")
    3029                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GPIO14")
    3030                      .dwattr $C$DW$216, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3031                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3032                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3033              $C$DW$217       .dwtag  DW_TAG_member
    3034                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3035                      .dwattr $C$DW$217, DW_AT_name("GPIO15")
    3036                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GPIO15")
    3037                      .dwattr $C$DW$217, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3038                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3039                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3040              $C$DW$218       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3042                      .dwattr $C$DW$218, DW_AT_name("GPIO16")
    3043                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GPIO16")
    3044                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3045                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3046                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$219       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3049                      .dwattr $C$DW$219, DW_AT_name("GPIO17")
    3050                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_GPIO17")
    3051                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3052                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3053                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3054              $C$DW$220       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3056                      .dwattr $C$DW$220, DW_AT_name("GPIO18")
    3057                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_GPIO18")
    3058                      .dwattr $C$DW$220, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3059                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3060                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3061              $C$DW$221       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   62

    3063                      .dwattr $C$DW$221, DW_AT_name("GPIO19")
    3064                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_GPIO19")
    3065                      .dwattr $C$DW$221, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3066                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3067                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3068              $C$DW$222       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3070                      .dwattr $C$DW$222, DW_AT_name("GPIO20")
    3071                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_GPIO20")
    3072                      .dwattr $C$DW$222, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3073                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3074                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3075              $C$DW$223       .dwtag  DW_TAG_member
    3076                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3077                      .dwattr $C$DW$223, DW_AT_name("GPIO21")
    3078                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_GPIO21")
    3079                      .dwattr $C$DW$223, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3080                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3081                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3082              $C$DW$224       .dwtag  DW_TAG_member
    3083                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3084                      .dwattr $C$DW$224, DW_AT_name("GPIO22")
    3085                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_GPIO22")
    3086                      .dwattr $C$DW$224, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3087                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3088                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3089              $C$DW$225       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3091                      .dwattr $C$DW$225, DW_AT_name("GPIO23")
    3092                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_GPIO23")
    3093                      .dwattr $C$DW$225, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3094                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3095                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3096              $C$DW$226       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3098                      .dwattr $C$DW$226, DW_AT_name("GPIO24")
    3099                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_GPIO24")
    3100                      .dwattr $C$DW$226, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3101                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3102                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3103              $C$DW$227       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    3105                      .dwattr $C$DW$227, DW_AT_name("GPIO25")
    3106                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_GPIO25")
    3107                      .dwattr $C$DW$227, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3108                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3109                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3110              $C$DW$228       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    3112                      .dwattr $C$DW$228, DW_AT_name("GPIO26")
    3113                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_GPIO26")
    3114                      .dwattr $C$DW$228, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3115                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3116                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3117              $C$DW$229       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   63

    3118                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3119                      .dwattr $C$DW$229, DW_AT_name("GPIO27")
    3120                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_GPIO27")
    3121                      .dwattr $C$DW$229, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3122                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3123                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3124              $C$DW$230       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3126                      .dwattr $C$DW$230, DW_AT_name("GPIO28")
    3127                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_GPIO28")
    3128                      .dwattr $C$DW$230, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3129                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3130                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3131              $C$DW$231       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3133                      .dwattr $C$DW$231, DW_AT_name("GPIO29")
    3134                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_GPIO29")
    3135                      .dwattr $C$DW$231, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3136                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3137                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3138              $C$DW$232       .dwtag  DW_TAG_member
    3139                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3140                      .dwattr $C$DW$232, DW_AT_name("GPIO30")
    3141                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_GPIO30")
    3142                      .dwattr $C$DW$232, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3143                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3144                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3145              $C$DW$233       .dwtag  DW_TAG_member
    3146                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
    3147                      .dwattr $C$DW$233, DW_AT_name("GPIO31")
    3148                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_GPIO31")
    3149                      .dwattr $C$DW$233, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3150                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3151                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3152                      .dwendtag $C$DW$T$30
    3153              
    3154              
    3155              $C$DW$T$31      .dwtag  DW_TAG_union_type
    3156                      .dwattr $C$DW$T$31, DW_AT_name("GPIOLPMSEL0_REG")
    3157                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    3158              $C$DW$234       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$21)
    3160                      .dwattr $C$DW$234, DW_AT_name("all")
    3161                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_all")
    3162                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3163                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3164              $C$DW$235       .dwtag  DW_TAG_member
    3165                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$30)
    3166                      .dwattr $C$DW$235, DW_AT_name("bit")
    3167                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_bit")
    3168                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3169                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3170                      .dwendtag $C$DW$T$31
    3171              
    3172              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   64

    3173              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3174                      .dwattr $C$DW$T$32, DW_AT_name("GPIOLPMSEL1_BITS")
    3175                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    3176              $C$DW$236       .dwtag  DW_TAG_member
    3177                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3178                      .dwattr $C$DW$236, DW_AT_name("GPIO32")
    3179                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_GPIO32")
    3180                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3181                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3182                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3183              $C$DW$237       .dwtag  DW_TAG_member
    3184                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3185                      .dwattr $C$DW$237, DW_AT_name("GPIO33")
    3186                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_GPIO33")
    3187                      .dwattr $C$DW$237, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3188                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3189                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3190              $C$DW$238       .dwtag  DW_TAG_member
    3191                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3192                      .dwattr $C$DW$238, DW_AT_name("GPIO34")
    3193                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_GPIO34")
    3194                      .dwattr $C$DW$238, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3195                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3196                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3197              $C$DW$239       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    3199                      .dwattr $C$DW$239, DW_AT_name("GPIO35")
    3200                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_GPIO35")
    3201                      .dwattr $C$DW$239, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3202                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3203                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3204              $C$DW$240       .dwtag  DW_TAG_member
    3205                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$19)
    3206                      .dwattr $C$DW$240, DW_AT_name("GPIO36")
    3207                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_GPIO36")
    3208                      .dwattr $C$DW$240, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3209                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3210                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3211              $C$DW$241       .dwtag  DW_TAG_member
    3212                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3213                      .dwattr $C$DW$241, DW_AT_name("GPIO37")
    3214                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_GPIO37")
    3215                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3216                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3217                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3218              $C$DW$242       .dwtag  DW_TAG_member
    3219                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3220                      .dwattr $C$DW$242, DW_AT_name("GPIO38")
    3221                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_GPIO38")
    3222                      .dwattr $C$DW$242, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3223                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3224                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3225              $C$DW$243       .dwtag  DW_TAG_member
    3226                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3227                      .dwattr $C$DW$243, DW_AT_name("GPIO39")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   65

    3228                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_GPIO39")
    3229                      .dwattr $C$DW$243, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3230                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3231                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3232              $C$DW$244       .dwtag  DW_TAG_member
    3233                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3234                      .dwattr $C$DW$244, DW_AT_name("GPIO40")
    3235                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_GPIO40")
    3236                      .dwattr $C$DW$244, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3237                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3238                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3239              $C$DW$245       .dwtag  DW_TAG_member
    3240                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3241                      .dwattr $C$DW$245, DW_AT_name("GPIO41")
    3242                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_GPIO41")
    3243                      .dwattr $C$DW$245, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3244                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3245                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3246              $C$DW$246       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3248                      .dwattr $C$DW$246, DW_AT_name("GPIO42")
    3249                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_GPIO42")
    3250                      .dwattr $C$DW$246, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3251                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3252                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3253              $C$DW$247       .dwtag  DW_TAG_member
    3254                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    3255                      .dwattr $C$DW$247, DW_AT_name("GPIO43")
    3256                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_GPIO43")
    3257                      .dwattr $C$DW$247, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3258                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3260              $C$DW$248       .dwtag  DW_TAG_member
    3261                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3262                      .dwattr $C$DW$248, DW_AT_name("GPIO44")
    3263                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_GPIO44")
    3264                      .dwattr $C$DW$248, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3265                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3266                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3267              $C$DW$249       .dwtag  DW_TAG_member
    3268                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3269                      .dwattr $C$DW$249, DW_AT_name("GPIO45")
    3270                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_GPIO45")
    3271                      .dwattr $C$DW$249, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3272                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3273                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3274              $C$DW$250       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    3276                      .dwattr $C$DW$250, DW_AT_name("GPIO46")
    3277                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_GPIO46")
    3278                      .dwattr $C$DW$250, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3279                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3280                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3281              $C$DW$251       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   66

    3283                      .dwattr $C$DW$251, DW_AT_name("GPIO47")
    3284                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_GPIO47")
    3285                      .dwattr $C$DW$251, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3286                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3287                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3288              $C$DW$252       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3290                      .dwattr $C$DW$252, DW_AT_name("GPIO48")
    3291                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_GPIO48")
    3292                      .dwattr $C$DW$252, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3293                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3294                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3295              $C$DW$253       .dwtag  DW_TAG_member
    3296                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3297                      .dwattr $C$DW$253, DW_AT_name("GPIO49")
    3298                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_GPIO49")
    3299                      .dwattr $C$DW$253, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3300                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3301                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3302              $C$DW$254       .dwtag  DW_TAG_member
    3303                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    3304                      .dwattr $C$DW$254, DW_AT_name("GPIO50")
    3305                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_GPIO50")
    3306                      .dwattr $C$DW$254, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3307                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3308                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3309              $C$DW$255       .dwtag  DW_TAG_member
    3310                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    3311                      .dwattr $C$DW$255, DW_AT_name("GPIO51")
    3312                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_GPIO51")
    3313                      .dwattr $C$DW$255, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3314                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3315                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3316              $C$DW$256       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3318                      .dwattr $C$DW$256, DW_AT_name("GPIO52")
    3319                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_GPIO52")
    3320                      .dwattr $C$DW$256, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3321                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3322                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3323              $C$DW$257       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3325                      .dwattr $C$DW$257, DW_AT_name("GPIO53")
    3326                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_GPIO53")
    3327                      .dwattr $C$DW$257, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3328                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3329                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3330              $C$DW$258       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3332                      .dwattr $C$DW$258, DW_AT_name("GPIO54")
    3333                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_GPIO54")
    3334                      .dwattr $C$DW$258, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3335                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3336                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3337              $C$DW$259       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   67

    3338                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3339                      .dwattr $C$DW$259, DW_AT_name("GPIO55")
    3340                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_GPIO55")
    3341                      .dwattr $C$DW$259, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3342                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3343                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3344              $C$DW$260       .dwtag  DW_TAG_member
    3345                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3346                      .dwattr $C$DW$260, DW_AT_name("GPIO56")
    3347                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_GPIO56")
    3348                      .dwattr $C$DW$260, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3349                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3350                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3351              $C$DW$261       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3353                      .dwattr $C$DW$261, DW_AT_name("GPIO57")
    3354                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_GPIO57")
    3355                      .dwattr $C$DW$261, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3356                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3357                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3358              $C$DW$262       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3360                      .dwattr $C$DW$262, DW_AT_name("GPIO58")
    3361                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_GPIO58")
    3362                      .dwattr $C$DW$262, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3363                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3364                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3365              $C$DW$263       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3367                      .dwattr $C$DW$263, DW_AT_name("GPIO59")
    3368                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_GPIO59")
    3369                      .dwattr $C$DW$263, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3370                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3371                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3372              $C$DW$264       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3374                      .dwattr $C$DW$264, DW_AT_name("GPIO60")
    3375                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_GPIO60")
    3376                      .dwattr $C$DW$264, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3377                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3378                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3379              $C$DW$265       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3381                      .dwattr $C$DW$265, DW_AT_name("GPIO61")
    3382                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_GPIO61")
    3383                      .dwattr $C$DW$265, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3384                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3385                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3386              $C$DW$266       .dwtag  DW_TAG_member
    3387                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3388                      .dwattr $C$DW$266, DW_AT_name("GPIO62")
    3389                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_GPIO62")
    3390                      .dwattr $C$DW$266, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3391                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3392                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   68

    3393              $C$DW$267       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3395                      .dwattr $C$DW$267, DW_AT_name("GPIO63")
    3396                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_GPIO63")
    3397                      .dwattr $C$DW$267, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3398                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3399                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3400                      .dwendtag $C$DW$T$32
    3401              
    3402              
    3403              $C$DW$T$33      .dwtag  DW_TAG_union_type
    3404                      .dwattr $C$DW$T$33, DW_AT_name("GPIOLPMSEL1_REG")
    3405                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    3406              $C$DW$268       .dwtag  DW_TAG_member
    3407                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$21)
    3408                      .dwattr $C$DW$268, DW_AT_name("all")
    3409                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_all")
    3410                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3411                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3412              $C$DW$269       .dwtag  DW_TAG_member
    3413                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$32)
    3414                      .dwattr $C$DW$269, DW_AT_name("bit")
    3415                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_bit")
    3416                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3417                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3418                      .dwendtag $C$DW$T$33
    3419              
    3420              
    3421              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3422                      .dwattr $C$DW$T$34, DW_AT_name("IORESTOREADDR_BITS")
    3423                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    3424              $C$DW$270       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$21)
    3426                      .dwattr $C$DW$270, DW_AT_name("ADDR")
    3427                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_ADDR")
    3428                      .dwattr $C$DW$270, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x16)
    3429                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3430                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3431              $C$DW$271       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3433                      .dwattr $C$DW$271, DW_AT_name("rsvd1")
    3434                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_rsvd1")
    3435                      .dwattr $C$DW$271, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    3436                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3437                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3438                      .dwendtag $C$DW$T$34
    3439              
    3440              
    3441              $C$DW$T$35      .dwtag  DW_TAG_union_type
    3442                      .dwattr $C$DW$T$35, DW_AT_name("IORESTOREADDR_REG")
    3443                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3444              $C$DW$272       .dwtag  DW_TAG_member
    3445                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$21)
    3446                      .dwattr $C$DW$272, DW_AT_name("all")
    3447                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   69

    3448                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3449                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$273       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$34)
    3452                      .dwattr $C$DW$273, DW_AT_name("bit")
    3453                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_bit")
    3454                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3455                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3456                      .dwendtag $C$DW$T$35
    3457              
    3458              
    3459              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3460                      .dwattr $C$DW$T$36, DW_AT_name("IPCACK_BITS")
    3461                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3462              $C$DW$274       .dwtag  DW_TAG_member
    3463                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3464                      .dwattr $C$DW$274, DW_AT_name("IPC0")
    3465                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_IPC0")
    3466                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3467                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3468                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3469              $C$DW$275       .dwtag  DW_TAG_member
    3470                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    3471                      .dwattr $C$DW$275, DW_AT_name("IPC1")
    3472                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_IPC1")
    3473                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3474                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3475                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3476              $C$DW$276       .dwtag  DW_TAG_member
    3477                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
    3478                      .dwattr $C$DW$276, DW_AT_name("IPC2")
    3479                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_IPC2")
    3480                      .dwattr $C$DW$276, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3481                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3482                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3483              $C$DW$277       .dwtag  DW_TAG_member
    3484                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3485                      .dwattr $C$DW$277, DW_AT_name("IPC3")
    3486                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_IPC3")
    3487                      .dwattr $C$DW$277, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3488                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3489                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3490              $C$DW$278       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    3492                      .dwattr $C$DW$278, DW_AT_name("IPC4")
    3493                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_IPC4")
    3494                      .dwattr $C$DW$278, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3495                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3496                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3497              $C$DW$279       .dwtag  DW_TAG_member
    3498                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    3499                      .dwattr $C$DW$279, DW_AT_name("IPC5")
    3500                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_IPC5")
    3501                      .dwattr $C$DW$279, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3502                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   70

    3503                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3504              $C$DW$280       .dwtag  DW_TAG_member
    3505                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    3506                      .dwattr $C$DW$280, DW_AT_name("IPC6")
    3507                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_IPC6")
    3508                      .dwattr $C$DW$280, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3509                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3510                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3511              $C$DW$281       .dwtag  DW_TAG_member
    3512                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    3513                      .dwattr $C$DW$281, DW_AT_name("IPC7")
    3514                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_IPC7")
    3515                      .dwattr $C$DW$281, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3516                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3517                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3518              $C$DW$282       .dwtag  DW_TAG_member
    3519                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    3520                      .dwattr $C$DW$282, DW_AT_name("IPC8")
    3521                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_IPC8")
    3522                      .dwattr $C$DW$282, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    3523                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3525              $C$DW$283       .dwtag  DW_TAG_member
    3526                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    3527                      .dwattr $C$DW$283, DW_AT_name("IPC9")
    3528                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_IPC9")
    3529                      .dwattr $C$DW$283, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    3530                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3531                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3532              $C$DW$284       .dwtag  DW_TAG_member
    3533                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$19)
    3534                      .dwattr $C$DW$284, DW_AT_name("IPC10")
    3535                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_IPC10")
    3536                      .dwattr $C$DW$284, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3537                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3538                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3539              $C$DW$285       .dwtag  DW_TAG_member
    3540                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    3541                      .dwattr $C$DW$285, DW_AT_name("IPC11")
    3542                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_IPC11")
    3543                      .dwattr $C$DW$285, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3544                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3545                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3546              $C$DW$286       .dwtag  DW_TAG_member
    3547                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3548                      .dwattr $C$DW$286, DW_AT_name("IPC12")
    3549                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_IPC12")
    3550                      .dwattr $C$DW$286, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3551                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3552                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3553              $C$DW$287       .dwtag  DW_TAG_member
    3554                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    3555                      .dwattr $C$DW$287, DW_AT_name("IPC13")
    3556                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_IPC13")
    3557                      .dwattr $C$DW$287, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:26:14 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274010                         PAGE   71

    3558                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3559                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3560              $C$DW$288       .dwtag  DW_TAG_member
    3561                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3562                      .dwattr $C$DW$288, DW_AT_name("IPC14")
    3563                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_IPC14")
    3564                      .dwattr $C$DW$288, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3565                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3566                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3567              $C$DW$289       .dwtag  DW_TAG_member
    3568                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    3569                      .dwattr $C$DW$289, DW_AT_name("IPC15")
    3570                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_IPC15")
    3571                      .dwattr $C$DW$289, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3572                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3573                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3574              $C$DW$290       .dwtag  DW_TAG_member
    3575                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    3576                      .dwattr $C$DW$290, DW_AT_name("IPC16")
    3577                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_IPC16")
    3578                      .dwattr $C$DW$290, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3579                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3580                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3581              $C$DW$291       .dwtag  DW_TAG_member
    3582                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    3583                      .dwattr $C$DW$291, DW_AT_name("IPC17")
    3584                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_IPC17")
    3585                      .dwattr $C$DW$291, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3586                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3587                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3588              $C$DW$292       .dwtag  DW_TAG_member
    3589                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    3590                      .dwattr $C$DW$292, DW_AT_name("IPC18")
    3591                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_IPC18")
    3592                      .dwattr $C$DW$292, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3593                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3594                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3595              $C$DW$293       .dwtag  DW_TAG_member
    3596                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    3597                      .dwattr $C$DW$293, DW_AT_name("IPC19")
    3598                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_IPC19")
    3599                      .dwattr $C$DW$293, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3600                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
