TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:24:56 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

     346              ;***************************************************************
     347              
     348 00000058       _Parallel_GPIOSelect:
     349                      .dwcfi  cfa_offset, -2
     350                      .dwcfi  save_reg_to_mem, 26, 0
     351                      .dwcfi  save_reg_to_reg, 78, 26
     352                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     353 00000058 7622   EALLOW
     354                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     355 00000059 0200          MOVB      ACC,#0                ; [CPU_] |161| 
     356 0000005a 761F!         MOVW      DP,#_GpioCtrlRegs+72  ; [CPU_U] 
         0000005b 0001 
     357 0000005c 1E08!         MOVL      @_GpioCtrlRegs+72,ACC ; [CPU_] |161| 
     358                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     359 0000005d 1E22!         MOVL      @_GpioCtrlRegs+98,ACC ; [CPU_] |161| 
     360                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     361 0000005e 761F!         MOVW      DP,#_GpioCtrlRegs+134 ; [CPU_U] 
         0000005f 0002 
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE    8

     362 00000060 1E06!         MOVL      @_GpioCtrlRegs+134,ACC ; [CPU_] |162| 
     363                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     364 00000061 1E20!         MOVL      @_GpioCtrlRegs+160,ACC ; [CPU_] |162| 
     365                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     366 00000062 1806!         AND       @_GpioCtrlRegs+134,#0xf3ff ; [CPU_] |165| 
         00000063 F3FF 
     367                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     368 00000064 1820!         AND       @_GpioCtrlRegs+160,#0xf3ff ; [CPU_] |165| 
         00000065 F3FF 
     369                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     370 00000066 1806!         AND       @_GpioCtrlRegs+134,#0xcfff ; [CPU_] |166| 
         00000067 CFFF 
     371                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     372 00000068 1820!         AND       @_GpioCtrlRegs+160,#0xcfff ; [CPU_] |166| 
         00000069 CFFF 
     373                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     374 0000006a 1A0A!         OR        @_GpioCtrlRegs+138,#0x0020 ; [CPU_] |176| 
         0000006b 0020 
     375                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     376 0000006c 180A!         AND       @_GpioCtrlRegs+138,#0xffbf ; [CPU_] |177| 
         0000006d FFBF 
     377                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     378 0000006e 761A   EDIS
     379                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     380 0000006f FF69          SPM       #0                    ; [CPU_] 
     381              $C$DW$28        .dwtag  DW_TAG_TI_branch
     382                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     383                      .dwattr $C$DW$28, DW_AT_TI_return
     384 00000070 0006          LRETR     ; [CPU_] 
     385                      ; return occurs ; [] 
     386                      .dwattr $C$DW$27, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     387                      .dwattr $C$DW$27, DW_AT_TI_end_line(0xb5)
     388                      .dwattr $C$DW$27, DW_AT_TI_end_column(0x01)
     389                      .dwendentry
     390                      .dwendtag $C$DW$27
     391              
     392              ;**************************************************************
     393              ;* UNDEFINED EXTERNAL REFERENCES                              *
     394              ;**************************************************************
     395                      .global _CopyData
     396                      .global _ReadReservedFn
     397                      .global _GetLongData
     398                      .global _GetWordData
     399                      .global _GpioDataRegs
     400                      .global _GpioCtrlRegs
     401              
     402              ;***************************************************************
     403              ;* TYPE INFORMATION                                            *
     404              ;***************************************************************
     405              
     406              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     407                      .dwattr $C$DW$T$20, DW_AT_name("GPAAMSEL_BITS")
     408                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     409              $C$DW$29        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE    9

     411                      .dwattr $C$DW$29, DW_AT_name("GPIO0")
     412                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO0")
     413                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     414                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     415                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     416              $C$DW$30        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     418                      .dwattr $C$DW$30, DW_AT_name("GPIO1")
     419                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO1")
     420                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     421                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     422                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     423              $C$DW$31        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     425                      .dwattr $C$DW$31, DW_AT_name("GPIO2")
     426                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIO2")
     427                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     428                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     430              $C$DW$32        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     432                      .dwattr $C$DW$32, DW_AT_name("GPIO3")
     433                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIO3")
     434                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     435                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     436                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     437              $C$DW$33        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     439                      .dwattr $C$DW$33, DW_AT_name("GPIO4")
     440                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO4")
     441                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     442                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     443                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     444              $C$DW$34        .dwtag  DW_TAG_member
     445                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     446                      .dwattr $C$DW$34, DW_AT_name("GPIO5")
     447                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO5")
     448                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     449                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     451              $C$DW$35        .dwtag  DW_TAG_member
     452                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     453                      .dwattr $C$DW$35, DW_AT_name("GPIO6")
     454                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO6")
     455                      .dwattr $C$DW$35, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     456                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     457                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     458              $C$DW$36        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$36, DW_AT_name("GPIO7")
     461                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO7")
     462                      .dwattr $C$DW$36, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     463                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     464                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     465              $C$DW$37        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   10

     466                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     467                      .dwattr $C$DW$37, DW_AT_name("GPIO8")
     468                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO8")
     469                      .dwattr $C$DW$37, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     470                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     471                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     472              $C$DW$38        .dwtag  DW_TAG_member
     473                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     474                      .dwattr $C$DW$38, DW_AT_name("GPIO9")
     475                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO9")
     476                      .dwattr $C$DW$38, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     477                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     478                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     479              $C$DW$39        .dwtag  DW_TAG_member
     480                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     481                      .dwattr $C$DW$39, DW_AT_name("GPIO10")
     482                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO10")
     483                      .dwattr $C$DW$39, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     484                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     485                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     486              $C$DW$40        .dwtag  DW_TAG_member
     487                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     488                      .dwattr $C$DW$40, DW_AT_name("GPIO11")
     489                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO11")
     490                      .dwattr $C$DW$40, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     491                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     492                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     493              $C$DW$41        .dwtag  DW_TAG_member
     494                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     495                      .dwattr $C$DW$41, DW_AT_name("GPIO12")
     496                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO12")
     497                      .dwattr $C$DW$41, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     498                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     499                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     500              $C$DW$42        .dwtag  DW_TAG_member
     501                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     502                      .dwattr $C$DW$42, DW_AT_name("GPIO13")
     503                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO13")
     504                      .dwattr $C$DW$42, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     505                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     506                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     507              $C$DW$43        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     509                      .dwattr $C$DW$43, DW_AT_name("GPIO14")
     510                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO14")
     511                      .dwattr $C$DW$43, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     512                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     513                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     514              $C$DW$44        .dwtag  DW_TAG_member
     515                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     516                      .dwattr $C$DW$44, DW_AT_name("GPIO15")
     517                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO15")
     518                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     519                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     520                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   11

     521              $C$DW$45        .dwtag  DW_TAG_member
     522                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     523                      .dwattr $C$DW$45, DW_AT_name("GPIO16")
     524                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO16")
     525                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     526                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     527                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     528              $C$DW$46        .dwtag  DW_TAG_member
     529                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     530                      .dwattr $C$DW$46, DW_AT_name("GPIO17")
     531                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO17")
     532                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     533                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     534                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     535              $C$DW$47        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     537                      .dwattr $C$DW$47, DW_AT_name("GPIO18")
     538                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO18")
     539                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     540                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     541                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     542              $C$DW$48        .dwtag  DW_TAG_member
     543                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     544                      .dwattr $C$DW$48, DW_AT_name("GPIO19")
     545                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO19")
     546                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     547                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     548                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     549              $C$DW$49        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     551                      .dwattr $C$DW$49, DW_AT_name("GPIO20")
     552                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO20")
     553                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     554                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     555                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     556              $C$DW$50        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$50, DW_AT_name("GPIO21")
     559                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO21")
     560                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     561                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     562                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     563              $C$DW$51        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     565                      .dwattr $C$DW$51, DW_AT_name("GPIO22")
     566                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO22")
     567                      .dwattr $C$DW$51, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     568                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     569                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     570              $C$DW$52        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$52, DW_AT_name("GPIO23")
     573                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO23")
     574                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     575                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   12

     576                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     577              $C$DW$53        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$53, DW_AT_name("GPIO24")
     580                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO24")
     581                      .dwattr $C$DW$53, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     582                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     583                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     584              $C$DW$54        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     586                      .dwattr $C$DW$54, DW_AT_name("GPIO25")
     587                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO25")
     588                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     589                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     590                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     591              $C$DW$55        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$55, DW_AT_name("GPIO26")
     594                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO26")
     595                      .dwattr $C$DW$55, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     596                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     597                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     598              $C$DW$56        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$56, DW_AT_name("GPIO27")
     601                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO27")
     602                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     603                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     604                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     605              $C$DW$57        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$57, DW_AT_name("GPIO28")
     608                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO28")
     609                      .dwattr $C$DW$57, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     611                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     612              $C$DW$58        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$58, DW_AT_name("GPIO29")
     615                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO29")
     616                      .dwattr $C$DW$58, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     617                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     618                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     619              $C$DW$59        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$59, DW_AT_name("GPIO30")
     622                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO30")
     623                      .dwattr $C$DW$59, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     624                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     625                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     626              $C$DW$60        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$60, DW_AT_name("GPIO31")
     629                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO31")
     630                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   13

     631                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     632                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     633                      .dwendtag $C$DW$T$20
     634              
     635              
     636              $C$DW$T$22      .dwtag  DW_TAG_union_type
     637                      .dwattr $C$DW$T$22, DW_AT_name("GPAAMSEL_REG")
     638                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     639              $C$DW$61        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     641                      .dwattr $C$DW$61, DW_AT_name("all")
     642                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
     643                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     645              $C$DW$62        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
     647                      .dwattr $C$DW$62, DW_AT_name("bit")
     648                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
     649                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     651                      .dwendtag $C$DW$T$22
     652              
     653              
     654              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     655                      .dwattr $C$DW$T$23, DW_AT_name("GPACLEAR_BITS")
     656                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     657              $C$DW$63        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     659                      .dwattr $C$DW$63, DW_AT_name("GPIO0")
     660                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO0")
     661                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     662                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     663                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     664              $C$DW$64        .dwtag  DW_TAG_member
     665                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     666                      .dwattr $C$DW$64, DW_AT_name("GPIO1")
     667                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO1")
     668                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     669                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     670                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     671              $C$DW$65        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$65, DW_AT_name("GPIO2")
     674                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO2")
     675                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     676                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     678              $C$DW$66        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     680                      .dwattr $C$DW$66, DW_AT_name("GPIO3")
     681                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO3")
     682                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     683                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$67        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   14

     686                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$67, DW_AT_name("GPIO4")
     688                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO4")
     689                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     690                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$68        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$68, DW_AT_name("GPIO5")
     695                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO5")
     696                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     697                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     699              $C$DW$69        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$69, DW_AT_name("GPIO6")
     702                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO6")
     703                      .dwattr $C$DW$69, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     704                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     706              $C$DW$70        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     708                      .dwattr $C$DW$70, DW_AT_name("GPIO7")
     709                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO7")
     710                      .dwattr $C$DW$70, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     711                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     713              $C$DW$71        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     715                      .dwattr $C$DW$71, DW_AT_name("GPIO8")
     716                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO8")
     717                      .dwattr $C$DW$71, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     718                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     720              $C$DW$72        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$72, DW_AT_name("GPIO9")
     723                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO9")
     724                      .dwattr $C$DW$72, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     725                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     726                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     727              $C$DW$73        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$73, DW_AT_name("GPIO10")
     730                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO10")
     731                      .dwattr $C$DW$73, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     732                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$74        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$74, DW_AT_name("GPIO11")
     737                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO11")
     738                      .dwattr $C$DW$74, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     739                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   15

     741              $C$DW$75        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     743                      .dwattr $C$DW$75, DW_AT_name("GPIO12")
     744                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO12")
     745                      .dwattr $C$DW$75, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     746                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     748              $C$DW$76        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$76, DW_AT_name("GPIO13")
     751                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO13")
     752                      .dwattr $C$DW$76, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     753                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     755              $C$DW$77        .dwtag  DW_TAG_member
     756                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     757                      .dwattr $C$DW$77, DW_AT_name("GPIO14")
     758                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO14")
     759                      .dwattr $C$DW$77, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     760                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     761                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     762              $C$DW$78        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     764                      .dwattr $C$DW$78, DW_AT_name("GPIO15")
     765                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO15")
     766                      .dwattr $C$DW$78, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     767                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     768                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     769              $C$DW$79        .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     771                      .dwattr $C$DW$79, DW_AT_name("GPIO16")
     772                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO16")
     773                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     774                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     775                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     776              $C$DW$80        .dwtag  DW_TAG_member
     777                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     778                      .dwattr $C$DW$80, DW_AT_name("GPIO17")
     779                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO17")
     780                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     781                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     782                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     783              $C$DW$81        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$81, DW_AT_name("GPIO18")
     786                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO18")
     787                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     788                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     789                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     790              $C$DW$82        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$82, DW_AT_name("GPIO19")
     793                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO19")
     794                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     795                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   16

     796                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     797              $C$DW$83        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     799                      .dwattr $C$DW$83, DW_AT_name("GPIO20")
     800                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO20")
     801                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     802                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     803                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     804              $C$DW$84        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$84, DW_AT_name("GPIO21")
     807                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO21")
     808                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     809                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     810                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$85        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$85, DW_AT_name("GPIO22")
     814                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO22")
     815                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     816                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     817                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$86        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$86, DW_AT_name("GPIO23")
     821                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO23")
     822                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     823                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     824                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     825              $C$DW$87        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$87, DW_AT_name("GPIO24")
     828                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO24")
     829                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     830                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     831                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     832              $C$DW$88        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$88, DW_AT_name("GPIO25")
     835                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO25")
     836                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     838                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     839              $C$DW$89        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$89, DW_AT_name("GPIO26")
     842                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO26")
     843                      .dwattr $C$DW$89, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     844                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     845                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$90        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$90, DW_AT_name("GPIO27")
     849                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO27")
     850                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   17

     851                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     852                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$91        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$91, DW_AT_name("GPIO28")
     856                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO28")
     857                      .dwattr $C$DW$91, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     858                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     859                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     860              $C$DW$92        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$92, DW_AT_name("GPIO29")
     863                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO29")
     864                      .dwattr $C$DW$92, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     865                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     866                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     867              $C$DW$93        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$93, DW_AT_name("GPIO30")
     870                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO30")
     871                      .dwattr $C$DW$93, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     872                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     873                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     874              $C$DW$94        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$94, DW_AT_name("GPIO31")
     877                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO31")
     878                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     879                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     880                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     881                      .dwendtag $C$DW$T$23
     882              
     883              
     884              $C$DW$T$24      .dwtag  DW_TAG_union_type
     885                      .dwattr $C$DW$T$24, DW_AT_name("GPACLEAR_REG")
     886                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     887              $C$DW$95        .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
     889                      .dwattr $C$DW$95, DW_AT_name("all")
     890                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
     891                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     893              $C$DW$96        .dwtag  DW_TAG_member
     894                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$23)
     895                      .dwattr $C$DW$96, DW_AT_name("bit")
     896                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
     897                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     899                      .dwendtag $C$DW$T$24
     900              
     901              
     902              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     903                      .dwattr $C$DW$T$25, DW_AT_name("GPACR_BITS")
     904                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     905              $C$DW$97        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   18

     906                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$97, DW_AT_name("GPIO0")
     908                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO0")
     909                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     910                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     911                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$98        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$98, DW_AT_name("GPIO1")
     915                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO1")
     916                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     917                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     918                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$99        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$99, DW_AT_name("GPIO2")
     922                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO2")
     923                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     924                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     925                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     926              $C$DW$100       .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$100, DW_AT_name("GPIO3")
     929                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO3")
     930                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     931                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     933              $C$DW$101       .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     935                      .dwattr $C$DW$101, DW_AT_name("GPIO4")
     936                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO4")
     937                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     938                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     940              $C$DW$102       .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     942                      .dwattr $C$DW$102, DW_AT_name("GPIO5")
     943                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO5")
     944                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     945                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     947              $C$DW$103       .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     949                      .dwattr $C$DW$103, DW_AT_name("GPIO6")
     950                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO6")
     951                      .dwattr $C$DW$103, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     952                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     954              $C$DW$104       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$104, DW_AT_name("GPIO7")
     957                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO7")
     958                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     959                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   19

     961              $C$DW$105       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     963                      .dwattr $C$DW$105, DW_AT_name("GPIO8")
     964                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO8")
     965                      .dwattr $C$DW$105, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     966                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$106       .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$106, DW_AT_name("GPIO9")
     971                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO9")
     972                      .dwattr $C$DW$106, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     973                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$107       .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$107, DW_AT_name("GPIO10")
     978                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO10")
     979                      .dwattr $C$DW$107, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     980                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$108       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$108, DW_AT_name("GPIO11")
     985                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO11")
     986                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$109       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$109, DW_AT_name("GPIO12")
     992                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO12")
     993                      .dwattr $C$DW$109, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     994                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$110       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$110, DW_AT_name("GPIO13")
     999                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO13")
    1000                      .dwattr $C$DW$110, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$111       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$111, DW_AT_name("GPIO14")
    1006                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO14")
    1007                      .dwattr $C$DW$111, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1008                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$112       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$112, DW_AT_name("GPIO15")
    1013                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO15")
    1014                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1015                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   20

    1016                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$113       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$113, DW_AT_name("GPIO16")
    1020                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO16")
    1021                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1022                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1023                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$114       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$114, DW_AT_name("GPIO17")
    1027                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO17")
    1028                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1029                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1030                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1031              $C$DW$115       .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$115, DW_AT_name("GPIO18")
    1034                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO18")
    1035                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1036                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1037                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$116       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$116, DW_AT_name("GPIO19")
    1041                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO19")
    1042                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1043                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1044                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$117       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$117, DW_AT_name("GPIO20")
    1048                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO20")
    1049                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1050                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1051                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1052              $C$DW$118       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$118, DW_AT_name("GPIO21")
    1055                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO21")
    1056                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1057                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1058                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$119       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$119, DW_AT_name("GPIO22")
    1062                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO22")
    1063                      .dwattr $C$DW$119, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1064                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1065                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1066              $C$DW$120       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$120, DW_AT_name("GPIO23")
    1069                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO23")
    1070                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   21

    1071                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1072                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1073              $C$DW$121       .dwtag  DW_TAG_member
    1074                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1075                      .dwattr $C$DW$121, DW_AT_name("GPIO24")
    1076                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO24")
    1077                      .dwattr $C$DW$121, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1078                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1079                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1080              $C$DW$122       .dwtag  DW_TAG_member
    1081                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1082                      .dwattr $C$DW$122, DW_AT_name("GPIO25")
    1083                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO25")
    1084                      .dwattr $C$DW$122, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1085                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1086                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1087              $C$DW$123       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1089                      .dwattr $C$DW$123, DW_AT_name("GPIO26")
    1090                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO26")
    1091                      .dwattr $C$DW$123, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1092                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1093                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1094              $C$DW$124       .dwtag  DW_TAG_member
    1095                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1096                      .dwattr $C$DW$124, DW_AT_name("GPIO27")
    1097                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO27")
    1098                      .dwattr $C$DW$124, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1099                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1100                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1101              $C$DW$125       .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1103                      .dwattr $C$DW$125, DW_AT_name("GPIO28")
    1104                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO28")
    1105                      .dwattr $C$DW$125, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1106                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1107                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1108              $C$DW$126       .dwtag  DW_TAG_member
    1109                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1110                      .dwattr $C$DW$126, DW_AT_name("GPIO29")
    1111                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO29")
    1112                      .dwattr $C$DW$126, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1113                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1114                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1115              $C$DW$127       .dwtag  DW_TAG_member
    1116                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1117                      .dwattr $C$DW$127, DW_AT_name("GPIO30")
    1118                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO30")
    1119                      .dwattr $C$DW$127, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1120                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1121                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1122              $C$DW$128       .dwtag  DW_TAG_member
    1123                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1124                      .dwattr $C$DW$128, DW_AT_name("GPIO31")
    1125                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO31")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   22

    1126                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1127                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1128                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1129                      .dwendtag $C$DW$T$25
    1130              
    1131              
    1132              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1133                      .dwattr $C$DW$T$26, DW_AT_name("GPACR_REG")
    1134                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1135              $C$DW$129       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    1137                      .dwattr $C$DW$129, DW_AT_name("all")
    1138                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1139                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1140                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$130       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$25)
    1143                      .dwattr $C$DW$130, DW_AT_name("bit")
    1144                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1145                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1147                      .dwendtag $C$DW$T$26
    1148              
    1149              
    1150              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1151                      .dwattr $C$DW$T$27, DW_AT_name("GPACSEL1_BITS")
    1152                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1153              $C$DW$131       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1155                      .dwattr $C$DW$131, DW_AT_name("GPIO0")
    1156                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO0")
    1157                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1158                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1159                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1160              $C$DW$132       .dwtag  DW_TAG_member
    1161                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1162                      .dwattr $C$DW$132, DW_AT_name("GPIO1")
    1163                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO1")
    1164                      .dwattr $C$DW$132, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1165                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1166                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1167              $C$DW$133       .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1169                      .dwattr $C$DW$133, DW_AT_name("GPIO2")
    1170                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO2")
    1171                      .dwattr $C$DW$133, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1172                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1174              $C$DW$134       .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1176                      .dwattr $C$DW$134, DW_AT_name("GPIO3")
    1177                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO3")
    1178                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1179                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   23

    1181              $C$DW$135       .dwtag  DW_TAG_member
    1182                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1183                      .dwattr $C$DW$135, DW_AT_name("GPIO4")
    1184                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO4")
    1185                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1186                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1187                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1188              $C$DW$136       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1190                      .dwattr $C$DW$136, DW_AT_name("GPIO5")
    1191                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO5")
    1192                      .dwattr $C$DW$136, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1193                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1194                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$137       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$137, DW_AT_name("GPIO6")
    1198                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO6")
    1199                      .dwattr $C$DW$137, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1200                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1201                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1202              $C$DW$138       .dwtag  DW_TAG_member
    1203                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1204                      .dwattr $C$DW$138, DW_AT_name("GPIO7")
    1205                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO7")
    1206                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1207                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1208                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1209                      .dwendtag $C$DW$T$27
    1210              
    1211              
    1212              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1213                      .dwattr $C$DW$T$28, DW_AT_name("GPACSEL1_REG")
    1214                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1215              $C$DW$139       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    1217                      .dwattr $C$DW$139, DW_AT_name("all")
    1218                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    1219                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$140       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    1223                      .dwattr $C$DW$140, DW_AT_name("bit")
    1224                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    1225                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1226                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1227                      .dwendtag $C$DW$T$28
    1228              
    1229              
    1230              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1231                      .dwattr $C$DW$T$29, DW_AT_name("GPACSEL2_BITS")
    1232                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1233              $C$DW$141       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$141, DW_AT_name("GPIO8")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   24

    1236                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO8")
    1237                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1238                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$142       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$142, DW_AT_name("GPIO9")
    1243                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO9")
    1244                      .dwattr $C$DW$142, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1245                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$143       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$143, DW_AT_name("GPIO10")
    1250                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO10")
    1251                      .dwattr $C$DW$143, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1252                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1254              $C$DW$144       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$144, DW_AT_name("GPIO11")
    1257                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO11")
    1258                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1259                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$145       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$145, DW_AT_name("GPIO12")
    1264                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO12")
    1265                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1266                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$146       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$146, DW_AT_name("GPIO13")
    1271                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO13")
    1272                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1273                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1274                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1275              $C$DW$147       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$147, DW_AT_name("GPIO14")
    1278                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO14")
    1279                      .dwattr $C$DW$147, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1280                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1281                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$148       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$148, DW_AT_name("GPIO15")
    1285                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO15")
    1286                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1287                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1288                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1289                      .dwendtag $C$DW$T$29
    1290              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   25

    1291              
    1292              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1293                      .dwattr $C$DW$T$30, DW_AT_name("GPACSEL2_REG")
    1294                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1295              $C$DW$149       .dwtag  DW_TAG_member
    1296                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1297                      .dwattr $C$DW$149, DW_AT_name("all")
    1298                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    1299                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$150       .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$29)
    1303                      .dwattr $C$DW$150, DW_AT_name("bit")
    1304                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    1305                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1307                      .dwendtag $C$DW$T$30
    1308              
    1309              
    1310              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1311                      .dwattr $C$DW$T$31, DW_AT_name("GPACSEL3_BITS")
    1312                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1313              $C$DW$151       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$151, DW_AT_name("GPIO16")
    1316                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO16")
    1317                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1318                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1319                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$152       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$152, DW_AT_name("GPIO17")
    1323                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO17")
    1324                      .dwattr $C$DW$152, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1325                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1326                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$153       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$153, DW_AT_name("GPIO18")
    1330                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO18")
    1331                      .dwattr $C$DW$153, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1332                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$154       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$154, DW_AT_name("GPIO19")
    1337                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO19")
    1338                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1339                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1340                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$155       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$155, DW_AT_name("GPIO20")
    1344                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO20")
    1345                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   26

    1346                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1347                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$156       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$156, DW_AT_name("GPIO21")
    1351                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO21")
    1352                      .dwattr $C$DW$156, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1353                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1354                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$157       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$157, DW_AT_name("GPIO22")
    1358                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO22")
    1359                      .dwattr $C$DW$157, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1360                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1361                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$158       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$158, DW_AT_name("GPIO23")
    1365                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO23")
    1366                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1367                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1368                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1369                      .dwendtag $C$DW$T$31
    1370              
    1371              
    1372              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1373                      .dwattr $C$DW$T$32, DW_AT_name("GPACSEL3_REG")
    1374                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1375              $C$DW$159       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    1377                      .dwattr $C$DW$159, DW_AT_name("all")
    1378                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    1379                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$160       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$31)
    1383                      .dwattr $C$DW$160, DW_AT_name("bit")
    1384                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    1385                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1387                      .dwendtag $C$DW$T$32
    1388              
    1389              
    1390              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1391                      .dwattr $C$DW$T$33, DW_AT_name("GPACSEL4_BITS")
    1392                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1393              $C$DW$161       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$161, DW_AT_name("GPIO24")
    1396                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO24")
    1397                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1398                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$162       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   27

    1401                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1402                      .dwattr $C$DW$162, DW_AT_name("GPIO25")
    1403                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO25")
    1404                      .dwattr $C$DW$162, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1405                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$163       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$163, DW_AT_name("GPIO26")
    1410                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO26")
    1411                      .dwattr $C$DW$163, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1412                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$164       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$164, DW_AT_name("GPIO27")
    1417                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO27")
    1418                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1419                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1421              $C$DW$165       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$165, DW_AT_name("GPIO28")
    1424                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO28")
    1425                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1426                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1427                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1428              $C$DW$166       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1430                      .dwattr $C$DW$166, DW_AT_name("GPIO29")
    1431                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO29")
    1432                      .dwattr $C$DW$166, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1433                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1434                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$167       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$167, DW_AT_name("GPIO30")
    1438                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO30")
    1439                      .dwattr $C$DW$167, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1440                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1441                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$168       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$168, DW_AT_name("GPIO31")
    1445                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO31")
    1446                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1447                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1448                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1449                      .dwendtag $C$DW$T$33
    1450              
    1451              
    1452              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1453                      .dwattr $C$DW$T$34, DW_AT_name("GPACSEL4_REG")
    1454                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1455              $C$DW$169       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   28

    1456                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    1457                      .dwattr $C$DW$169, DW_AT_name("all")
    1458                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_all")
    1459                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$170       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$33)
    1463                      .dwattr $C$DW$170, DW_AT_name("bit")
    1464                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_bit")
    1465                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1466                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1467                      .dwendtag $C$DW$T$34
    1468              
    1469              
    1470              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1471                      .dwattr $C$DW$T$35, DW_AT_name("GPACTRL_BITS")
    1472                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1473              $C$DW$171       .dwtag  DW_TAG_member
    1474                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1475                      .dwattr $C$DW$171, DW_AT_name("QUALPRD0")
    1476                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_QUALPRD0")
    1477                      .dwattr $C$DW$171, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1478                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1479                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1480              $C$DW$172       .dwtag  DW_TAG_member
    1481                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1482                      .dwattr $C$DW$172, DW_AT_name("QUALPRD1")
    1483                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_QUALPRD1")
    1484                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1485                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1486                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1487              $C$DW$173       .dwtag  DW_TAG_member
    1488                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1489                      .dwattr $C$DW$173, DW_AT_name("QUALPRD2")
    1490                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_QUALPRD2")
    1491                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1492                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1493                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1494              $C$DW$174       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1496                      .dwattr $C$DW$174, DW_AT_name("QUALPRD3")
    1497                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_QUALPRD3")
    1498                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1499                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1500                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1501                      .dwendtag $C$DW$T$35
    1502              
    1503              
    1504              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1505                      .dwattr $C$DW$T$36, DW_AT_name("GPACTRL_REG")
    1506                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1507              $C$DW$175       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    1509                      .dwattr $C$DW$175, DW_AT_name("all")
    1510                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:24:56 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0764410                         PAGE   29

    1511                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1512                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1513              $C$DW$176       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$35)
    1515                      .dwattr $C$DW$176, DW_AT_name("bit")
    1516                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    1517                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1519                      .dwendtag $C$DW$T$36
    1520              
    1521              
    1522              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1523                      .dwattr $C$DW$T$37, DW_AT_name("GPADAT_BITS")
    1524                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1525              $C$DW$177       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$177, DW_AT_name("GPIO0")
    1528                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO0")
    1529                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1530                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1531                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1532              $C$DW$178       .dwtag  DW_TAG_member
    1533                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1534                      .dwattr $C$DW$178, DW_AT_name("GPIO1")
    1535                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO1")
    1536                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1537                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1538                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1539              $C$DW$179       .dwtag  DW_TAG_member
    1540                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1541                      .dwattr $C$DW$179, DW_AT_name("GPIO2")
    1542                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO2")
    1543                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1544                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1546              $C$DW$180       .dwtag  DW_TAG_member
    1547                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1548                      .dwattr $C$DW$180, DW_AT_name("GPIO3")
    1549                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO3")
    1550                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1551                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1552                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1553              $C$DW$181       .dwtag  DW_TAG_member
    1554                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1555                      .dwattr $C$DW$181, DW_AT_name("GPIO4")
    1556                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO4")
