TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:25:22 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("EmuBMode")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EmuBMode")

     291 00000052 7640!         LCR       #_c1brom_decode_bootpins ; [CPU_] |109| 
         00000053 0000 
     292                      ; call occurs [#_c1brom_decode_bootpins] ; [] |109| 
     293 00000054 9641          MOV       *-SP[1],AL            ; [CPU_] |109| 
     294                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     295              $C$DW$24        .dwtag  DW_TAG_TI_branch
     296                      .dwattr $C$DW$24, DW_AT_low_pc(0x00)
     297                      .dwattr $C$DW$24, DW_AT_name("_OverlaySciBootWithUsbBoot")
     298                      .dwattr $C$DW$24, DW_AT_TI_call
     299 00000055 7640'         LCR       #_OverlaySciBootWithUsbBoot ; [CPU_] |110| 
         00000056 0000 
     300                      ; call occurs [#_OverlaySciBootWithUsbBoot] ; [] |110| 
     301 00000057 9641          MOV       *-SP[1],AL            ; [CPU_] |110| 
     302                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     303 00000058 761F!         MOVW      DP,#_EmuKey           ; [CPU_U] 
         00000059 0000 
     304 0000005a 5603          MOV       ACC,*-SP[1] << #8     ; [CPU_] |111| 
         0000005b 0841 
     305 0000005c 505A          ORB       AL,#0x5a              ; [CPU_] |111| 
     306 0000005d 9600!         MOV       @_EmuKey,AL           ; [CPU_] |111| 
     307 0000005e       $C$L7:    
     308                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     309 0000005e 761A   EDIS
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE    7

     310                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     311 0000005f 9241          MOV       AL,*-SP[1]            ; [CPU_] |117| 
     312 00000060 5203          CMPB      AL,#3                 ; [CPU_] |117| 
     313 00000061 ED05          BF        $C$L8,NEQ             ; [CPU_] |117| 
     314                      ; branchcc occurs ; [] |117| 
     315                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     316 00000062 FF69          SPM       #0                    ; [CPU_] 
     317              $C$DW$25        .dwtag  DW_TAG_TI_branch
     318                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     319                      .dwattr $C$DW$25, DW_AT_name("_c1brom_read_otp_bootmode")
     320                      .dwattr $C$DW$25, DW_AT_TI_call
     321 00000063 7640!         LCR       #_c1brom_read_otp_bootmode ; [CPU_] |119| 
         00000064 0000 
     322                      ; call occurs [#_c1brom_read_otp_bootmode] ; [] |119| 
     323 00000065 9641          MOV       *-SP[1],AL            ; [CPU_] |119| 
     324 00000066       $C$L8:    
     325                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     326                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     327 00000066 FE82          SUBB      SP,#2                 ; [CPU_U] 
     328                      .dwcfi  cfa_offset, -2
     329 00000067 FF69          SPM       #0                    ; [CPU_] 
     330              $C$DW$26        .dwtag  DW_TAG_TI_branch
     331                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     332                      .dwattr $C$DW$26, DW_AT_TI_return
     333 00000068 0006          LRETR     ; [CPU_] 
     334                      ; return occurs ; [] 
     335                      .dwattr $C$DW$15, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     336                      .dwattr $C$DW$15, DW_AT_TI_end_line(0x7c)
     337                      .dwattr $C$DW$15, DW_AT_TI_end_column(0x01)
     338                      .dwendentry
     339                      .dwendtag $C$DW$15
     340              
     341              ;**************************************************************
     342              ;* UNDEFINED EXTERNAL REFERENCES                              *
     343              ;**************************************************************
     344                      .global _EmuBMode
     345                      .global _c1brom_read_otp_bootmode
     346                      .global _c1brom_read_otp_bootpinconfig
     347                      .global _EmuKey
     348                      .global _c1brom_decode_bootpins
     349                      .global _CpuSysRegs
     350                      .global _DevCfgRegs
     351              
     352              ;***************************************************************
     353              ;* TYPE INFORMATION                                            *
     354              ;***************************************************************
     355              
     356              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     357                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
     358                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     359              $C$DW$27        .dwtag  DW_TAG_member
     360                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     361                      .dwattr $C$DW$27, DW_AT_name("VMAPS")
     362                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_VMAPS")
     363                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE    8

     364                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     365                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     366              $C$DW$28        .dwtag  DW_TAG_member
     367                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     368                      .dwattr $C$DW$28, DW_AT_name("MONPRIV")
     369                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_MONPRIV")
     370                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     371                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     372                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     373              $C$DW$29        .dwtag  DW_TAG_member
     374                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     375                      .dwattr $C$DW$29, DW_AT_name("ENPROT")
     376                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_ENPROT")
     377                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     378                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     379                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     380              $C$DW$30        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     382                      .dwattr $C$DW$30, DW_AT_name("rsvd1")
     383                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd1")
     384                      .dwattr $C$DW$30, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     385                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     386                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     387              $C$DW$31        .dwtag  DW_TAG_member
     388                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     389                      .dwattr $C$DW$31, DW_AT_name("rsvd2")
     390                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_rsvd2")
     391                      .dwattr $C$DW$31, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     392                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     393                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     394                      .dwendtag $C$DW$T$20
     395              
     396              
     397              $C$DW$T$22      .dwtag  DW_TAG_union_type
     398                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
     399                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     400              $C$DW$32        .dwtag  DW_TAG_member
     401                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$21)
     402                      .dwattr $C$DW$32, DW_AT_name("all")
     403                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_all")
     404                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     405                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     406              $C$DW$33        .dwtag  DW_TAG_member
     407                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     408                      .dwattr $C$DW$33, DW_AT_name("bit")
     409                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bit")
     410                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     411                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     412                      .dwendtag $C$DW$T$22
     413              
     414              
     415              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     416                      .dwattr $C$DW$T$23, DW_AT_name("CPU2RESCTL_BITS")
     417                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     418              $C$DW$34        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE    9

     419                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     420                      .dwattr $C$DW$34, DW_AT_name("RESET")
     421                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_RESET")
     422                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     423                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     425              $C$DW$35        .dwtag  DW_TAG_member
     426                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     427                      .dwattr $C$DW$35, DW_AT_name("rsvd1")
     428                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd1")
     429                      .dwattr $C$DW$35, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     430                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     431                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     432              $C$DW$36        .dwtag  DW_TAG_member
     433                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     434                      .dwattr $C$DW$36, DW_AT_name("KEY")
     435                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_KEY")
     436                      .dwattr $C$DW$36, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     437                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     438                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     439                      .dwendtag $C$DW$T$23
     440              
     441              
     442              $C$DW$T$24      .dwtag  DW_TAG_union_type
     443                      .dwattr $C$DW$T$24, DW_AT_name("CPU2RESCTL_REG")
     444                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     445              $C$DW$37        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$21)
     447                      .dwattr $C$DW$37, DW_AT_name("all")
     448                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_all")
     449                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     450                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     451              $C$DW$38        .dwtag  DW_TAG_member
     452                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$23)
     453                      .dwattr $C$DW$38, DW_AT_name("bit")
     454                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_bit")
     455                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     456                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     457                      .dwendtag $C$DW$T$24
     458              
     459              
     460              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     461                      .dwattr $C$DW$T$25, DW_AT_name("CPUSEL0_BITS")
     462                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     463              $C$DW$39        .dwtag  DW_TAG_member
     464                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     465                      .dwattr $C$DW$39, DW_AT_name("EPWM1")
     466                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_EPWM1")
     467                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     468                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     470              $C$DW$40        .dwtag  DW_TAG_member
     471                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     472                      .dwattr $C$DW$40, DW_AT_name("EPWM2")
     473                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_EPWM2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   10

     474                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     475                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     477              $C$DW$41        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     479                      .dwattr $C$DW$41, DW_AT_name("EPWM3")
     480                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_EPWM3")
     481                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     482                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     484              $C$DW$42        .dwtag  DW_TAG_member
     485                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     486                      .dwattr $C$DW$42, DW_AT_name("EPWM4")
     487                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_EPWM4")
     488                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     489                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     490                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     491              $C$DW$43        .dwtag  DW_TAG_member
     492                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     493                      .dwattr $C$DW$43, DW_AT_name("EPWM5")
     494                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_EPWM5")
     495                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     496                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     497                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     498              $C$DW$44        .dwtag  DW_TAG_member
     499                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     500                      .dwattr $C$DW$44, DW_AT_name("EPWM6")
     501                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_EPWM6")
     502                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     503                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     504                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     505              $C$DW$45        .dwtag  DW_TAG_member
     506                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     507                      .dwattr $C$DW$45, DW_AT_name("EPWM7")
     508                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_EPWM7")
     509                      .dwattr $C$DW$45, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     510                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     511                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     512              $C$DW$46        .dwtag  DW_TAG_member
     513                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     514                      .dwattr $C$DW$46, DW_AT_name("EPWM8")
     515                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_EPWM8")
     516                      .dwattr $C$DW$46, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     517                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     519              $C$DW$47        .dwtag  DW_TAG_member
     520                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     521                      .dwattr $C$DW$47, DW_AT_name("EPWM9")
     522                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_EPWM9")
     523                      .dwattr $C$DW$47, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     524                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     525                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     526              $C$DW$48        .dwtag  DW_TAG_member
     527                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     528                      .dwattr $C$DW$48, DW_AT_name("EPWM10")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   11

     529                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_EPWM10")
     530                      .dwattr $C$DW$48, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     531                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     532                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     533              $C$DW$49        .dwtag  DW_TAG_member
     534                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     535                      .dwattr $C$DW$49, DW_AT_name("EPWM11")
     536                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_EPWM11")
     537                      .dwattr $C$DW$49, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     538                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     540              $C$DW$50        .dwtag  DW_TAG_member
     541                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     542                      .dwattr $C$DW$50, DW_AT_name("EPWM12")
     543                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_EPWM12")
     544                      .dwattr $C$DW$50, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     545                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     546                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     547              $C$DW$51        .dwtag  DW_TAG_member
     548                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     549                      .dwattr $C$DW$51, DW_AT_name("rsvd1")
     550                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd1")
     551                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     552                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     553                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     554              $C$DW$52        .dwtag  DW_TAG_member
     555                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     556                      .dwattr $C$DW$52, DW_AT_name("rsvd2")
     557                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd2")
     558                      .dwattr $C$DW$52, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     559                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     560                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     561                      .dwendtag $C$DW$T$25
     562              
     563              
     564              $C$DW$T$26      .dwtag  DW_TAG_union_type
     565                      .dwattr $C$DW$T$26, DW_AT_name("CPUSEL0_REG")
     566                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     567              $C$DW$53        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     569                      .dwattr $C$DW$53, DW_AT_name("all")
     570                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_all")
     571                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     573              $C$DW$54        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$25)
     575                      .dwattr $C$DW$54, DW_AT_name("bit")
     576                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_bit")
     577                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     578                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     579                      .dwendtag $C$DW$T$26
     580              
     581              
     582              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     583                      .dwattr $C$DW$T$27, DW_AT_name("CPUSEL11_BITS")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   12

     584                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     585              $C$DW$55        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     587                      .dwattr $C$DW$55, DW_AT_name("ADC1")
     588                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_ADC1")
     589                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     590                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     591                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     592              $C$DW$56        .dwtag  DW_TAG_member
     593                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     594                      .dwattr $C$DW$56, DW_AT_name("ADC2")
     595                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_ADC2")
     596                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     597                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     598                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     599              $C$DW$57        .dwtag  DW_TAG_member
     600                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     601                      .dwattr $C$DW$57, DW_AT_name("ADC3")
     602                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_ADC3")
     603                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     604                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     605                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     606              $C$DW$58        .dwtag  DW_TAG_member
     607                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     608                      .dwattr $C$DW$58, DW_AT_name("ADC4")
     609                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_ADC4")
     610                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     611                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     613              $C$DW$59        .dwtag  DW_TAG_member
     614                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     615                      .dwattr $C$DW$59, DW_AT_name("rsvd1")
     616                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd1")
     617                      .dwattr $C$DW$59, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     618                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     619                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     620              $C$DW$60        .dwtag  DW_TAG_member
     621                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     622                      .dwattr $C$DW$60, DW_AT_name("rsvd2")
     623                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd2")
     624                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     625                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     626                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     627                      .dwendtag $C$DW$T$27
     628              
     629              
     630              $C$DW$T$28      .dwtag  DW_TAG_union_type
     631                      .dwattr $C$DW$T$28, DW_AT_name("CPUSEL11_REG")
     632                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     633              $C$DW$61        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$21)
     635                      .dwattr $C$DW$61, DW_AT_name("all")
     636                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_all")
     637                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     638                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   13

     639              $C$DW$62        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$27)
     641                      .dwattr $C$DW$62, DW_AT_name("bit")
     642                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bit")
     643                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     644                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     645                      .dwendtag $C$DW$T$28
     646              
     647              
     648              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     649                      .dwattr $C$DW$T$29, DW_AT_name("CPUSEL12_BITS")
     650                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     651              $C$DW$63        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     653                      .dwattr $C$DW$63, DW_AT_name("CMPSS1")
     654                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_CMPSS1")
     655                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     656                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     658              $C$DW$64        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     660                      .dwattr $C$DW$64, DW_AT_name("CMPSS2")
     661                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_CMPSS2")
     662                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     663                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     664                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     665              $C$DW$65        .dwtag  DW_TAG_member
     666                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     667                      .dwattr $C$DW$65, DW_AT_name("CMPSS3")
     668                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_CMPSS3")
     669                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     670                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     671                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     672              $C$DW$66        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     674                      .dwattr $C$DW$66, DW_AT_name("CMPSS4")
     675                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_CMPSS4")
     676                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     677                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     678                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     679              $C$DW$67        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     681                      .dwattr $C$DW$67, DW_AT_name("CMPSS5")
     682                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CMPSS5")
     683                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     684                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     685                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     686              $C$DW$68        .dwtag  DW_TAG_member
     687                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     688                      .dwattr $C$DW$68, DW_AT_name("CMPSS6")
     689                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CMPSS6")
     690                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     691                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     693              $C$DW$69        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   14

     694                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     695                      .dwattr $C$DW$69, DW_AT_name("CMPSS7")
     696                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_CMPSS7")
     697                      .dwattr $C$DW$69, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     698                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     700              $C$DW$70        .dwtag  DW_TAG_member
     701                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     702                      .dwattr $C$DW$70, DW_AT_name("CMPSS8")
     703                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CMPSS8")
     704                      .dwattr $C$DW$70, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     705                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     706                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     707              $C$DW$71        .dwtag  DW_TAG_member
     708                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     709                      .dwattr $C$DW$71, DW_AT_name("rsvd1")
     710                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd1")
     711                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     712                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     713                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     714              $C$DW$72        .dwtag  DW_TAG_member
     715                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     716                      .dwattr $C$DW$72, DW_AT_name("rsvd2")
     717                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd2")
     718                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     719                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     720                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     721                      .dwendtag $C$DW$T$29
     722              
     723              
     724              $C$DW$T$30      .dwtag  DW_TAG_union_type
     725                      .dwattr $C$DW$T$30, DW_AT_name("CPUSEL12_REG")
     726                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     727              $C$DW$73        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     729                      .dwattr $C$DW$73, DW_AT_name("all")
     730                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
     731                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$74        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$29)
     735                      .dwattr $C$DW$74, DW_AT_name("bit")
     736                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
     737                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     738                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     739                      .dwendtag $C$DW$T$30
     740              
     741              
     742              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     743                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL14_BITS")
     744                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     745              $C$DW$75        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
     748                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   15

     749                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     750                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$76        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$76, DW_AT_name("Buffered_DAC12_1")
     755                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Buffered_DAC12_1")
     756                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     757                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     758                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     759              $C$DW$77        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$77, DW_AT_name("Buffered_DAC12_2")
     762                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Buffered_DAC12_2")
     763                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     764                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     765                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     766              $C$DW$78        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$78, DW_AT_name("Buffered_DAC12_3")
     769                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Buffered_DAC12_3")
     770                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     771                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     772                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     773              $C$DW$79        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$79, DW_AT_name("rsvd2")
     776                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd2")
     777                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     778                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     779                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     780                      .dwendtag $C$DW$T$31
     781              
     782              
     783              $C$DW$T$32      .dwtag  DW_TAG_union_type
     784                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL14_REG")
     785                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     786              $C$DW$80        .dwtag  DW_TAG_member
     787                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
     788                      .dwattr $C$DW$80, DW_AT_name("all")
     789                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
     790                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     791                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     792              $C$DW$81        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$31)
     794                      .dwattr $C$DW$81, DW_AT_name("bit")
     795                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
     796                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     798                      .dwendtag $C$DW$T$32
     799              
     800              
     801              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     802                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL1_BITS")
     803                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   16

     804              $C$DW$82        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     806                      .dwattr $C$DW$82, DW_AT_name("ECAP1")
     807                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_ECAP1")
     808                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     809                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$83        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     813                      .dwattr $C$DW$83, DW_AT_name("ECAP2")
     814                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ECAP2")
     815                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     816                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$84        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$84, DW_AT_name("ECAP3")
     821                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ECAP3")
     822                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     823                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     825              $C$DW$85        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$85, DW_AT_name("ECAP4")
     828                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ECAP4")
     829                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     830                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     832              $C$DW$86        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$86, DW_AT_name("ECAP5")
     835                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ECAP5")
     836                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     837                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     839              $C$DW$87        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$87, DW_AT_name("ECAP6")
     842                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ECAP6")
     843                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     844                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$88        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
     849                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
     850                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
     851                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$89        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$89, DW_AT_name("rsvd2")
     856                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_rsvd2")
     857                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     858                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   17

     859                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     860                      .dwendtag $C$DW$T$33
     861              
     862              
     863              $C$DW$T$34      .dwtag  DW_TAG_union_type
     864                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL1_REG")
     865                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
     866              $C$DW$90        .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
     868                      .dwattr $C$DW$90, DW_AT_name("all")
     869                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
     870                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     871                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     872              $C$DW$91        .dwtag  DW_TAG_member
     873                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$33)
     874                      .dwattr $C$DW$91, DW_AT_name("bit")
     875                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
     876                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     878                      .dwendtag $C$DW$T$34
     879              
     880              
     881              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     882                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL2_BITS")
     883                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
     884              $C$DW$92        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$92, DW_AT_name("EQEP1")
     887                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_EQEP1")
     888                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     889                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     890                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     891              $C$DW$93        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$93, DW_AT_name("EQEP2")
     894                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_EQEP2")
     895                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     896                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     897                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     898              $C$DW$94        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     900                      .dwattr $C$DW$94, DW_AT_name("EQEP3")
     901                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_EQEP3")
     902                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     903                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     904                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$95        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
     908                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
     909                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     910                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     911                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$96        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   18

     914                      .dwattr $C$DW$96, DW_AT_name("rsvd2")
     915                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd2")
     916                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     917                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     918                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     919                      .dwendtag $C$DW$T$35
     920              
     921              
     922              $C$DW$T$36      .dwtag  DW_TAG_union_type
     923                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL2_REG")
     924                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
     925              $C$DW$97        .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
     927                      .dwattr $C$DW$97, DW_AT_name("all")
     928                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
     929                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     930                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$98        .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$35)
     933                      .dwattr $C$DW$98, DW_AT_name("bit")
     934                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
     935                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     937                      .dwendtag $C$DW$T$36
     938              
     939              
     940              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     941                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL3_BITS")
     942                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
     943              $C$DW$99        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$99, DW_AT_name("rsvd1")
     946                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_rsvd1")
     947                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     948                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     950              $C$DW$100       .dwtag  DW_TAG_member
     951                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     952                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
     953                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
     954                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     955                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     956                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     957                      .dwendtag $C$DW$T$37
     958              
     959              
     960              $C$DW$T$38      .dwtag  DW_TAG_union_type
     961                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL3_REG")
     962                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
     963              $C$DW$101       .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
     965                      .dwattr $C$DW$101, DW_AT_name("all")
     966                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
     967                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   19

     969              $C$DW$102       .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$37)
     971                      .dwattr $C$DW$102, DW_AT_name("bit")
     972                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
     973                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     975                      .dwendtag $C$DW$T$38
     976              
     977              
     978              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     979                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL4_BITS")
     980                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
     981              $C$DW$103       .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$103, DW_AT_name("SD1")
     984                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_SD1")
     985                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     986                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$104       .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$104, DW_AT_name("SD2")
     991                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_SD2")
     992                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     993                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$105       .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
     998                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
     999                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1000                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1002              $C$DW$106       .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$106, DW_AT_name("rsvd2")
    1005                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd2")
    1006                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1007                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1008                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1009                      .dwendtag $C$DW$T$39
    1010              
    1011              
    1012              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1013                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL4_REG")
    1014                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1015              $C$DW$107       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
    1017                      .dwattr $C$DW$107, DW_AT_name("all")
    1018                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    1019                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1020                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$108       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$39)
    1023                      .dwattr $C$DW$108, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   20

    1024                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    1025                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1027                      .dwendtag $C$DW$T$40
    1028              
    1029              
    1030              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1031                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL5_BITS")
    1032                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1033              $C$DW$109       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1035                      .dwattr $C$DW$109, DW_AT_name("SCI_A")
    1036                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_SCI_A")
    1037                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1038                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1040              $C$DW$110       .dwtag  DW_TAG_member
    1041                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1042                      .dwattr $C$DW$110, DW_AT_name("SCI_B")
    1043                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_SCI_B")
    1044                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1045                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1046                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1047              $C$DW$111       .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$111, DW_AT_name("SCI_C")
    1050                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_SCI_C")
    1051                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1052                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1054              $C$DW$112       .dwtag  DW_TAG_member
    1055                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1056                      .dwattr $C$DW$112, DW_AT_name("SCI_D")
    1057                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SCI_D")
    1058                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1059                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1060                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1061              $C$DW$113       .dwtag  DW_TAG_member
    1062                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1063                      .dwattr $C$DW$113, DW_AT_name("rsvd1")
    1064                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd1")
    1065                      .dwattr $C$DW$113, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1066                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1067                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1068              $C$DW$114       .dwtag  DW_TAG_member
    1069                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1070                      .dwattr $C$DW$114, DW_AT_name("rsvd2")
    1071                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd2")
    1072                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1073                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1074                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1075                      .dwendtag $C$DW$T$41
    1076              
    1077              
    1078              $C$DW$T$42      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   21

    1079                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL5_REG")
    1080                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1081              $C$DW$115       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    1083                      .dwattr $C$DW$115, DW_AT_name("all")
    1084                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    1085                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1087              $C$DW$116       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$41)
    1089                      .dwattr $C$DW$116, DW_AT_name("bit")
    1090                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    1091                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1093                      .dwendtag $C$DW$T$42
    1094              
    1095              
    1096              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1097                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL6_BITS")
    1098                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1099              $C$DW$117       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1101                      .dwattr $C$DW$117, DW_AT_name("SPI_A")
    1102                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_SPI_A")
    1103                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1104                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1106              $C$DW$118       .dwtag  DW_TAG_member
    1107                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1108                      .dwattr $C$DW$118, DW_AT_name("SPI_B")
    1109                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SPI_B")
    1110                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1111                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$119       .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$119, DW_AT_name("SPI_C")
    1116                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SPI_C")
    1117                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1118                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$120       .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1122                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    1123                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    1124                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1125                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1126                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1127              $C$DW$121       .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1129                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    1130                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    1131                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1132                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1133                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   22

    1134                      .dwendtag $C$DW$T$43
    1135              
    1136              
    1137              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1138                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL6_REG")
    1139                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1140              $C$DW$122       .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1142                      .dwattr $C$DW$122, DW_AT_name("all")
    1143                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1144                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1146              $C$DW$123       .dwtag  DW_TAG_member
    1147                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$43)
    1148                      .dwattr $C$DW$123, DW_AT_name("bit")
    1149                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1150                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1152                      .dwendtag $C$DW$T$44
    1153              
    1154              
    1155              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1156                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL7_BITS")
    1157                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1158              $C$DW$124       .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$124, DW_AT_name("I2C_A")
    1161                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_I2C_A")
    1162                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1163                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1165              $C$DW$125       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$125, DW_AT_name("I2C_B")
    1168                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_I2C_B")
    1169                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1170                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1172              $C$DW$126       .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1174                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1175                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    1176                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1177                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1179              $C$DW$127       .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
    1182                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    1183                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1184                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1185                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1186                      .dwendtag $C$DW$T$45
    1187              
    1188              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   23

    1189              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1190                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL7_REG")
    1191                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1192              $C$DW$128       .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    1194                      .dwattr $C$DW$128, DW_AT_name("all")
    1195                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    1196                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$129       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$45)
    1200                      .dwattr $C$DW$129, DW_AT_name("bit")
    1201                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    1202                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1203                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1204                      .dwendtag $C$DW$T$46
    1205              
    1206              
    1207              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1208                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL8_BITS")
    1209                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1210              $C$DW$130       .dwtag  DW_TAG_member
    1211                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$130, DW_AT_name("CAN_A")
    1213                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_CAN_A")
    1214                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1215                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1216                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1217              $C$DW$131       .dwtag  DW_TAG_member
    1218                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1219                      .dwattr $C$DW$131, DW_AT_name("CAN_B")
    1220                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_CAN_B")
    1221                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1222                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1223                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1224              $C$DW$132       .dwtag  DW_TAG_member
    1225                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1226                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    1227                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
    1228                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1229                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1230                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1231              $C$DW$133       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$133, DW_AT_name("rsvd2")
    1234                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd2")
    1235                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1236                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1237                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1238                      .dwendtag $C$DW$T$47
    1239              
    1240              
    1241              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1242                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL8_REG")
    1243                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   24

    1244              $C$DW$134       .dwtag  DW_TAG_member
    1245                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
    1246                      .dwattr $C$DW$134, DW_AT_name("all")
    1247                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_all")
    1248                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$135       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$47)
    1252                      .dwattr $C$DW$135, DW_AT_name("bit")
    1253                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_bit")
    1254                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1256                      .dwendtag $C$DW$T$48
    1257              
    1258              
    1259              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1260                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL9_BITS")
    1261                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1262              $C$DW$136       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$136, DW_AT_name("McBSP_A")
    1265                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_McBSP_A")
    1266                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1267                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1268                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1269              $C$DW$137       .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$137, DW_AT_name("McBSP_B")
    1272                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_McBSP_B")
    1273                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1274                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1276              $C$DW$138       .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    1279                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    1280                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1281                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1282                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1283              $C$DW$139       .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1285                      .dwattr $C$DW$139, DW_AT_name("rsvd2")
    1286                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd2")
    1287                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1288                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1289                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1290                      .dwendtag $C$DW$T$49
    1291              
    1292              
    1293              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1294                      .dwattr $C$DW$T$50, DW_AT_name("CPUSEL9_REG")
    1295                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1296              $C$DW$140       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1298                      .dwattr $C$DW$140, DW_AT_name("all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   25

    1299                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1300                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1302              $C$DW$141       .dwtag  DW_TAG_member
    1303                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$49)
    1304                      .dwattr $C$DW$141, DW_AT_name("bit")
    1305                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1306                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1308                      .dwendtag $C$DW$T$50
    1309              
    1310              
    1311              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1312                      .dwattr $C$DW$T$51, DW_AT_name("CPUSYSLOCK1_BITS")
    1313                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1314              $C$DW$142       .dwtag  DW_TAG_member
    1315                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1316                      .dwattr $C$DW$142, DW_AT_name("HIBBOOTMODE")
    1317                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1318                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1319                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1320                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$143       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1323                      .dwattr $C$DW$143, DW_AT_name("IORESTOREADDR")
    1324                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1325                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1326                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1327                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1328              $C$DW$144       .dwtag  DW_TAG_member
    1329                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1330                      .dwattr $C$DW$144, DW_AT_name("PIEVERRADDR")
    1331                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1332                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1333                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1334                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1335              $C$DW$145       .dwtag  DW_TAG_member
    1336                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1337                      .dwattr $C$DW$145, DW_AT_name("PCLKCR0")
    1338                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PCLKCR0")
    1339                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1340                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1341                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1342              $C$DW$146       .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1344                      .dwattr $C$DW$146, DW_AT_name("PCLKCR1")
    1345                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PCLKCR1")
    1346                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1347                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1349              $C$DW$147       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$147, DW_AT_name("PCLKCR2")
    1352                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PCLKCR2")
    1353                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   26

    1354                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$148       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1358                      .dwattr $C$DW$148, DW_AT_name("PCLKCR3")
    1359                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PCLKCR3")
    1360                      .dwattr $C$DW$148, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1361                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1363              $C$DW$149       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1365                      .dwattr $C$DW$149, DW_AT_name("PCLKCR4")
    1366                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PCLKCR4")
    1367                      .dwattr $C$DW$149, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1368                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1369                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1370              $C$DW$150       .dwtag  DW_TAG_member
    1371                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1372                      .dwattr $C$DW$150, DW_AT_name("PCLKCR5")
    1373                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_PCLKCR5")
    1374                      .dwattr $C$DW$150, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1375                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1376                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1377              $C$DW$151       .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1379                      .dwattr $C$DW$151, DW_AT_name("PCLKCR6")
    1380                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_PCLKCR6")
    1381                      .dwattr $C$DW$151, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1382                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1384              $C$DW$152       .dwtag  DW_TAG_member
    1385                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1386                      .dwattr $C$DW$152, DW_AT_name("PCLKCR7")
    1387                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_PCLKCR7")
    1388                      .dwattr $C$DW$152, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1389                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1391              $C$DW$153       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1393                      .dwattr $C$DW$153, DW_AT_name("PCLKCR8")
    1394                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_PCLKCR8")
    1395                      .dwattr $C$DW$153, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1396                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1398              $C$DW$154       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1400                      .dwattr $C$DW$154, DW_AT_name("PCLKCR9")
    1401                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_PCLKCR9")
    1402                      .dwattr $C$DW$154, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1403                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1405              $C$DW$155       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1407                      .dwattr $C$DW$155, DW_AT_name("PCLKCR10")
    1408                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_PCLKCR10")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   27

    1409                      .dwattr $C$DW$155, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1410                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1411                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1412              $C$DW$156       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1414                      .dwattr $C$DW$156, DW_AT_name("PCLKCR11")
    1415                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PCLKCR11")
    1416                      .dwattr $C$DW$156, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1417                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1419              $C$DW$157       .dwtag  DW_TAG_member
    1420                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1421                      .dwattr $C$DW$157, DW_AT_name("PCLKCR12")
    1422                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_PCLKCR12")
    1423                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1424                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1425                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1426              $C$DW$158       .dwtag  DW_TAG_member
    1427                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1428                      .dwattr $C$DW$158, DW_AT_name("PCLKCR13")
    1429                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_PCLKCR13")
    1430                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1431                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1432                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1433              $C$DW$159       .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1435                      .dwattr $C$DW$159, DW_AT_name("PCLKCR14")
    1436                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PCLKCR14")
    1437                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1438                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1439                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1440              $C$DW$160       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1442                      .dwattr $C$DW$160, DW_AT_name("PCLKCR15")
    1443                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_PCLKCR15")
    1444                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1445                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1446                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$161       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1449                      .dwattr $C$DW$161, DW_AT_name("PCLKCR16")
    1450                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_PCLKCR16")
    1451                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1452                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1453                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$162       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$162, DW_AT_name("SECMSEL")
    1457                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_SECMSEL")
    1458                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1459                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1460                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$163       .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$163, DW_AT_name("LPMCR")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   28

    1464                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_LPMCR")
    1465                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1466                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1467                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$164       .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1470                      .dwattr $C$DW$164, DW_AT_name("GPIOLPMSEL0")
    1471                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1472                      .dwattr $C$DW$164, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1473                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1474                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1475              $C$DW$165       .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$165, DW_AT_name("GPIOLPMSEL1")
    1478                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1479                      .dwattr $C$DW$165, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1480                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1481                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1482              $C$DW$166       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    1485                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    1486                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1487                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1488                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1489                      .dwendtag $C$DW$T$51
    1490              
    1491              
    1492              $C$DW$T$52      .dwtag  DW_TAG_union_type
    1493                      .dwattr $C$DW$T$52, DW_AT_name("CPUSYSLOCK1_REG")
    1494                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1495              $C$DW$167       .dwtag  DW_TAG_member
    1496                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    1497                      .dwattr $C$DW$167, DW_AT_name("all")
    1498                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    1499                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1500                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1501              $C$DW$168       .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$51)
    1503                      .dwattr $C$DW$168, DW_AT_name("bit")
    1504                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    1505                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1507                      .dwendtag $C$DW$T$52
    1508              
    1509              
    1510              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    1511                      .dwattr $C$DW$T$57, DW_AT_name("CPU_SYS_REGS")
    1512                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x82)
    1513              $C$DW$169       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$52)
    1515                      .dwattr $C$DW$169, DW_AT_name("CPUSYSLOCK1")
    1516                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    1517                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:22 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0699610                         PAGE   29

    1519              $C$DW$170       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$53)
    1521                      .dwattr $C$DW$170, DW_AT_name("rsvd1")
    1522                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd1")
    1523                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1524                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1525              $C$DW$171       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    1527                      .dwattr $C$DW$171, DW_AT_name("HIBBOOTMODE")
    1528                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1529                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1530                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$172       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$112)
    1533                      .dwattr $C$DW$172, DW_AT_name("IORESTOREADDR")
    1534                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1535                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1536                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1537              $C$DW$173       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$154)
    1539                      .dwattr $C$DW$173, DW_AT_name("PIEVERRADDR")
    1540                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PIEVERRADDR")
