TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:25:46 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13                      .global _langID
      14 00000000               .sect   ".econst"
      15                      .align  1
      16 00000000       _langID:

     447                      ; branchcc occurs ; [] |74| 
     448 0000004a       $C$DW$L$_CombineUsbDescriptors$6$E:
     449 0000004a       $C$L6:    
     450                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     451 0000004a 761F+         MOVW      DP,#_loaderConfigDescriptor ; [CPU_U] 
         0000004b 0000 
     452 0000004c 931A+         MOV       AH,@_loaderConfigDescriptor ; [CPU_] |81| 
     453 0000004d 761F+         MOVW      DP,#_loaderInterfaceDescriptor ; [CPU_U] 
         0000004e 0000 
     454 0000004f 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |81| 
     455 00000050 921F+         MOV       AL,@_loaderInterfaceDescriptor ; [CPU_] |81| 
     456 00000051 91FF          ANDB      AH,#0xff              ; [CPU_] |81| 
     457 00000052 90FF          ANDB      AL,#0xff              ; [CPU_] |81| 
     458 00000053 761F+         MOVW      DP,#_loaderEndpointDescriptor ; [CPU_U] 
         00000054 0000 
     459 00000055 94A8          ADD       AL,AH                 ; [CPU_] |81| 
     460 00000056 9312+         MOV       AH,@_loaderEndpointDescriptor ; [CPU_] |81| 
     461 00000057 91FF          ANDB      AH,#0xff              ; [CPU_] |81| 
     462 00000058 95A9          ADD       AH,AL                 ; [CPU_] |81| 
     463 00000059 97CC          MOV       *+XAR4[1],AH          ; [CPU_] |81| 
     464                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     465 0000005a FE86          SUBB      SP,#6                 ; [CPU_U] 
     466                      .dwcfi  cfa_offset, -4
     467 0000005b 8BBE          MOVL      XAR1,*--SP            ; [CPU_] 
     468                      .dwcfi  cfa_offset, -2
     469                      .dwcfi  restore_reg, 7
     470              $C$DW$25        .dwtag  DW_TAG_TI_branch
     471                      .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     472                      .dwattr $C$DW$25, DW_AT_TI_return
     473 0000005c 0006          LRETR     ; [CPU_] 
     474                      ; return occurs ; [] 
     475              
     476              $C$DW$26        .dwtag  DW_TAG_TI_loop
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE   10

     477                      .dwattr $C$DW$26, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0892010:$C$L5:1:1391099146")
     478                      .dwattr $C$DW$26, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     479                      .dwattr $C$DW$26, DW_AT_TI_begin_line(0x4a)
     480                      .dwattr $C$DW$26, DW_AT_TI_end_line(0x4e)
     481              $C$DW$27        .dwtag  DW_TAG_TI_loop_range
     482                      .dwattr $C$DW$27, DW_AT_low_pc($C$DW$L$_CombineUsbDescriptors$6$B)
     483                      .dwattr $C$DW$27, DW_AT_high_pc($C$DW$L$_CombineUsbDescriptors$6$E)
     484                      .dwendtag $C$DW$26
     485              
     486              
     487              $C$DW$28        .dwtag  DW_TAG_TI_loop
     488                      .dwattr $C$DW$28, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0892010:$C$L3:1:1391099146")
     489                      .dwattr $C$DW$28, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     490                      .dwattr $C$DW$28, DW_AT_TI_begin_line(0x42)
     491                      .dwattr $C$DW$28, DW_AT_TI_end_line(0x46)
     492              $C$DW$29        .dwtag  DW_TAG_TI_loop_range
     493                      .dwattr $C$DW$29, DW_AT_low_pc($C$DW$L$_CombineUsbDescriptors$4$B)
     494                      .dwattr $C$DW$29, DW_AT_high_pc($C$DW$L$_CombineUsbDescriptors$4$E)
     495                      .dwendtag $C$DW$28
     496              
     497              
     498              $C$DW$30        .dwtag  DW_TAG_TI_loop
     499                      .dwattr $C$DW$30, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0892010:$C$L1:1:1391099146")
     500                      .dwattr $C$DW$30, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     501                      .dwattr $C$DW$30, DW_AT_TI_begin_line(0x3a)
     502                      .dwattr $C$DW$30, DW_AT_TI_end_line(0x3e)
     503              $C$DW$31        .dwtag  DW_TAG_TI_loop_range
     504                      .dwattr $C$DW$31, DW_AT_low_pc($C$DW$L$_CombineUsbDescriptors$2$B)
     505                      .dwattr $C$DW$31, DW_AT_high_pc($C$DW$L$_CombineUsbDescriptors$2$E)
     506                      .dwendtag $C$DW$30
     507              
     508                      .dwattr $C$DW$19, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     509                      .dwattr $C$DW$19, DW_AT_TI_end_line(0x54)
     510                      .dwattr $C$DW$19, DW_AT_TI_end_column(0x01)
     511                      .dwendentry
     512                      .dwendtag $C$DW$19
     513              
     514              
     515              ;***************************************************************
     516              ;* TYPE INFORMATION                                            *
     517              ;***************************************************************
     518              
     519              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     520                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x09)
     521              $C$DW$32        .dwtag  DW_TAG_member
     522                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     523                      .dwattr $C$DW$32, DW_AT_name("bDescriptorType_bLength")
     524                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
     525                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     526                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     527              $C$DW$33        .dwtag  DW_TAG_member
     528                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     529                      .dwattr $C$DW$33, DW_AT_name("bcdUSB")
     530                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_bcdUSB")
     531                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE   11

     532                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     533              $C$DW$34        .dwtag  DW_TAG_member
     534                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     535                      .dwattr $C$DW$34, DW_AT_name("bDeviceSubClass_bDeviceClass")
     536                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_bDeviceSubClass_bDeviceClass")
     537                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     538                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     539              $C$DW$35        .dwtag  DW_TAG_member
     540                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     541                      .dwattr $C$DW$35, DW_AT_name("bMaxPacketSize_bDeviceProtocol")
     542                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_bMaxPacketSize_bDeviceProtocol")
     543                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     544                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     545              $C$DW$36        .dwtag  DW_TAG_member
     546                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     547                      .dwattr $C$DW$36, DW_AT_name("idVendor")
     548                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_idVendor")
     549                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     550                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     551              $C$DW$37        .dwtag  DW_TAG_member
     552                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     553                      .dwattr $C$DW$37, DW_AT_name("idProduct")
     554                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_idProduct")
     555                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     556                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     557              $C$DW$38        .dwtag  DW_TAG_member
     558                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     559                      .dwattr $C$DW$38, DW_AT_name("bcdDevice")
     560                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_bcdDevice")
     561                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     562                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     563              $C$DW$39        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     565                      .dwattr $C$DW$39, DW_AT_name("iProduct_iManufacturer")
     566                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_iProduct_iManufacturer")
     567                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     568                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     569              $C$DW$40        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     571                      .dwattr $C$DW$40, DW_AT_name("bNumConfigurations_iSerialNumber")
     572                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_bNumConfigurations_iSerialNumber")
     573                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     574                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     575                      .dwendtag $C$DW$T$20
     576              
     577              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbDeviceDescriptor")
     578                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$20)
     579                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
     580              $C$DW$41        .dwtag  DW_TAG_TI_far_type
     581                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$29)
     582              $C$DW$T$30      .dwtag  DW_TAG_const_type
     583                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$41)
     584              
     585              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     586                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x05)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE   12

     587              $C$DW$42        .dwtag  DW_TAG_member
     588                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     589                      .dwattr $C$DW$42, DW_AT_name("bDescriptorType_bLength")
     590                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
     591                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     592                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     593              $C$DW$43        .dwtag  DW_TAG_member
     594                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     595                      .dwattr $C$DW$43, DW_AT_name("wTotalLength")
     596                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_wTotalLength")
     597                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     598                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     599              $C$DW$44        .dwtag  DW_TAG_member
     600                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     601                      .dwattr $C$DW$44, DW_AT_name("bConfigurationValue_bNumInterfaces")
     602                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bConfigurationValue_bNumInterfaces")
     603                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     604                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     605              $C$DW$45        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$45, DW_AT_name("bmAttributes_iConfiguration")
     608                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_bmAttributes_iConfiguration")
     609                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     610                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     611              $C$DW$46        .dwtag  DW_TAG_member
     612                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     613                      .dwattr $C$DW$46, DW_AT_name("padding_bMaxPower")
     614                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_padding_bMaxPower")
     615                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     616                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     617                      .dwendtag $C$DW$T$21
     618              
     619              $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbConfigDescriptor")
     620                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$21)
     621                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
     622              $C$DW$47        .dwtag  DW_TAG_TI_far_type
     623                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$31)
     624              $C$DW$T$32      .dwtag  DW_TAG_const_type
     625                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$47)
     626              
     627              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     628                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x05)
     629              $C$DW$48        .dwtag  DW_TAG_member
     630                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     631                      .dwattr $C$DW$48, DW_AT_name("bDescriptorType_bLength")
     632                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
     633                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     634                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     635              $C$DW$49        .dwtag  DW_TAG_member
     636                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     637                      .dwattr $C$DW$49, DW_AT_name("bAlternateSetting_bInterfaceNumber")
     638                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_bAlternateSetting_bInterfaceNumber")
     639                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     640                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     641              $C$DW$50        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE   13

     642                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     643                      .dwattr $C$DW$50, DW_AT_name("bInterfaceClass_bNumEndpoints")
     644                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bInterfaceClass_bNumEndpoints")
     645                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     646                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     647              $C$DW$51        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$51, DW_AT_name("bInterfaceProtocol_bInterfaceSubclass")
     650                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_bInterfaceProtocol_bInterfaceSubclass")
     651                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     652                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     653              $C$DW$52        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$52, DW_AT_name("padding_iInterface")
     656                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_padding_iInterface")
     657                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     658                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     659                      .dwendtag $C$DW$T$22
     660              
     661              $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbInterfaceDescriptor")
     662                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$22)
     663                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
     664              $C$DW$53        .dwtag  DW_TAG_TI_far_type
     665                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$34)
     666              $C$DW$T$35      .dwtag  DW_TAG_const_type
     667                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$53)
     668              
     669              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     670                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     671              $C$DW$54        .dwtag  DW_TAG_member
     672                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     673                      .dwattr $C$DW$54, DW_AT_name("endpointNumber")
     674                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_endpointNumber")
     675                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     676                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     678              $C$DW$55        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     680                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
     681                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
     682                      .dwattr $C$DW$55, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
     683                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     684                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$56        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$56, DW_AT_name("direction")
     688                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_direction")
     689                      .dwattr $C$DW$56, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     690                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$57        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$57, DW_AT_name("transferType")
     695                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_transferType")
     696                      .dwattr $C$DW$57, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE   14

     697                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     699              $C$DW$58        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$58, DW_AT_name("syncMode")
     702                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_syncMode")
     703                      .dwattr $C$DW$58, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     704                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     706              $C$DW$59        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     708                      .dwattr $C$DW$59, DW_AT_name("usageType")
     709                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_usageType")
     710                      .dwattr $C$DW$59, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     711                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     713              $C$DW$60        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     715                      .dwattr $C$DW$60, DW_AT_name("rsvd2")
     716                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_rsvd2")
     717                      .dwattr $C$DW$60, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     718                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     720                      .dwendtag $C$DW$T$23
     721              
     722              
     723              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     724                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     725              $C$DW$61        .dwtag  DW_TAG_member
     726                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     727                      .dwattr $C$DW$61, DW_AT_name("bDescriptorType_bLength")
     728                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
     729                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     731              $C$DW$62        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$23)
     733                      .dwattr $C$DW$62, DW_AT_name("bmAttributes_bEndpointAddress")
     734                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_bmAttributes_bEndpointAddress")
     735                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     736                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     737              $C$DW$63        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     739                      .dwattr $C$DW$63, DW_AT_name("wMaxPacketSize")
     740                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_wMaxPacketSize")
     741                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     742                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     743              $C$DW$64        .dwtag  DW_TAG_member
     744                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     745                      .dwattr $C$DW$64, DW_AT_name("padding_bInterval")
     746                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_padding_bInterval")
     747                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     748                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     749                      .dwendtag $C$DW$T$24
     750              
     751              $C$DW$T$37      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbEndpointDescriptor")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE   15

     752                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$24)
     753                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
     754              $C$DW$65        .dwtag  DW_TAG_TI_far_type
     755                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$37)
     756              $C$DW$T$38      .dwtag  DW_TAG_const_type
     757                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$65)
     758              
     759              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     760                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
     761              $C$DW$66        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     763                      .dwattr $C$DW$66, DW_AT_name("bDescriptorType_bLength")
     764                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
     765                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     767              $C$DW$67        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$27)
     769                      .dwattr $C$DW$67, DW_AT_name("bString")
     770                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_bString")
     771                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     772                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     773                      .dwendtag $C$DW$T$28
     774              
     775              $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbStringDescriptor")
     776                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$28)
     777                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     778              $C$DW$68        .dwtag  DW_TAG_TI_far_type
     779                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$40)
     780              $C$DW$T$41      .dwtag  DW_TAG_const_type
     781                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$68)
     782              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
     783                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
     784                      .dwattr $C$DW$T$42, DW_AT_address_class(0x16)
     785              $C$DW$69        .dwtag  DW_TAG_TI_far_type
     786                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$42)
     787              $C$DW$T$43      .dwtag  DW_TAG_const_type
     788                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$69)
     789              
     790              $C$DW$T$44      .dwtag  DW_TAG_array_type
     791                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$43)
     792                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
     793                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x0a)
     794              $C$DW$70        .dwtag  DW_TAG_subrange_type
     795                      .dwattr $C$DW$70, DW_AT_upper_bound(0x04)
     796                      .dwendtag $C$DW$T$44
     797              
     798              $C$DW$T$4       .dwtag  DW_TAG_base_type
     799                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
     800                      .dwattr $C$DW$T$4, DW_AT_name("bool")
     801                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
     802              $C$DW$T$5       .dwtag  DW_TAG_base_type
     803                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
     804                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
     805                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
     806              $C$DW$T$6       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:47 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0892010                         PAGE   16

     807                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     808                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
     809                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
     810              $C$DW$T$7       .dwtag  DW_TAG_base_type
     811                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
     812                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
     813                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
     814              $C$DW$T$8       .dwtag  DW_TAG_base_type
     815                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
     816                      .dwattr $C$DW$T$8, DW_AT_name("short")
     817                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
     818              $C$DW$T$9       .dwtag  DW_TAG_base_type
     819                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     820                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
     821                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
     822              $C$DW$T$10      .dwtag  DW_TAG_base_type
     823                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     824                      .dwattr $C$DW$T$10, DW_AT_name("int")
     825                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
