TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:42 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0364810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:25:41 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("stringDescriptors")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_stringDescriptors")

    1476                      .dwattr $C$DW$99, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
    1477                      .dwattr $C$DW$99, DW_AT_TI_begin_line(0x12c)
    1478                      .dwattr $C$DW$99, DW_AT_TI_begin_column(0x06)
    1479                      .dwattr $C$DW$99, DW_AT_TI_max_frame_size(-2)
    1480                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    1481              
    1482                      .dwfde $C$DW$CIE, _AckEp1
    1483              
    1484              ;***************************************************************
    1485              ;* FNAME: _AckEp1                       FR SIZE:   0           *
    1486              ;*                                                             *
    1487              ;* FUNCTION ENVIRONMENT                                        *
    1488              ;*                                                             *
    1489              ;* FUNCTION PROPERTIES                                         *
    1490              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1491              ;***************************************************************
    1492              
    1493 00000178       _AckEp1:
    1494                      .dwcfi  cfa_offset, -2
    1495                      .dwcfi  save_reg_to_mem, 26, 0
    1496                      .dwcfi  save_reg_to_reg, 78, 26
    1497                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    1498 00000178 9A00          MOVB      AL,#0                 ; [CPU_] |302| 
    1499 00000179 8F04          MOVL      XAR4,#262422          ; [CPU_U] |302| 
         0000017a 0116 
    1500 0000017b 3CC4          MOVB      *+XAR4[0],AL.LSB      ; [CPU_] |302| 
    1501                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    1502              $C$DW$100       .dwtag  DW_TAG_TI_branch
    1503                      .dwattr $C$DW$100, DW_AT_low_pc(0x00)
    1504                      .dwattr $C$DW$100, DW_AT_TI_return
    1505 0000017c 0006          LRETR     ; [CPU_] 
    1506                      ; return occurs ; [] 
    1507                      .dwattr $C$DW$99, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
    1508                      .dwattr $C$DW$99, DW_AT_TI_end_line(0x12f)
    1509                      .dwattr $C$DW$99, DW_AT_TI_end_column(0x01)
    1510                      .dwendentry
    1511                      .dwendtag $C$DW$99
    1512              
    1513              ;**************************************************************
    1514              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1515              ;**************************************************************
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:42 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0364810                         PAGE   30

    1516                      .global _stringDescriptors
    1517                      .global _AckUsbInterrupt
    1518                      .global _CombineUsbDescriptors
    1519                      .global _loaderDeviceDescriptor
    1520              
    1521              ;***************************************************************
    1522              ;* TYPE INFORMATION                                            *
    1523              ;***************************************************************
    1524              
    1525              $C$DW$T$27      .dwtag  DW_TAG_enumeration_type
    1526                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1527              $C$DW$101       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_IDLE"), DW_AT_const_value(0x00)
    1528              $C$DW$102       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_TX"), DW_AT_const_value(0x01)
    1529              $C$DW$103       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_RX"), DW_AT_const_value(0x02)
    1530              $C$DW$104       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_STALL"), DW_AT_const_value(0x03)
    1531              $C$DW$105       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_STATE_STATUS"), DW_AT_const_value(0x04)
    1532                      .dwendtag $C$DW$T$27
    1533              
    1534              $C$DW$T$28      .dwtag  DW_TAG_typedef, DW_AT_name("eEndpointState")
    1535                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    1536                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1537              
    1538              $C$DW$T$34      .dwtag  DW_TAG_enumeration_type
    1539                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1540              $C$DW$106       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_MORE_DATA"), DW_AT_const_value(0x00)
    1541              $C$DW$107       .dwtag  DW_TAG_enumerator, DW_AT_name("USB_END_DATA"), DW_AT_const_value(0x01)
    1542                      .dwendtag $C$DW$T$34
    1543              
    1544              $C$DW$T$35      .dwtag  DW_TAG_typedef, DW_AT_name("eDataEnd")
    1545                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1546                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    1547              
    1548              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1549                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    1550              $C$DW$108       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$108, DW_AT_name("recipient")
    1553                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_recipient")
    1554                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
    1555                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1556                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1557              $C$DW$109       .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$109, DW_AT_name("reqType")
    1560                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_reqType")
    1561                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x02)
    1562                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$110       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$110, DW_AT_name("dataDir")
    1567                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_dataDir")
    1568                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1569                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:42 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0364810                         PAGE   31

    1571              $C$DW$111       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$111, DW_AT_name("bRequest")
    1574                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bRequest")
    1575                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1576                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1578                      .dwendtag $C$DW$T$20
    1579              
    1580              
    1581              $C$DW$T$21      .dwtag  DW_TAG_structure_type
    1582                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1583              $C$DW$112       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$20)
    1585                      .dwattr $C$DW$112, DW_AT_name("bmRequestType_bRequest")
    1586                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bmRequestType_bRequest")
    1587                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1588                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1589              $C$DW$113       .dwtag  DW_TAG_member
    1590                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1591                      .dwattr $C$DW$113, DW_AT_name("wValue")
    1592                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_wValue")
    1593                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1594                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$114       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1597                      .dwattr $C$DW$114, DW_AT_name("wIndex")
    1598                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_wIndex")
    1599                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1600                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$115       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$115, DW_AT_name("wLength")
    1604                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_wLength")
    1605                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1606                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1607                      .dwendtag $C$DW$T$21
    1608              
    1609              $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbRequestPacket")
    1610                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$21)
    1611                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1612              $C$DW$116       .dwtag  DW_TAG_TI_far_type
    1613                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$29)
    1614              $C$DW$T$30      .dwtag  DW_TAG_const_type
    1615                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$116)
    1616              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    1617                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1618                      .dwattr $C$DW$T$31, DW_AT_address_class(0x16)
    1619              
    1620              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1621                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1622              $C$DW$117       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$117, DW_AT_name("bDescriptorType_bLength")
    1625                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:42 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0364810                         PAGE   32

    1626                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$118       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$24)
    1630                      .dwattr $C$DW$118, DW_AT_name("bString")
    1631                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bString")
    1632                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1633                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1634                      .dwendtag $C$DW$T$25
    1635              
    1636              $C$DW$T$38      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbStringDescriptor")
    1637                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$25)
    1638                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    1639              $C$DW$119       .dwtag  DW_TAG_TI_far_type
    1640                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$38)
    1641              $C$DW$T$39      .dwtag  DW_TAG_const_type
    1642                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$119)
    1643              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1644                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1645                      .dwattr $C$DW$T$40, DW_AT_address_class(0x16)
    1646              $C$DW$120       .dwtag  DW_TAG_TI_far_type
    1647                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$40)
    1648              $C$DW$T$41      .dwtag  DW_TAG_const_type
    1649                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$120)
    1650              
    1651              $C$DW$T$42      .dwtag  DW_TAG_array_type
    1652                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1653                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    1654              $C$DW$121       .dwtag  DW_TAG_subrange_type
    1655                      .dwendtag $C$DW$T$42
    1656              
    1657              
    1658              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1659                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x09)
    1660              $C$DW$122       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$122, DW_AT_name("bDescriptorType_bLength")
    1663                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bDescriptorType_bLength")
    1664                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1666              $C$DW$123       .dwtag  DW_TAG_member
    1667                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1668                      .dwattr $C$DW$123, DW_AT_name("bcdUSB")
    1669                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bcdUSB")
    1670                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1671                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$124       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$124, DW_AT_name("bDeviceSubClass_bDeviceClass")
    1675                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bDeviceSubClass_bDeviceClass")
    1676                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1677                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$125       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$125, DW_AT_name("bMaxPacketSize_bDeviceProtocol")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:42 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0364810                         PAGE   33

    1681                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bMaxPacketSize_bDeviceProtocol")
    1682                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1683                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$126       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1686                      .dwattr $C$DW$126, DW_AT_name("idVendor")
    1687                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_idVendor")
    1688                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1689                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$127       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1692                      .dwattr $C$DW$127, DW_AT_name("idProduct")
    1693                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_idProduct")
    1694                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1695                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1696              $C$DW$128       .dwtag  DW_TAG_member
    1697                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1698                      .dwattr $C$DW$128, DW_AT_name("bcdDevice")
    1699                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_bcdDevice")
    1700                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1701                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1702              $C$DW$129       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$129, DW_AT_name("iProduct_iManufacturer")
    1705                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_iProduct_iManufacturer")
    1706                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1707                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1708              $C$DW$130       .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1710                      .dwattr $C$DW$130, DW_AT_name("bNumConfigurations_iSerialNumber")
    1711                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bNumConfigurations_iSerialNumber")
    1712                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1713                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1714                      .dwendtag $C$DW$T$26
    1715              
    1716              $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("sUsbDeviceDescriptor")
    1717                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$26)
    1718                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    1719              $C$DW$131       .dwtag  DW_TAG_TI_far_type
    1720                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$44)
    1721              $C$DW$T$45      .dwtag  DW_TAG_const_type
    1722                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$131)
    1723              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1724                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1725                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1726                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1727              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1728                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1729                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1730                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1731              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1732                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1733                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1734                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1735              $C$DW$T$7       .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:42 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0364810                         PAGE   34

    1736                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1737                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1738                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1739              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1740                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1741                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1742                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1743              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1744                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1745                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1746                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1747              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1748                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1749                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1750                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1751              $C$DW$T$62      .dwtag  DW_TAG_pointer_type
    1752                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$10)
    1753                      .dwattr $C$DW$T$62, DW_AT_address_class(0x16)
    1754              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1755                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1756                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1757                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1758              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1759                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1760                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1761              $C$DW$132       .dwtag  DW_TAG_TI_far_type
    1762                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1763              $C$DW$T$54      .dwtag  DW_TAG_const_type
    1764                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$132)
