TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:25:32 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

     726                      .dwattr $C$DW$49, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     727                      .dwattr $C$DW$49, DW_AT_TI_end_line(0xd0)
     728                      .dwattr $C$DW$49, DW_AT_TI_end_column(0x01)
     729                      .dwendentry
     730                      .dwendtag $C$DW$49
     731              
     732 00000124               .sect   ".text"
     733                      .global _AckUsbInterrupt
     734              
     735              $C$DW$55        .dwtag  DW_TAG_subprogram, DW_AT_name("AckUsbInterrupt")
     736                      .dwattr $C$DW$55, DW_AT_low_pc(_AckUsbInterrupt)
     737                      .dwattr $C$DW$55, DW_AT_high_pc(0x00)
     738                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_AckUsbInterrupt")
     739                      .dwattr $C$DW$55, DW_AT_external
     740                      .dwattr $C$DW$55, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
     741                      .dwattr $C$DW$55, DW_AT_TI_begin_line(0xd4)
     742                      .dwattr $C$DW$55, DW_AT_TI_begin_column(0x06)
     743                      .dwattr $C$DW$55, DW_AT_TI_max_frame_size(-2)
     744                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     745              
     746                      .dwfde $C$DW$CIE, _AckUsbInterrupt
     747              
     748              ;***************************************************************
     749              ;* FNAME: _AckUsbInterrupt              FR SIZE:   0           *
     750              ;*                                                             *
     751              ;* FUNCTION ENVIRONMENT                                        *
     752              ;*                                                             *
     753              ;* FUNCTION PROPERTIES                                         *
     754              ;*                            0 Parameter,  0 Auto,  0 SOE     *
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   16

     755              ;***************************************************************
     756              
     757 00000124       _AckUsbInterrupt:
     758                      .dwcfi  cfa_offset, -2
     759                      .dwcfi  save_reg_to_mem, 26, 0
     760                      .dwcfi  save_reg_to_reg, 78, 26
     761                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     762 00000124 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_U] 
         00000125 0000 
     763 00000126 2801!         MOV       @_PieCtrlRegs+1,#256  ; [CPU_] |215| 
         00000127 0100 
     764                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
     765              $C$DW$56        .dwtag  DW_TAG_TI_branch
     766                      .dwattr $C$DW$56, DW_AT_low_pc(0x00)
     767                      .dwattr $C$DW$56, DW_AT_TI_return
     768 00000128 0006          LRETR     ; [CPU_] 
     769                      ; return occurs ; [] 
     770                      .dwattr $C$DW$55, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
     771                      .dwattr $C$DW$55, DW_AT_TI_end_line(0xd8)
     772                      .dwattr $C$DW$55, DW_AT_TI_end_column(0x01)
     773                      .dwendentry
     774                      .dwendtag $C$DW$55
     775              
     776              ;**************************************************************
     777              ;* UNDEFINED EXTERNAL REFERENCES                              *
     778              ;**************************************************************
     779                      .global _CopyData
     780                      .global _AckEp1
     781                      .global _ReadReservedFn
     782                      .global _UsbIntHandler
     783                      .global _c1brom_enable_pie_in_boot
     784                      .global _ResetUsbDriver
     785                      .global _g_UsbRxPacketLength
     786                      .global _g_UsbRxBuffer
     787                      .global _GetWordData
     788                      .global _GetLongData
     789                      .global _PieCtrlRegs
     790                      .global _ClkCfgRegs
     791                      .global _CpuSysRegs
     792                      .global _DevCfgRegs
     793                      .global _GpioCtrlRegs
     794                      .global _PieVectTable
     795              
     796              ;***************************************************************
     797              ;* TYPE INFORMATION                                            *
     798              ;***************************************************************
     799              
     800              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     801                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
     802                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     803              $C$DW$57        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$57, DW_AT_name("AUXPLLDIV")
     806                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_AUXPLLDIV")
     807                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   17

     808                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     810              $C$DW$58        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$58, DW_AT_name("rsvd1")
     813                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd1")
     814                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     815                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$59        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$59, DW_AT_name("rsvd2")
     820                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_rsvd2")
     821                      .dwattr $C$DW$59, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     822                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     823                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     824                      .dwendtag $C$DW$T$20
     825              
     826              
     827              $C$DW$T$22      .dwtag  DW_TAG_union_type
     828                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
     829                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     830              $C$DW$60        .dwtag  DW_TAG_member
     831                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$21)
     832                      .dwattr $C$DW$60, DW_AT_name("all")
     833                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_all")
     834                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     836              $C$DW$61        .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
     838                      .dwattr $C$DW$61, DW_AT_name("bit")
     839                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_bit")
     840                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     842                      .dwendtag $C$DW$T$22
     843              
     844              
     845              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     846                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
     847                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     848              $C$DW$62        .dwtag  DW_TAG_member
     849                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     850                      .dwattr $C$DW$62, DW_AT_name("PLLEN")
     851                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PLLEN")
     852                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     853                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     854                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     855              $C$DW$63        .dwtag  DW_TAG_member
     856                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     857                      .dwattr $C$DW$63, DW_AT_name("PLLCLKEN")
     858                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PLLCLKEN")
     859                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     860                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     861                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     862              $C$DW$64        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   18

     863                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     864                      .dwattr $C$DW$64, DW_AT_name("rsvd1")
     865                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd1")
     866                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     867                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     869              $C$DW$65        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     871                      .dwattr $C$DW$65, DW_AT_name("rsvd2")
     872                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_rsvd2")
     873                      .dwattr $C$DW$65, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     874                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     875                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     876                      .dwendtag $C$DW$T$23
     877              
     878              
     879              $C$DW$T$24      .dwtag  DW_TAG_union_type
     880                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
     881                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     882              $C$DW$66        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
     884                      .dwattr $C$DW$66, DW_AT_name("all")
     885                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_all")
     886                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     887                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     888              $C$DW$67        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$23)
     890                      .dwattr $C$DW$67, DW_AT_name("bit")
     891                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_bit")
     892                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     893                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     894                      .dwendtag $C$DW$T$24
     895              
     896              
     897              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     898                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
     899                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     900              $C$DW$68        .dwtag  DW_TAG_member
     901                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     902                      .dwattr $C$DW$68, DW_AT_name("IMULT")
     903                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_IMULT")
     904                      .dwattr $C$DW$68, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
     905                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$69        .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     909                      .dwattr $C$DW$69, DW_AT_name("rsvd1")
     910                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd1")
     911                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     912                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     913                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     914              $C$DW$70        .dwtag  DW_TAG_member
     915                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     916                      .dwattr $C$DW$70, DW_AT_name("FMULT")
     917                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_FMULT")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   19

     918                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     919                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     920                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     921              $C$DW$71        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$71, DW_AT_name("rsvd2")
     924                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd2")
     925                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     926                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$72        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$72, DW_AT_name("rsvd3")
     931                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd3")
     932                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     933                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     934                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     935                      .dwendtag $C$DW$T$25
     936              
     937              
     938              $C$DW$T$26      .dwtag  DW_TAG_union_type
     939                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
     940                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     941              $C$DW$73        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$21)
     943                      .dwattr $C$DW$73, DW_AT_name("all")
     944                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
     945                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     947              $C$DW$74        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$25)
     949                      .dwattr $C$DW$74, DW_AT_name("bit")
     950                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
     951                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     953                      .dwendtag $C$DW$T$26
     954              
     955              
     956              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     957                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
     958                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     959              $C$DW$75        .dwtag  DW_TAG_member
     960                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     961                      .dwattr $C$DW$75, DW_AT_name("LOCKS")
     962                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_LOCKS")
     963                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     964                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     966              $C$DW$76        .dwtag  DW_TAG_member
     967                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     968                      .dwattr $C$DW$76, DW_AT_name("SLIPS")
     969                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_SLIPS")
     970                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     971                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   20

     973              $C$DW$77        .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     975                      .dwattr $C$DW$77, DW_AT_name("rsvd1")
     976                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd1")
     977                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     978                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     980              $C$DW$78        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$78, DW_AT_name("rsvd2")
     983                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_rsvd2")
     984                      .dwattr $C$DW$78, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     985                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     986                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     987                      .dwendtag $C$DW$T$27
     988              
     989              
     990              $C$DW$T$28      .dwtag  DW_TAG_union_type
     991                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
     992                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     993              $C$DW$79        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$21)
     995                      .dwattr $C$DW$79, DW_AT_name("all")
     996                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_all")
     997                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     999              $C$DW$80        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$27)
    1001                      .dwattr $C$DW$80, DW_AT_name("bit")
    1002                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_bit")
    1003                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1005                      .dwendtag $C$DW$T$28
    1006              
    1007              
    1008              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1009                      .dwattr $C$DW$T$29, DW_AT_name("CCR_BITS")
    1010                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1011              $C$DW$81        .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$81, DW_AT_name("VMAPS")
    1014                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_VMAPS")
    1015                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$82        .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1020                      .dwattr $C$DW$82, DW_AT_name("MONPRIV")
    1021                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_MONPRIV")
    1022                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1023                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1025              $C$DW$83        .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$83, DW_AT_name("ENPROT")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   21

    1028                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ENPROT")
    1029                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1030                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1032              $C$DW$84        .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$84, DW_AT_name("rsvd1")
    1035                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd1")
    1036                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1037                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$85        .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$85, DW_AT_name("rsvd2")
    1042                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd2")
    1043                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1044                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1045                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1046                      .dwendtag $C$DW$T$29
    1047              
    1048              
    1049              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1050                      .dwattr $C$DW$T$30, DW_AT_name("CCR_REG")
    1051                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1052              $C$DW$86        .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
    1054                      .dwattr $C$DW$86, DW_AT_name("all")
    1055                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_all")
    1056                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$87        .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
    1060                      .dwattr $C$DW$87, DW_AT_name("bit")
    1061                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_bit")
    1062                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1064                      .dwendtag $C$DW$T$30
    1065              
    1066              
    1067              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1068                      .dwattr $C$DW$T$31, DW_AT_name("CLKCFGLOCK1_BITS")
    1069                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1070              $C$DW$88        .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$88, DW_AT_name("CLKSRCCTL1")
    1073                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1074                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$89        .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$89, DW_AT_name("CLKSRCCTL2")
    1080                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1081                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1082                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   22

    1083                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$90        .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$90, DW_AT_name("CLKSRCCTL3")
    1087                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1088                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$91        .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$91, DW_AT_name("SYSPLLCTL1")
    1094                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1095                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1096                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$92        .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$92, DW_AT_name("SYSPLLCTL2")
    1101                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1102                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1103                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$93        .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1107                      .dwattr $C$DW$93, DW_AT_name("SYSPLLCTL3")
    1108                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1109                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1110                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1111                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1112              $C$DW$94        .dwtag  DW_TAG_member
    1113                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1114                      .dwattr $C$DW$94, DW_AT_name("SYSPLLMULT")
    1115                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1116                      .dwattr $C$DW$94, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1117                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$95        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1121                      .dwattr $C$DW$95, DW_AT_name("AUXPLLCTL1")
    1122                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1123                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1124                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1125                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1126              $C$DW$96        .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1128                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1129                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1130                      .dwattr $C$DW$96, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1131                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1133              $C$DW$97        .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1135                      .dwattr $C$DW$97, DW_AT_name("AUXPLLMULT")
    1136                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1137                      .dwattr $C$DW$97, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   23

    1138                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1139                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1140              $C$DW$98        .dwtag  DW_TAG_member
    1141                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1142                      .dwattr $C$DW$98, DW_AT_name("SYSCLKDIVSEL")
    1143                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1144                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1145                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1146                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$99        .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1149                      .dwattr $C$DW$99, DW_AT_name("AUXCLKDIVSEL")
    1150                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1151                      .dwattr $C$DW$99, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1152                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1153                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1154              $C$DW$100       .dwtag  DW_TAG_member
    1155                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1156                      .dwattr $C$DW$100, DW_AT_name("PERCLKDIVSEL")
    1157                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1158                      .dwattr $C$DW$100, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1159                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1160                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1161              $C$DW$101       .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1163                      .dwattr $C$DW$101, DW_AT_name("rsvd2")
    1164                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_rsvd2")
    1165                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1166                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1168              $C$DW$102       .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$102, DW_AT_name("LOSPCP")
    1171                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_LOSPCP")
    1172                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1173                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$103       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$103, DW_AT_name("rsvd3")
    1178                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd3")
    1179                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1180                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1181                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1182                      .dwendtag $C$DW$T$31
    1183              
    1184              
    1185              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1186                      .dwattr $C$DW$T$32, DW_AT_name("CLKCFGLOCK1_REG")
    1187                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1188              $C$DW$104       .dwtag  DW_TAG_member
    1189                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
    1190                      .dwattr $C$DW$104, DW_AT_name("all")
    1191                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
    1192                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   24

    1193                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$105       .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$31)
    1196                      .dwattr $C$DW$105, DW_AT_name("bit")
    1197                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
    1198                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1200                      .dwendtag $C$DW$T$32
    1201              
    1202              
    1203              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1204                      .dwattr $C$DW$T$33, DW_AT_name("CLKSEM_BITS")
    1205                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1206              $C$DW$106       .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1208                      .dwattr $C$DW$106, DW_AT_name("SEM")
    1209                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_SEM")
    1210                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1211                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1213              $C$DW$107       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$107, DW_AT_name("rsvd1")
    1216                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_rsvd1")
    1217                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1218                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1220              $C$DW$108       .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1222                      .dwattr $C$DW$108, DW_AT_name("KEY")
    1223                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_KEY")
    1224                      .dwattr $C$DW$108, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1225                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1226                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1227                      .dwendtag $C$DW$T$33
    1228              
    1229              
    1230              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1231                      .dwattr $C$DW$T$34, DW_AT_name("CLKSEM_REG")
    1232                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1233              $C$DW$109       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    1235                      .dwattr $C$DW$109, DW_AT_name("all")
    1236                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_all")
    1237                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1239              $C$DW$110       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$33)
    1241                      .dwattr $C$DW$110, DW_AT_name("bit")
    1242                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_bit")
    1243                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1245                      .dwendtag $C$DW$T$34
    1246              
    1247              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   25

    1248              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1249                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL1_BITS")
    1250                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1251              $C$DW$111       .dwtag  DW_TAG_member
    1252                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1253                      .dwattr $C$DW$111, DW_AT_name("OSCCLKSRCSEL")
    1254                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1255                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1256                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1257                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1258              $C$DW$112       .dwtag  DW_TAG_member
    1259                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1260                      .dwattr $C$DW$112, DW_AT_name("rsvd1")
    1261                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd1")
    1262                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1263                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1264                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1265              $C$DW$113       .dwtag  DW_TAG_member
    1266                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1267                      .dwattr $C$DW$113, DW_AT_name("INTOSC2OFF")
    1268                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1269                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1270                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1271                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1272              $C$DW$114       .dwtag  DW_TAG_member
    1273                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1274                      .dwattr $C$DW$114, DW_AT_name("XTALOFF")
    1275                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_XTALOFF")
    1276                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1277                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1278                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$115       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1281                      .dwattr $C$DW$115, DW_AT_name("WDHALTI")
    1282                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_WDHALTI")
    1283                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1284                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$116       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1288                      .dwattr $C$DW$116, DW_AT_name("rsvd2")
    1289                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd2")
    1290                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1291                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1293              $C$DW$117       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$117, DW_AT_name("rsvd3")
    1296                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd3")
    1297                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1298                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1299                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1300                      .dwendtag $C$DW$T$35
    1301              
    1302              
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   26

    1303              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1304                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL1_REG")
    1305                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1306              $C$DW$118       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1308                      .dwattr $C$DW$118, DW_AT_name("all")
    1309                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1310                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$119       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$35)
    1314                      .dwattr $C$DW$119, DW_AT_name("bit")
    1315                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1316                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1317                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1318                      .dwendtag $C$DW$T$36
    1319              
    1320              
    1321              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1322                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL2_BITS")
    1323                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1324              $C$DW$120       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$120, DW_AT_name("AUXOSCCLKSRCSEL")
    1327                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    1328                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1329                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$121       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$121, DW_AT_name("CANABCLKSEL")
    1334                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_CANABCLKSEL")
    1335                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1336                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1337                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$122       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$122, DW_AT_name("CANBBCLKSEL")
    1341                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    1342                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1343                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1344                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$123       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    1348                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    1349                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1350                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$124       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1354                      .dwattr $C$DW$124, DW_AT_name("rsvd2")
    1355                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd2")
    1356                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1357                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   27

    1358                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1359                      .dwendtag $C$DW$T$37
    1360              
    1361              
    1362              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1363                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL2_REG")
    1364                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1365              $C$DW$125       .dwtag  DW_TAG_member
    1366                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1367                      .dwattr $C$DW$125, DW_AT_name("all")
    1368                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1369                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$126       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$37)
    1373                      .dwattr $C$DW$126, DW_AT_name("bit")
    1374                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1375                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1376                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1377                      .dwendtag $C$DW$T$38
    1378              
    1379              
    1380              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1381                      .dwattr $C$DW$T$39, DW_AT_name("CLKSRCCTL3_BITS")
    1382                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1383              $C$DW$127       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1385                      .dwattr $C$DW$127, DW_AT_name("XCLKOUTSEL")
    1386                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    1387                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1388                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$128       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1392                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1393                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1394                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1395                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$129       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$129, DW_AT_name("rsvd2")
    1400                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd2")
    1401                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1402                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1403                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1404                      .dwendtag $C$DW$T$39
    1405              
    1406              
    1407              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1408                      .dwattr $C$DW$T$40, DW_AT_name("CLKSRCCTL3_REG")
    1409                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1410              $C$DW$130       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    1412                      .dwattr $C$DW$130, DW_AT_name("all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   28

    1413                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_all")
    1414                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1416              $C$DW$131       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$39)
    1418                      .dwattr $C$DW$131, DW_AT_name("bit")
    1419                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_bit")
    1420                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1421                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1422                      .dwendtag $C$DW$T$40
    1423              
    1424              
    1425              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1426                      .dwattr $C$DW$T$43, DW_AT_name("CLK_CFG_REGS")
    1427                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x32)
    1428              $C$DW$132       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$34)
    1430                      .dwattr $C$DW$132, DW_AT_name("CLKSEM")
    1431                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_CLKSEM")
    1432                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1434              $C$DW$133       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
    1436                      .dwattr $C$DW$133, DW_AT_name("CLKCFGLOCK1")
    1437                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    1438                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1439                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1440              $C$DW$134       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$41)
    1442                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1443                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    1444                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1445                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1446              $C$DW$135       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$36)
    1448                      .dwattr $C$DW$135, DW_AT_name("CLKSRCCTL1")
    1449                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1450                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1451                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1452              $C$DW$136       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$38)
    1454                      .dwattr $C$DW$136, DW_AT_name("CLKSRCCTL2")
    1455                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1456                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1457                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$137       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$40)
    1460                      .dwattr $C$DW$137, DW_AT_name("CLKSRCCTL3")
    1461                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1462                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1463                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1464              $C$DW$138       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$497)
    1466                      .dwattr $C$DW$138, DW_AT_name("SYSPLLCTL1")
    1467                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_SYSPLLCTL1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   29

    1468                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1469                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1470              $C$DW$139       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$499)
    1472                      .dwattr $C$DW$139, DW_AT_name("SYSPLLCTL2")
    1473                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1474                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1475                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1476              $C$DW$140       .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$501)
    1478                      .dwattr $C$DW$140, DW_AT_name("SYSPLLCTL3")
    1479                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1480                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1481                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1482              $C$DW$141       .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$503)
    1484                      .dwattr $C$DW$141, DW_AT_name("SYSPLLMULT")
    1485                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1486                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1487                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1488              $C$DW$142       .dwtag  DW_TAG_member
    1489                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$505)
    1490                      .dwattr $C$DW$142, DW_AT_name("SYSPLLSTS")
    1491                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_SYSPLLSTS")
    1492                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1493                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1494              $C$DW$143       .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$24)
    1496                      .dwattr $C$DW$143, DW_AT_name("AUXPLLCTL1")
    1497                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1498                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1499                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1500              $C$DW$144       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$41)
    1502                      .dwattr $C$DW$144, DW_AT_name("rsvd2")
    1503                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd2")
    1504                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1505                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1506              $C$DW$145       .dwtag  DW_TAG_member
    1507                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$26)
    1508                      .dwattr $C$DW$145, DW_AT_name("AUXPLLMULT")
    1509                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1510                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1511                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1512              $C$DW$146       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$28)
    1514                      .dwattr $C$DW$146, DW_AT_name("AUXPLLSTS")
    1515                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_AUXPLLSTS")
    1516                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1517                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1518              $C$DW$147       .dwtag  DW_TAG_member
    1519                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$493)
    1520                      .dwattr $C$DW$147, DW_AT_name("SYSCLKDIVSEL")
    1521                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1522                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   30

    1523                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$148       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$22)
    1526                      .dwattr $C$DW$148, DW_AT_name("AUXCLKDIVSEL")
    1527                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1528                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1529                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1530              $C$DW$149       .dwtag  DW_TAG_member
    1531                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$394)
    1532                      .dwattr $C$DW$149, DW_AT_name("PERCLKDIVSEL")
    1533                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1534                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1535                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1536              $C$DW$150       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$511)
    1538                      .dwattr $C$DW$150, DW_AT_name("XCLKOUTDIVSEL")
    1539                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    1540                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1541                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1542              $C$DW$151       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$42)
    1544                      .dwattr $C$DW$151, DW_AT_name("rsvd3")
    1545                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd3")
    1546                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1547                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1548              $C$DW$152       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$352)
    1550                      .dwattr $C$DW$152, DW_AT_name("LOSPCP")
    1551                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_LOSPCP")
    1552                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1553                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1554              $C$DW$153       .dwtag  DW_TAG_member
    1555                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$358)
    1556                      .dwattr $C$DW$153, DW_AT_name("MCDCR")
    1557                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_MCDCR")
    1558                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1559                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1560              $C$DW$154       .dwtag  DW_TAG_member
    1561                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$509)
    1562                      .dwattr $C$DW$154, DW_AT_name("X1CNT")
    1563                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_X1CNT")
    1564                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1565                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1566                      .dwendtag $C$DW$T$43
    1567              
    1568              $C$DW$155       .dwtag  DW_TAG_TI_far_type
    1569                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$43)
    1570              $C$DW$T$524     .dwtag  DW_TAG_volatile_type
    1571                      .dwattr $C$DW$T$524, DW_AT_type(*$C$DW$155)
    1572              
    1573              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1574                      .dwattr $C$DW$T$44, DW_AT_name("CPU2RESCTL_BITS")
    1575                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1576              $C$DW$156       .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   31

    1578                      .dwattr $C$DW$156, DW_AT_name("RESET")
    1579                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_RESET")
    1580                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1581                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1582                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1583              $C$DW$157       .dwtag  DW_TAG_member
    1584                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1585                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    1586                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    1587                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1588                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1590              $C$DW$158       .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1592                      .dwattr $C$DW$158, DW_AT_name("KEY")
    1593                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_KEY")
    1594                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1595                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1596                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1597                      .dwendtag $C$DW$T$44
    1598              
    1599              
    1600              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1601                      .dwattr $C$DW$T$45, DW_AT_name("CPU2RESCTL_REG")
    1602                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1603              $C$DW$159       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    1605                      .dwattr $C$DW$159, DW_AT_name("all")
    1606                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    1607                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1609              $C$DW$160       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$44)
    1611                      .dwattr $C$DW$160, DW_AT_name("bit")
    1612                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    1613                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1615                      .dwendtag $C$DW$T$45
    1616              
    1617              
    1618              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1619                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL0_BITS")
    1620                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1621              $C$DW$161       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1623                      .dwattr $C$DW$161, DW_AT_name("EPWM1")
    1624                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_EPWM1")
    1625                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1626                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1627                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1628              $C$DW$162       .dwtag  DW_TAG_member
    1629                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1630                      .dwattr $C$DW$162, DW_AT_name("EPWM2")
    1631                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_EPWM2")
    1632                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   32

    1633                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1634                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1635              $C$DW$163       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1637                      .dwattr $C$DW$163, DW_AT_name("EPWM3")
    1638                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_EPWM3")
    1639                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1640                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1642              $C$DW$164       .dwtag  DW_TAG_member
    1643                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1644                      .dwattr $C$DW$164, DW_AT_name("EPWM4")
    1645                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_EPWM4")
    1646                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1647                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1648                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1649              $C$DW$165       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1651                      .dwattr $C$DW$165, DW_AT_name("EPWM5")
    1652                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_EPWM5")
    1653                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1654                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1656              $C$DW$166       .dwtag  DW_TAG_member
    1657                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1658                      .dwattr $C$DW$166, DW_AT_name("EPWM6")
    1659                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_EPWM6")
    1660                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1661                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1662                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$167       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$167, DW_AT_name("EPWM7")
    1666                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_EPWM7")
    1667                      .dwattr $C$DW$167, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1668                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1669                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1670              $C$DW$168       .dwtag  DW_TAG_member
    1671                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1672                      .dwattr $C$DW$168, DW_AT_name("EPWM8")
    1673                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_EPWM8")
    1674                      .dwattr $C$DW$168, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1675                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1676                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1677              $C$DW$169       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1679                      .dwattr $C$DW$169, DW_AT_name("EPWM9")
    1680                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_EPWM9")
    1681                      .dwattr $C$DW$169, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1682                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1683                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1684              $C$DW$170       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1686                      .dwattr $C$DW$170, DW_AT_name("EPWM10")
    1687                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_EPWM10")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   33

    1688                      .dwattr $C$DW$170, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1689                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1690                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1691              $C$DW$171       .dwtag  DW_TAG_member
    1692                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1693                      .dwattr $C$DW$171, DW_AT_name("EPWM11")
    1694                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_EPWM11")
    1695                      .dwattr $C$DW$171, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1696                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1697                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1698              $C$DW$172       .dwtag  DW_TAG_member
    1699                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1700                      .dwattr $C$DW$172, DW_AT_name("EPWM12")
    1701                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_EPWM12")
    1702                      .dwattr $C$DW$172, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1703                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$173       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1707                      .dwattr $C$DW$173, DW_AT_name("rsvd1")
    1708                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd1")
    1709                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1710                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1711                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1712              $C$DW$174       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1714                      .dwattr $C$DW$174, DW_AT_name("rsvd2")
    1715                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd2")
    1716                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1717                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1718                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1719                      .dwendtag $C$DW$T$46
    1720              
    1721              
    1722              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1723                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL0_REG")
    1724                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1725              $C$DW$175       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    1727                      .dwattr $C$DW$175, DW_AT_name("all")
    1728                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    1729                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$176       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$46)
    1733                      .dwattr $C$DW$176, DW_AT_name("bit")
    1734                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    1735                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1737                      .dwendtag $C$DW$T$47
    1738              
    1739              
    1740              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1741                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL11_BITS")
    1742                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   34

    1743              $C$DW$177       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$177, DW_AT_name("ADC1")
    1746                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADC1")
    1747                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1748                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$178       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$178, DW_AT_name("ADC2")
    1753                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADC2")
    1754                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1755                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$179       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$179, DW_AT_name("ADC3")
    1760                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADC3")
    1761                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1762                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1763                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1764              $C$DW$180       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1766                      .dwattr $C$DW$180, DW_AT_name("ADC4")
    1767                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ADC4")
    1768                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1769                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$181       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1773                      .dwattr $C$DW$181, DW_AT_name("rsvd1")
    1774                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd1")
    1775                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1776                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1777                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1778              $C$DW$182       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1780                      .dwattr $C$DW$182, DW_AT_name("rsvd2")
    1781                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd2")
    1782                      .dwattr $C$DW$182, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1783                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1784                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1785                      .dwendtag $C$DW$T$48
    1786              
    1787              
    1788              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1789                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL11_REG")
    1790                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1791              $C$DW$183       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    1793                      .dwattr $C$DW$183, DW_AT_name("all")
    1794                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_all")
    1795                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1797              $C$DW$184       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   35

    1798                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$48)
    1799                      .dwattr $C$DW$184, DW_AT_name("bit")
    1800                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_bit")
    1801                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1802                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1803                      .dwendtag $C$DW$T$49
    1804              
    1805              
    1806              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1807                      .dwattr $C$DW$T$50, DW_AT_name("CPUSEL12_BITS")
    1808                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1809              $C$DW$185       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$185, DW_AT_name("CMPSS1")
    1812                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CMPSS1")
    1813                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1814                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1815                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1816              $C$DW$186       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1818                      .dwattr $C$DW$186, DW_AT_name("CMPSS2")
    1819                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_CMPSS2")
    1820                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1821                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1823              $C$DW$187       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$187, DW_AT_name("CMPSS3")
    1826                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CMPSS3")
    1827                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1828                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1829                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1830              $C$DW$188       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1832                      .dwattr $C$DW$188, DW_AT_name("CMPSS4")
    1833                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CMPSS4")
    1834                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1835                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1836                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$189       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1839                      .dwattr $C$DW$189, DW_AT_name("CMPSS5")
    1840                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CMPSS5")
    1841                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1842                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1843                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1844              $C$DW$190       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1846                      .dwattr $C$DW$190, DW_AT_name("CMPSS6")
    1847                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CMPSS6")
    1848                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1849                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1850                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1851              $C$DW$191       .dwtag  DW_TAG_member
    1852                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   36

    1853                      .dwattr $C$DW$191, DW_AT_name("CMPSS7")
    1854                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_CMPSS7")
    1855                      .dwattr $C$DW$191, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1856                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1857                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1858              $C$DW$192       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1860                      .dwattr $C$DW$192, DW_AT_name("CMPSS8")
    1861                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CMPSS8")
    1862                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1863                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1864                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1865              $C$DW$193       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1867                      .dwattr $C$DW$193, DW_AT_name("rsvd1")
    1868                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd1")
    1869                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1870                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1871                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1872              $C$DW$194       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1874                      .dwattr $C$DW$194, DW_AT_name("rsvd2")
    1875                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd2")
    1876                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1877                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1878                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1879                      .dwendtag $C$DW$T$50
    1880              
    1881              
    1882              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1883                      .dwattr $C$DW$T$51, DW_AT_name("CPUSEL12_REG")
    1884                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1885              $C$DW$195       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    1887                      .dwattr $C$DW$195, DW_AT_name("all")
    1888                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_all")
    1889                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1890                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$196       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$50)
    1893                      .dwattr $C$DW$196, DW_AT_name("bit")
    1894                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_bit")
    1895                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1896                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1897                      .dwendtag $C$DW$T$51
    1898              
    1899              
    1900              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1901                      .dwattr $C$DW$T$52, DW_AT_name("CPUSEL14_BITS")
    1902                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1903              $C$DW$197       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1905                      .dwattr $C$DW$197, DW_AT_name("rsvd1")
    1906                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd1")
    1907                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   37

    1908                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1909                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1910              $C$DW$198       .dwtag  DW_TAG_member
    1911                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1912                      .dwattr $C$DW$198, DW_AT_name("Buffered_DAC12_1")
    1913                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Buffered_DAC12_1")
    1914                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1915                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1916                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1917              $C$DW$199       .dwtag  DW_TAG_member
    1918                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1919                      .dwattr $C$DW$199, DW_AT_name("Buffered_DAC12_2")
    1920                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Buffered_DAC12_2")
    1921                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1922                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1923                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1924              $C$DW$200       .dwtag  DW_TAG_member
    1925                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1926                      .dwattr $C$DW$200, DW_AT_name("Buffered_DAC12_3")
    1927                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_Buffered_DAC12_3")
    1928                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1929                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1930                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1931              $C$DW$201       .dwtag  DW_TAG_member
    1932                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1933                      .dwattr $C$DW$201, DW_AT_name("rsvd2")
    1934                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd2")
    1935                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1936                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1937                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1938                      .dwendtag $C$DW$T$52
    1939              
    1940              
    1941              $C$DW$T$53      .dwtag  DW_TAG_union_type
    1942                      .dwattr $C$DW$T$53, DW_AT_name("CPUSEL14_REG")
    1943                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    1944              $C$DW$202       .dwtag  DW_TAG_member
    1945                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    1946                      .dwattr $C$DW$202, DW_AT_name("all")
    1947                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
    1948                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1949                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$203       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$52)
    1952                      .dwattr $C$DW$203, DW_AT_name("bit")
    1953                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
    1954                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1955                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1956                      .dwendtag $C$DW$T$53
    1957              
    1958              
    1959              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    1960                      .dwattr $C$DW$T$54, DW_AT_name("CPUSEL1_BITS")
    1961                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    1962              $C$DW$204       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:25:33 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0933610                         PAGE   38

    1963                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1964                      .dwattr $C$DW$204, DW_AT_name("ECAP1")
    1965                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ECAP1")
    1966                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1967                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1968                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$205       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    1971                      .dwattr $C$DW$205, DW_AT_name("ECAP2")
    1972                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ECAP2")
    1973                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1974                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1975                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1976              $C$DW$206       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    1978                      .dwattr $C$DW$206, DW_AT_name("ECAP3")
    1979                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_ECAP3")
    1980                      .dwattr $C$DW$206, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
