TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:28:16 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("WdRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_WdRegs")

     812                      .dwendentry
     813                      .dwendtag $C$DW$39
     814              
     815 000000a3               .sect   ".text"
     816                      .global _sysctl_wdog_reset_enable_clear_counter
     817              
     818              $C$DW$41        .dwtag  DW_TAG_subprogram, DW_AT_name("sysctl_wdog_reset_enable_clear_counter")
     819                      .dwattr $C$DW$41, DW_AT_low_pc(_sysctl_wdog_reset_enable_clear_counter)
     820                      .dwattr $C$DW$41, DW_AT_high_pc(0x00)
     821                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_sysctl_wdog_reset_enable_clear_counter")
     822                      .dwattr $C$DW$41, DW_AT_external
     823                      .dwattr $C$DW$41, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     824                      .dwattr $C$DW$41, DW_AT_TI_begin_line(0xb9)
     825                      .dwattr $C$DW$41, DW_AT_TI_begin_column(0x06)
     826                      .dwattr $C$DW$41, DW_AT_TI_max_frame_size(-2)
     827                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     828              
     829                      .dwfde $C$DW$CIE, _sysctl_wdog_reset_enable_clear_counter
     830              
     831              ;***************************************************************
     832              ;* FNAME: _sysctl_wdog_reset_enable_clear_counter FR SIZE:   0           *
     833              ;*                                                             *
     834              ;* FUNCTION ENVIRONMENT                                        *
     835              ;*                                                             *
     836              ;* FUNCTION PROPERTIES                                         *
     837              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     838              ;***************************************************************
     839              
     840 000000a3       _sysctl_wdog_reset_enable_clear_counter:
     841                      .dwcfi  cfa_offset, -2
     842                      .dwcfi  save_reg_to_mem, 26, 0
     843                      .dwcfi  save_reg_to_reg, 78, 26
     844                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     845 000000a3 7622   EALLOW
     846                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     847 000000a4 761F!         MOVW      DP,#_WdRegs+34        ; [CPU_U] 
         000000a5 0000 
     848 000000a6 2B22!         MOV       @_WdRegs+34,#0        ; [CPU_] |188| 
     849                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     850 000000a7 56BF!         MOVB      @_WdRegs+37,#85,UNC   ; [CPU_] |189| 
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE   17

         000000a8 5525 
     851                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     852 000000a9 56BF!         MOVB      @_WdRegs+37,#170,UNC  ; [CPU_] |190| 
         000000aa AA25 
     853                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     854 000000ab 56BF!         MOVB      @_WdRegs+41,#40,UNC   ; [CPU_] |191| 
         000000ac 2829 
     855                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     856 000000ad 761A   EDIS
     857                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_common/so
     858 000000ae FF69          SPM       #0                    ; [CPU_] 
     859              $C$DW$42        .dwtag  DW_TAG_TI_branch
     860                      .dwattr $C$DW$42, DW_AT_low_pc(0x00)
     861                      .dwattr $C$DW$42, DW_AT_TI_return
     862 000000af 0006          LRETR     ; [CPU_] 
     863                      ; return occurs ; [] 
     864                      .dwattr $C$DW$41, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
     865                      .dwattr $C$DW$41, DW_AT_TI_end_line(0xc1)
     866                      .dwattr $C$DW$41, DW_AT_TI_end_column(0x01)
     867                      .dwendentry
     868                      .dwendtag $C$DW$41
     869              
     870              ;**************************************************************
     871              ;* UNDEFINED EXTERNAL REFERENCES                              *
     872              ;**************************************************************
     873                      .global _WdRegs
     874              
     875              ;***************************************************************
     876              ;* TYPE INFORMATION                                            *
     877              ;***************************************************************
     878              
     879              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     880                      .dwattr $C$DW$T$20, DW_AT_name("SCSR_BITS")
     881                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     882              $C$DW$43        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$43, DW_AT_name("WDOVERRIDE")
     885                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_WDOVERRIDE")
     886                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     887                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$44        .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$44, DW_AT_name("WDENINT")
     892                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_WDENINT")
     893                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     894                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     896              $C$DW$45        .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$45, DW_AT_name("WDINTS")
     899                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_WDINTS")
     900                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     901                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE   18

     903              $C$DW$46        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$46, DW_AT_name("rsvd1")
     906                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_rsvd1")
     907                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     908                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     910                      .dwendtag $C$DW$T$20
     911              
     912              
     913              $C$DW$T$21      .dwtag  DW_TAG_union_type
     914                      .dwattr $C$DW$T$21, DW_AT_name("SCSR_REG")
     915                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     916              $C$DW$47        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$47, DW_AT_name("all")
     919                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_all")
     920                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$48        .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     924                      .dwattr $C$DW$48, DW_AT_name("bit")
     925                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_bit")
     926                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     928                      .dwendtag $C$DW$T$21
     929              
     930              
     931              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     932                      .dwattr $C$DW$T$22, DW_AT_name("WDCNTR_BITS")
     933                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     934              $C$DW$49        .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     936                      .dwattr $C$DW$49, DW_AT_name("WDCNTR")
     937                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_WDCNTR")
     938                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     939                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$50        .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$50, DW_AT_name("rsvd1")
     944                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_rsvd1")
     945                      .dwattr $C$DW$50, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     946                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     948                      .dwendtag $C$DW$T$22
     949              
     950              
     951              $C$DW$T$23      .dwtag  DW_TAG_union_type
     952                      .dwattr $C$DW$T$23, DW_AT_name("WDCNTR_REG")
     953                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     954              $C$DW$51        .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$51, DW_AT_name("all")
     957                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE   19

     958                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     960              $C$DW$52        .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$22)
     962                      .dwattr $C$DW$52, DW_AT_name("bit")
     963                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_bit")
     964                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     965                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     966                      .dwendtag $C$DW$T$23
     967              
     968              
     969              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     970                      .dwattr $C$DW$T$24, DW_AT_name("WDCR_BITS")
     971                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     972              $C$DW$53        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$53, DW_AT_name("WDPS")
     975                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_WDPS")
     976                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
     977                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$54        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$54, DW_AT_name("WDCHK")
     982                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_WDCHK")
     983                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x03)
     984                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     986              $C$DW$55        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$55, DW_AT_name("WDDIS")
     989                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_WDDIS")
     990                      .dwattr $C$DW$55, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     991                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     993              $C$DW$56        .dwtag  DW_TAG_member
     994                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     995                      .dwattr $C$DW$56, DW_AT_name("WDFLG")
     996                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_WDFLG")
     997                      .dwattr $C$DW$56, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     998                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1000              $C$DW$57        .dwtag  DW_TAG_member
    1001                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
    1002                      .dwattr $C$DW$57, DW_AT_name("rsvd1")
    1003                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd1")
    1004                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1005                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1007                      .dwendtag $C$DW$T$24
    1008              
    1009              
    1010              $C$DW$T$25      .dwtag  DW_TAG_union_type
    1011                      .dwattr $C$DW$T$25, DW_AT_name("WDCR_REG")
    1012                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE   20

    1013              $C$DW$58        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$58, DW_AT_name("all")
    1016                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
    1017                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1019              $C$DW$59        .dwtag  DW_TAG_member
    1020                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$24)
    1021                      .dwattr $C$DW$59, DW_AT_name("bit")
    1022                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
    1023                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1025                      .dwendtag $C$DW$T$25
    1026              
    1027              
    1028              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1029                      .dwattr $C$DW$T$26, DW_AT_name("WDKEY_BITS")
    1030                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    1031              $C$DW$60        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$60, DW_AT_name("WDKEY")
    1034                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_WDKEY")
    1035                      .dwattr $C$DW$60, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1036                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$61        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$61, DW_AT_name("rsvd1")
    1041                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_rsvd1")
    1042                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1043                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1045                      .dwendtag $C$DW$T$26
    1046              
    1047              
    1048              $C$DW$T$27      .dwtag  DW_TAG_union_type
    1049                      .dwattr $C$DW$T$27, DW_AT_name("WDKEY_REG")
    1050                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1051              $C$DW$62        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$62, DW_AT_name("all")
    1054                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
    1055                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$63        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$26)
    1059                      .dwattr $C$DW$63, DW_AT_name("bit")
    1060                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
    1061                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1063                      .dwendtag $C$DW$T$27
    1064              
    1065              
    1066              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1067                      .dwattr $C$DW$T$28, DW_AT_name("WDWCR_BITS")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE   21

    1068                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1069              $C$DW$64        .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1071                      .dwattr $C$DW$64, DW_AT_name("MIN")
    1072                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_MIN")
    1073                      .dwattr $C$DW$64, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1074                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1076              $C$DW$65        .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1078                      .dwattr $C$DW$65, DW_AT_name("FIRSTKEY")
    1079                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_FIRSTKEY")
    1080                      .dwattr $C$DW$65, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1081                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1083              $C$DW$66        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$66, DW_AT_name("rsvd1")
    1086                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_rsvd1")
    1087                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    1088                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1089                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1090                      .dwendtag $C$DW$T$28
    1091              
    1092              
    1093              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1094                      .dwattr $C$DW$T$29, DW_AT_name("WDWCR_REG")
    1095                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1096              $C$DW$67        .dwtag  DW_TAG_member
    1097                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1098                      .dwattr $C$DW$67, DW_AT_name("all")
    1099                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_all")
    1100                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1101                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1102              $C$DW$68        .dwtag  DW_TAG_member
    1103                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$28)
    1104                      .dwattr $C$DW$68, DW_AT_name("bit")
    1105                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_bit")
    1106                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1107                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1108                      .dwendtag $C$DW$T$29
    1109              
    1110              
    1111              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1112                      .dwattr $C$DW$T$32, DW_AT_name("WD_REGS")
    1113                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x2b)
    1114              $C$DW$69        .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$30)
    1116                      .dwattr $C$DW$69, DW_AT_name("rsvd1")
    1117                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd1")
    1118                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1120              $C$DW$70        .dwtag  DW_TAG_member
    1121                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$21)
    1122                      .dwattr $C$DW$70, DW_AT_name("SCSR")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE   22

    1123                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_SCSR")
    1124                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1125                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1126              $C$DW$71        .dwtag  DW_TAG_member
    1127                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$23)
    1128                      .dwattr $C$DW$71, DW_AT_name("WDCNTR")
    1129                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_WDCNTR")
    1130                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x23]
    1131                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1132              $C$DW$72        .dwtag  DW_TAG_member
    1133                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1134                      .dwattr $C$DW$72, DW_AT_name("rsvd2")
    1135                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd2")
    1136                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1137                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$73        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$27)
    1140                      .dwattr $C$DW$73, DW_AT_name("WDKEY")
    1141                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_WDKEY")
    1142                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x25]
    1143                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$74        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$31)
    1146                      .dwattr $C$DW$74, DW_AT_name("rsvd3")
    1147                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd3")
    1148                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1149                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1150              $C$DW$75        .dwtag  DW_TAG_member
    1151                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$25)
    1152                      .dwattr $C$DW$75, DW_AT_name("WDCR")
    1153                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_WDCR")
    1154                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    1155                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$76        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$29)
    1158                      .dwattr $C$DW$76, DW_AT_name("WDWCR")
    1159                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_WDWCR")
    1160                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1161                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1162                      .dwendtag $C$DW$T$32
    1163              
    1164              $C$DW$77        .dwtag  DW_TAG_TI_far_type
    1165                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$32)
    1166              $C$DW$T$41      .dwtag  DW_TAG_volatile_type
    1167                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$77)
    1168              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1169                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1170                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1171                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1172              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1173                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1174                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1175                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1176              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1177                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:28:17 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1205210                         PAGE   23

    1178                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1179                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1180              $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    1181                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$6)
    1182                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1183              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1184                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1185                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1186                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1187              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1188                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1189                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1190                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1191              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1192                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1193                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1194                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1195              $C$DW$T$43      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1196                      .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$9)
    1197                      .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    1198              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1199                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1200                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1201                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1202              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1203                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1204                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1205                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1206              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    1207                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    1208                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1209              
    1210              $C$DW$T$30      .dwtag  DW_TAG_array_type
    1211                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$19)
    1212                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
