TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:34:08 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("CpuSysRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CpuSysRegs")

    1468                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1469              $C$DW$89        .dwtag  DW_TAG_TI_branch
    1470                      .dwattr $C$DW$89, DW_AT_low_pc(0x00)
    1471                      .dwattr $C$DW$89, DW_AT_TI_return
    1472 000000a9 0006          LRETR     ; [CPU_] 
    1473                      ; return occurs ; [] 
    1474                      .dwattr $C$DW$87, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
    1475                      .dwattr $C$DW$87, DW_AT_TI_end_line(0x142)
    1476                      .dwattr $C$DW$87, DW_AT_TI_end_column(0x01)
    1477                      .dwendentry
    1478                      .dwendtag $C$DW$87
    1479              
    1480 000000aa               .sect   ".text"
    1481                      .global _sysctl_check_trstn_pin_status
    1482              
    1483              $C$DW$90        .dwtag  DW_TAG_subprogram, DW_AT_name("sysctl_check_trstn_pin_status")
    1484                      .dwattr $C$DW$90, DW_AT_low_pc(_sysctl_check_trstn_pin_status)
    1485                      .dwattr $C$DW$90, DW_AT_high_pc(0x00)
    1486                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_sysctl_check_trstn_pin_status")
    1487                      .dwattr $C$DW$90, DW_AT_external
    1488                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$87)
    1489                      .dwattr $C$DW$90, DW_AT_TI_begin_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_boo
    1490                      .dwattr $C$DW$90, DW_AT_TI_begin_line(0x147)
    1491                      .dwattr $C$DW$90, DW_AT_TI_begin_column(0x0a)
    1492                      .dwattr $C$DW$90, DW_AT_TI_max_frame_size(-2)
    1493                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1494              
    1495                      .dwfde $C$DW$CIE, _sysctl_check_trstn_pin_status
    1496              
    1497              ;***************************************************************
    1498              ;* FNAME: _sysctl_check_trstn_pin_status FR SIZE:   0           *
    1499              ;*                                                             *
    1500              ;* FUNCTION ENVIRONMENT                                        *
    1501              ;*                                                             *
    1502              ;* FUNCTION PROPERTIES                                         *
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   29

    1503              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1504              ;***************************************************************
    1505              
    1506 000000aa       _sysctl_check_trstn_pin_status:
    1507                      .dwcfi  cfa_offset, -2
    1508                      .dwcfi  save_reg_to_mem, 26, 0
    1509                      .dwcfi  save_reg_to_reg, 78, 26
    1510                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1511 000000aa 9A00          MOV       AL,#0                 ; [CPU_] |329| 
    1512 000000ab 28A8          MOV       AH,#32768             ; [CPU_] |329| 
         000000ac 8000 
    1513              $C$DW$91        .dwtag  DW_TAG_TI_branch
    1514                      .dwattr $C$DW$91, DW_AT_low_pc(0x00)
    1515                      .dwattr $C$DW$91, DW_AT_name("_sysctl_reset_cause_check")
    1516                      .dwattr $C$DW$91, DW_AT_TI_call
    1517 000000ad 7640'         LCR       #_sysctl_reset_cause_check ; [CPU_] |329| 
         000000ae 000C 
    1518                      ; call occurs [#_sysctl_reset_cause_check] ; [] |329| 
    1519                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_common/so
    1520              $C$DW$92        .dwtag  DW_TAG_TI_branch
    1521                      .dwattr $C$DW$92, DW_AT_low_pc(0x00)
    1522                      .dwattr $C$DW$92, DW_AT_TI_return
    1523 000000af 0006          LRETR     ; [CPU_] 
    1524                      ; return occurs ; [] 
    1525                      .dwattr $C$DW$90, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
    1526                      .dwattr $C$DW$90, DW_AT_TI_end_line(0x14a)
    1527                      .dwattr $C$DW$90, DW_AT_TI_end_column(0x01)
    1528                      .dwendentry
    1529                      .dwendtag $C$DW$90
    1530              
    1531              ;**************************************************************
    1532              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1533              ;**************************************************************
    1534                      .global _CpuSysRegs
    1535              
    1536              ;***************************************************************
    1537              ;* TYPE INFORMATION                                            *
    1538              ;***************************************************************
    1539              
    1540              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1541                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
    1542                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1543              $C$DW$93        .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$93, DW_AT_name("VMAPS")
    1546                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_VMAPS")
    1547                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1548                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$94        .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$94, DW_AT_name("MONPRIV")
    1553                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_MONPRIV")
    1554                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1555                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   30

    1556                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1557              $C$DW$95        .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$95, DW_AT_name("ENPROT")
    1560                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ENPROT")
    1561                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1562                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$96        .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1567                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1568                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1569                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$97        .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$97, DW_AT_name("rsvd2")
    1574                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd2")
    1575                      .dwattr $C$DW$97, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1576                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1577                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1578                      .dwendtag $C$DW$T$20
    1579              
    1580              
    1581              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1582                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
    1583                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1584              $C$DW$98        .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
    1586                      .dwattr $C$DW$98, DW_AT_name("all")
    1587                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_all")
    1588                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1590              $C$DW$99        .dwtag  DW_TAG_member
    1591                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    1592                      .dwattr $C$DW$99, DW_AT_name("bit")
    1593                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_bit")
    1594                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1596                      .dwendtag $C$DW$T$22
    1597              
    1598              
    1599              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1600                      .dwattr $C$DW$T$23, DW_AT_name("CPUSYSLOCK1_BITS")
    1601                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1602              $C$DW$100       .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1604                      .dwattr $C$DW$100, DW_AT_name("HIBBOOTMODE")
    1605                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1606                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1607                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1609              $C$DW$101       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   31

    1611                      .dwattr $C$DW$101, DW_AT_name("IORESTOREADDR")
    1612                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1613                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1614                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1615                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$102       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$102, DW_AT_name("PIEVERRADDR")
    1619                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1620                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1621                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1623              $C$DW$103       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$103, DW_AT_name("PCLKCR0")
    1626                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_PCLKCR0")
    1627                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1628                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1630              $C$DW$104       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1632                      .dwattr $C$DW$104, DW_AT_name("PCLKCR1")
    1633                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PCLKCR1")
    1634                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1635                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$105       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1639                      .dwattr $C$DW$105, DW_AT_name("PCLKCR2")
    1640                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PCLKCR2")
    1641                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1642                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1644              $C$DW$106       .dwtag  DW_TAG_member
    1645                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$106, DW_AT_name("PCLKCR3")
    1647                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PCLKCR3")
    1648                      .dwattr $C$DW$106, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1649                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$107       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$107, DW_AT_name("PCLKCR4")
    1654                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PCLKCR4")
    1655                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1656                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1658              $C$DW$108       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$108, DW_AT_name("PCLKCR5")
    1661                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PCLKCR5")
    1662                      .dwattr $C$DW$108, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1663                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   32

    1666                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$109, DW_AT_name("PCLKCR6")
    1668                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_PCLKCR6")
    1669                      .dwattr $C$DW$109, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1670                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1671                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$110       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$110, DW_AT_name("PCLKCR7")
    1675                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PCLKCR7")
    1676                      .dwattr $C$DW$110, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1677                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1679              $C$DW$111       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$111, DW_AT_name("PCLKCR8")
    1682                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PCLKCR8")
    1683                      .dwattr $C$DW$111, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1684                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1686              $C$DW$112       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$112, DW_AT_name("PCLKCR9")
    1689                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PCLKCR9")
    1690                      .dwattr $C$DW$112, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1691                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$113       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1695                      .dwattr $C$DW$113, DW_AT_name("PCLKCR10")
    1696                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PCLKCR10")
    1697                      .dwattr $C$DW$113, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1698                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1699                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1700              $C$DW$114       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$114, DW_AT_name("PCLKCR11")
    1703                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PCLKCR11")
    1704                      .dwattr $C$DW$114, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1705                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1706                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$115       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$115, DW_AT_name("PCLKCR12")
    1710                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PCLKCR12")
    1711                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1712                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1713                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1714              $C$DW$116       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$116, DW_AT_name("PCLKCR13")
    1717                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PCLKCR13")
    1718                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1719                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1720                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   33

    1721              $C$DW$117       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$117, DW_AT_name("PCLKCR14")
    1724                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PCLKCR14")
    1725                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1726                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1727                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$118       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$118, DW_AT_name("PCLKCR15")
    1731                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PCLKCR15")
    1732                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1733                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1734                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$119       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1737                      .dwattr $C$DW$119, DW_AT_name("PCLKCR16")
    1738                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PCLKCR16")
    1739                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1741                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1742              $C$DW$120       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$120, DW_AT_name("SECMSEL")
    1745                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_SECMSEL")
    1746                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1747                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1748                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$121       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$121, DW_AT_name("LPMCR")
    1752                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_LPMCR")
    1753                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1755                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$122       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1758                      .dwattr $C$DW$122, DW_AT_name("GPIOLPMSEL0")
    1759                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1760                      .dwattr $C$DW$122, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1761                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1762                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$123       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1765                      .dwattr $C$DW$123, DW_AT_name("GPIOLPMSEL1")
    1766                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1767                      .dwattr $C$DW$123, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1768                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1769                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1770              $C$DW$124       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$124, DW_AT_name("rsvd1")
    1773                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd1")
    1774                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1775                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   34

    1776                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1777                      .dwendtag $C$DW$T$23
    1778              
    1779              
    1780              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1781                      .dwattr $C$DW$T$24, DW_AT_name("CPUSYSLOCK1_REG")
    1782                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1783              $C$DW$125       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1785                      .dwattr $C$DW$125, DW_AT_name("all")
    1786                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1787                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$126       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$23)
    1791                      .dwattr $C$DW$126, DW_AT_name("bit")
    1792                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1793                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1794                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1795                      .dwendtag $C$DW$T$24
    1796              
    1797              
    1798              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1799                      .dwattr $C$DW$T$29, DW_AT_name("CPU_SYS_REGS")
    1800                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x82)
    1801              $C$DW$127       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$24)
    1803                      .dwattr $C$DW$127, DW_AT_name("CPUSYSLOCK1")
    1804                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    1805                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$128       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$25)
    1809                      .dwattr $C$DW$128, DW_AT_name("rsvd1")
    1810                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd1")
    1811                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1812                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$129       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    1815                      .dwattr $C$DW$129, DW_AT_name("HIBBOOTMODE")
    1816                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1817                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1818                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$130       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$35)
    1821                      .dwattr $C$DW$130, DW_AT_name("IORESTOREADDR")
    1822                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1823                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1824                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$131       .dwtag  DW_TAG_member
    1826                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$71)
    1827                      .dwattr $C$DW$131, DW_AT_name("PIEVERRADDR")
    1828                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1829                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1830                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   35

    1831              $C$DW$132       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$26)
    1833                      .dwattr $C$DW$132, DW_AT_name("rsvd2")
    1834                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd2")
    1835                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1836                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$133       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$39)
    1839                      .dwattr $C$DW$133, DW_AT_name("PCLKCR0")
    1840                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PCLKCR0")
    1841                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1842                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$134       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$53)
    1845                      .dwattr $C$DW$134, DW_AT_name("PCLKCR1")
    1846                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PCLKCR1")
    1847                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1848                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$135       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$55)
    1851                      .dwattr $C$DW$135, DW_AT_name("PCLKCR2")
    1852                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PCLKCR2")
    1853                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1854                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$136       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$57)
    1857                      .dwattr $C$DW$136, DW_AT_name("PCLKCR3")
    1858                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PCLKCR3")
    1859                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1860                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$137       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$59)
    1863                      .dwattr $C$DW$137, DW_AT_name("PCLKCR4")
    1864                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PCLKCR4")
    1865                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1866                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$138       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$61)
    1869                      .dwattr $C$DW$138, DW_AT_name("PCLKCR5")
    1870                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PCLKCR5")
    1871                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1872                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$139       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$63)
    1875                      .dwattr $C$DW$139, DW_AT_name("PCLKCR6")
    1876                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PCLKCR6")
    1877                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1878                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$140       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$65)
    1881                      .dwattr $C$DW$140, DW_AT_name("PCLKCR7")
    1882                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PCLKCR7")
    1883                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1884                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$141       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   36

    1886                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$67)
    1887                      .dwattr $C$DW$141, DW_AT_name("PCLKCR8")
    1888                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PCLKCR8")
    1889                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1890                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$142       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$69)
    1893                      .dwattr $C$DW$142, DW_AT_name("PCLKCR9")
    1894                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PCLKCR9")
    1895                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1896                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1897              $C$DW$143       .dwtag  DW_TAG_member
    1898                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$41)
    1899                      .dwattr $C$DW$143, DW_AT_name("PCLKCR10")
    1900                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PCLKCR10")
    1901                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1902                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1903              $C$DW$144       .dwtag  DW_TAG_member
    1904                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$43)
    1905                      .dwattr $C$DW$144, DW_AT_name("PCLKCR11")
    1906                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PCLKCR11")
    1907                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1908                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1909              $C$DW$145       .dwtag  DW_TAG_member
    1910                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$45)
    1911                      .dwattr $C$DW$145, DW_AT_name("PCLKCR12")
    1912                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PCLKCR12")
    1913                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1914                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$146       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$47)
    1917                      .dwattr $C$DW$146, DW_AT_name("PCLKCR13")
    1918                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PCLKCR13")
    1919                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1920                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1921              $C$DW$147       .dwtag  DW_TAG_member
    1922                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$49)
    1923                      .dwattr $C$DW$147, DW_AT_name("PCLKCR14")
    1924                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PCLKCR14")
    1925                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1926                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$148       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    1929                      .dwattr $C$DW$148, DW_AT_name("rsvd3")
    1930                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd3")
    1931                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1932                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1933              $C$DW$149       .dwtag  DW_TAG_member
    1934                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$51)
    1935                      .dwattr $C$DW$149, DW_AT_name("PCLKCR16")
    1936                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_PCLKCR16")
    1937                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1938                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$150       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   37

    1941                      .dwattr $C$DW$150, DW_AT_name("rsvd4")
    1942                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd4")
    1943                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1944                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$151       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$22)
    1947                      .dwattr $C$DW$151, DW_AT_name("CCR")
    1948                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_CCR")
    1949                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1950                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1951              $C$DW$152       .dwtag  DW_TAG_member
    1952                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$75)
    1953                      .dwattr $C$DW$152, DW_AT_name("SECMSEL")
    1954                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SECMSEL")
    1955                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1956                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$153       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$37)
    1959                      .dwattr $C$DW$153, DW_AT_name("LPMCR")
    1960                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_LPMCR")
    1961                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1962                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1963              $C$DW$154       .dwtag  DW_TAG_member
    1964                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    1965                      .dwattr $C$DW$154, DW_AT_name("GPIOLPMSEL0")
    1966                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1967                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1968                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1969              $C$DW$155       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$33)
    1971                      .dwattr $C$DW$155, DW_AT_name("GPIOLPMSEL1")
    1972                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1973                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1974                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1975              $C$DW$156       .dwtag  DW_TAG_member
    1976                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$77)
    1977                      .dwattr $C$DW$156, DW_AT_name("TMR2CLKCTL")
    1978                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_TMR2CLKCTL")
    1979                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1980                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$157       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$27)
    1983                      .dwattr $C$DW$157, DW_AT_name("rsvd5")
    1984                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd5")
    1985                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    1986                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1987              $C$DW$158       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$73)
    1989                      .dwattr $C$DW$158, DW_AT_name("RESC")
    1990                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_RESC")
    1991                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1992                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1993                      .dwendtag $C$DW$T$29
    1994              
    1995              $C$DW$159       .dwtag  DW_TAG_TI_far_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   38

    1996                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$29)
    1997              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
    1998                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$159)
    1999              
    2000              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2001                      .dwattr $C$DW$T$30, DW_AT_name("GPIOLPMSEL0_BITS")
    2002                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2003              $C$DW$160       .dwtag  DW_TAG_member
    2004                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2005                      .dwattr $C$DW$160, DW_AT_name("GPIO0")
    2006                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO0")
    2007                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2008                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2009                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2010              $C$DW$161       .dwtag  DW_TAG_member
    2011                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2012                      .dwattr $C$DW$161, DW_AT_name("GPIO1")
    2013                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO1")
    2014                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2015                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2016                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2017              $C$DW$162       .dwtag  DW_TAG_member
    2018                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2019                      .dwattr $C$DW$162, DW_AT_name("GPIO2")
    2020                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO2")
    2021                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2022                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2024              $C$DW$163       .dwtag  DW_TAG_member
    2025                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2026                      .dwattr $C$DW$163, DW_AT_name("GPIO3")
    2027                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO3")
    2028                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2029                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2030                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2031              $C$DW$164       .dwtag  DW_TAG_member
    2032                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2033                      .dwattr $C$DW$164, DW_AT_name("GPIO4")
    2034                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO4")
    2035                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2036                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2037                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2038              $C$DW$165       .dwtag  DW_TAG_member
    2039                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2040                      .dwattr $C$DW$165, DW_AT_name("GPIO5")
    2041                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO5")
    2042                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2043                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2044                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2045              $C$DW$166       .dwtag  DW_TAG_member
    2046                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2047                      .dwattr $C$DW$166, DW_AT_name("GPIO6")
    2048                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO6")
    2049                      .dwattr $C$DW$166, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2050                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   39

    2051                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2052              $C$DW$167       .dwtag  DW_TAG_member
    2053                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2054                      .dwattr $C$DW$167, DW_AT_name("GPIO7")
    2055                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO7")
    2056                      .dwattr $C$DW$167, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2057                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2058                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2059              $C$DW$168       .dwtag  DW_TAG_member
    2060                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2061                      .dwattr $C$DW$168, DW_AT_name("GPIO8")
    2062                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO8")
    2063                      .dwattr $C$DW$168, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2064                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2065                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2066              $C$DW$169       .dwtag  DW_TAG_member
    2067                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2068                      .dwattr $C$DW$169, DW_AT_name("GPIO9")
    2069                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO9")
    2070                      .dwattr $C$DW$169, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2071                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2072                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2073              $C$DW$170       .dwtag  DW_TAG_member
    2074                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2075                      .dwattr $C$DW$170, DW_AT_name("GPIO10")
    2076                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO10")
    2077                      .dwattr $C$DW$170, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2078                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2079                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2080              $C$DW$171       .dwtag  DW_TAG_member
    2081                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2082                      .dwattr $C$DW$171, DW_AT_name("GPIO11")
    2083                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO11")
    2084                      .dwattr $C$DW$171, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2085                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2087              $C$DW$172       .dwtag  DW_TAG_member
    2088                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2089                      .dwattr $C$DW$172, DW_AT_name("GPIO12")
    2090                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO12")
    2091                      .dwattr $C$DW$172, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2092                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2093                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2094              $C$DW$173       .dwtag  DW_TAG_member
    2095                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2096                      .dwattr $C$DW$173, DW_AT_name("GPIO13")
    2097                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO13")
    2098                      .dwattr $C$DW$173, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2099                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2100                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2101              $C$DW$174       .dwtag  DW_TAG_member
    2102                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2103                      .dwattr $C$DW$174, DW_AT_name("GPIO14")
    2104                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO14")
    2105                      .dwattr $C$DW$174, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   40

    2106                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2107                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2108              $C$DW$175       .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$175, DW_AT_name("GPIO15")
    2111                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO15")
    2112                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2113                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2114                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2115              $C$DW$176       .dwtag  DW_TAG_member
    2116                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2117                      .dwattr $C$DW$176, DW_AT_name("GPIO16")
    2118                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO16")
    2119                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2120                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2121                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2122              $C$DW$177       .dwtag  DW_TAG_member
    2123                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2124                      .dwattr $C$DW$177, DW_AT_name("GPIO17")
    2125                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO17")
    2126                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2127                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2128                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2129              $C$DW$178       .dwtag  DW_TAG_member
    2130                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2131                      .dwattr $C$DW$178, DW_AT_name("GPIO18")
    2132                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO18")
    2133                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2134                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2135                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2136              $C$DW$179       .dwtag  DW_TAG_member
    2137                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2138                      .dwattr $C$DW$179, DW_AT_name("GPIO19")
    2139                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO19")
    2140                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2141                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2142                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2143              $C$DW$180       .dwtag  DW_TAG_member
    2144                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2145                      .dwattr $C$DW$180, DW_AT_name("GPIO20")
    2146                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO20")
    2147                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2148                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2149                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2150              $C$DW$181       .dwtag  DW_TAG_member
    2151                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2152                      .dwattr $C$DW$181, DW_AT_name("GPIO21")
    2153                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO21")
    2154                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2155                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2156                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2157              $C$DW$182       .dwtag  DW_TAG_member
    2158                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$182, DW_AT_name("GPIO22")
    2160                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO22")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   41

    2161                      .dwattr $C$DW$182, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2162                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2163                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2164              $C$DW$183       .dwtag  DW_TAG_member
    2165                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2166                      .dwattr $C$DW$183, DW_AT_name("GPIO23")
    2167                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIO23")
    2168                      .dwattr $C$DW$183, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2169                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2170                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2171              $C$DW$184       .dwtag  DW_TAG_member
    2172                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2173                      .dwattr $C$DW$184, DW_AT_name("GPIO24")
    2174                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIO24")
    2175                      .dwattr $C$DW$184, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2176                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2177                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2178              $C$DW$185       .dwtag  DW_TAG_member
    2179                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2180                      .dwattr $C$DW$185, DW_AT_name("GPIO25")
    2181                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO25")
    2182                      .dwattr $C$DW$185, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2183                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2184                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2185              $C$DW$186       .dwtag  DW_TAG_member
    2186                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2187                      .dwattr $C$DW$186, DW_AT_name("GPIO26")
    2188                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO26")
    2189                      .dwattr $C$DW$186, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2190                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2191                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2192              $C$DW$187       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2194                      .dwattr $C$DW$187, DW_AT_name("GPIO27")
    2195                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIO27")
    2196                      .dwattr $C$DW$187, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2197                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2198                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2199              $C$DW$188       .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2201                      .dwattr $C$DW$188, DW_AT_name("GPIO28")
    2202                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIO28")
    2203                      .dwattr $C$DW$188, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2204                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2205                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$189       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$189, DW_AT_name("GPIO29")
    2209                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO29")
    2210                      .dwattr $C$DW$189, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2211                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2212                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2213              $C$DW$190       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2215                      .dwattr $C$DW$190, DW_AT_name("GPIO30")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   42

    2216                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO30")
    2217                      .dwattr $C$DW$190, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2218                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2219                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2220              $C$DW$191       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2222                      .dwattr $C$DW$191, DW_AT_name("GPIO31")
    2223                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO31")
    2224                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2225                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2226                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2227                      .dwendtag $C$DW$T$30
    2228              
    2229              
    2230              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2231                      .dwattr $C$DW$T$31, DW_AT_name("GPIOLPMSEL0_REG")
    2232                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2233              $C$DW$192       .dwtag  DW_TAG_member
    2234                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    2235                      .dwattr $C$DW$192, DW_AT_name("all")
    2236                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_all")
    2237                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2238                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2239              $C$DW$193       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$30)
    2241                      .dwattr $C$DW$193, DW_AT_name("bit")
    2242                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_bit")
    2243                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2245                      .dwendtag $C$DW$T$31
    2246              
    2247              
    2248              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2249                      .dwattr $C$DW$T$32, DW_AT_name("GPIOLPMSEL1_BITS")
    2250                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2251              $C$DW$194       .dwtag  DW_TAG_member
    2252                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2253                      .dwattr $C$DW$194, DW_AT_name("GPIO32")
    2254                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIO32")
    2255                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2256                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2257                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2258              $C$DW$195       .dwtag  DW_TAG_member
    2259                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2260                      .dwattr $C$DW$195, DW_AT_name("GPIO33")
    2261                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO33")
    2262                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2263                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2264                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2265              $C$DW$196       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2267                      .dwattr $C$DW$196, DW_AT_name("GPIO34")
    2268                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO34")
    2269                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2270                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   43

    2271                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2272              $C$DW$197       .dwtag  DW_TAG_member
    2273                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2274                      .dwattr $C$DW$197, DW_AT_name("GPIO35")
    2275                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO35")
    2276                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2277                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2278                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2279              $C$DW$198       .dwtag  DW_TAG_member
    2280                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2281                      .dwattr $C$DW$198, DW_AT_name("GPIO36")
    2282                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIO36")
    2283                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2284                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2285                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2286              $C$DW$199       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2288                      .dwattr $C$DW$199, DW_AT_name("GPIO37")
    2289                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO37")
    2290                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2291                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2292                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2293              $C$DW$200       .dwtag  DW_TAG_member
    2294                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2295                      .dwattr $C$DW$200, DW_AT_name("GPIO38")
    2296                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIO38")
    2297                      .dwattr $C$DW$200, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2298                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2299                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2300              $C$DW$201       .dwtag  DW_TAG_member
    2301                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2302                      .dwattr $C$DW$201, DW_AT_name("GPIO39")
    2303                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIO39")
    2304                      .dwattr $C$DW$201, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2305                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2306                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2307              $C$DW$202       .dwtag  DW_TAG_member
    2308                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2309                      .dwattr $C$DW$202, DW_AT_name("GPIO40")
    2310                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO40")
    2311                      .dwattr $C$DW$202, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2312                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2313                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2314              $C$DW$203       .dwtag  DW_TAG_member
    2315                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2316                      .dwattr $C$DW$203, DW_AT_name("GPIO41")
    2317                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIO41")
    2318                      .dwattr $C$DW$203, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2319                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2320                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2321              $C$DW$204       .dwtag  DW_TAG_member
    2322                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2323                      .dwattr $C$DW$204, DW_AT_name("GPIO42")
    2324                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPIO42")
    2325                      .dwattr $C$DW$204, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   44

    2326                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2327                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2328              $C$DW$205       .dwtag  DW_TAG_member
    2329                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2330                      .dwattr $C$DW$205, DW_AT_name("GPIO43")
    2331                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO43")
    2332                      .dwattr $C$DW$205, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2333                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2334                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2335              $C$DW$206       .dwtag  DW_TAG_member
    2336                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2337                      .dwattr $C$DW$206, DW_AT_name("GPIO44")
    2338                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO44")
    2339                      .dwattr $C$DW$206, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2340                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2341                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2342              $C$DW$207       .dwtag  DW_TAG_member
    2343                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2344                      .dwattr $C$DW$207, DW_AT_name("GPIO45")
    2345                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIO45")
    2346                      .dwattr $C$DW$207, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2347                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2348                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2349              $C$DW$208       .dwtag  DW_TAG_member
    2350                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2351                      .dwattr $C$DW$208, DW_AT_name("GPIO46")
    2352                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIO46")
    2353                      .dwattr $C$DW$208, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2354                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2356              $C$DW$209       .dwtag  DW_TAG_member
    2357                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2358                      .dwattr $C$DW$209, DW_AT_name("GPIO47")
    2359                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIO47")
    2360                      .dwattr $C$DW$209, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2361                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2362                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2363              $C$DW$210       .dwtag  DW_TAG_member
    2364                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2365                      .dwattr $C$DW$210, DW_AT_name("GPIO48")
    2366                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIO48")
    2367                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2368                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2369                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2370              $C$DW$211       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2372                      .dwattr $C$DW$211, DW_AT_name("GPIO49")
    2373                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GPIO49")
    2374                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2375                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2376                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2377              $C$DW$212       .dwtag  DW_TAG_member
    2378                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2379                      .dwattr $C$DW$212, DW_AT_name("GPIO50")
    2380                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GPIO50")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   45

    2381                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2382                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2383                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2384              $C$DW$213       .dwtag  DW_TAG_member
    2385                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2386                      .dwattr $C$DW$213, DW_AT_name("GPIO51")
    2387                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GPIO51")
    2388                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2389                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2390                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2391              $C$DW$214       .dwtag  DW_TAG_member
    2392                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2393                      .dwattr $C$DW$214, DW_AT_name("GPIO52")
    2394                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GPIO52")
    2395                      .dwattr $C$DW$214, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2396                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2397                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2398              $C$DW$215       .dwtag  DW_TAG_member
    2399                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2400                      .dwattr $C$DW$215, DW_AT_name("GPIO53")
    2401                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GPIO53")
    2402                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2403                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2404                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2405              $C$DW$216       .dwtag  DW_TAG_member
    2406                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2407                      .dwattr $C$DW$216, DW_AT_name("GPIO54")
    2408                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GPIO54")
    2409                      .dwattr $C$DW$216, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2410                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2411                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2412              $C$DW$217       .dwtag  DW_TAG_member
    2413                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    2414                      .dwattr $C$DW$217, DW_AT_name("GPIO55")
    2415                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GPIO55")
    2416                      .dwattr $C$DW$217, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2417                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2418                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2419              $C$DW$218       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$218, DW_AT_name("GPIO56")
    2422                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GPIO56")
    2423                      .dwattr $C$DW$218, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2424                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2425                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2426              $C$DW$219       .dwtag  DW_TAG_member
    2427                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    2428                      .dwattr $C$DW$219, DW_AT_name("GPIO57")
    2429                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_GPIO57")
    2430                      .dwattr $C$DW$219, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2431                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2432                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2433              $C$DW$220       .dwtag  DW_TAG_member
    2434                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    2435                      .dwattr $C$DW$220, DW_AT_name("GPIO58")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   46

    2436                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_GPIO58")
    2437                      .dwattr $C$DW$220, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2438                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2439                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2440              $C$DW$221       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    2442                      .dwattr $C$DW$221, DW_AT_name("GPIO59")
    2443                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_GPIO59")
    2444                      .dwattr $C$DW$221, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2445                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2446                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2447              $C$DW$222       .dwtag  DW_TAG_member
    2448                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    2449                      .dwattr $C$DW$222, DW_AT_name("GPIO60")
    2450                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_GPIO60")
    2451                      .dwattr $C$DW$222, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2452                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2453                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2454              $C$DW$223       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2456                      .dwattr $C$DW$223, DW_AT_name("GPIO61")
    2457                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_GPIO61")
    2458                      .dwattr $C$DW$223, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2459                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2460                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2461              $C$DW$224       .dwtag  DW_TAG_member
    2462                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    2463                      .dwattr $C$DW$224, DW_AT_name("GPIO62")
    2464                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_GPIO62")
    2465                      .dwattr $C$DW$224, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2466                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2467                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2468              $C$DW$225       .dwtag  DW_TAG_member
    2469                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    2470                      .dwattr $C$DW$225, DW_AT_name("GPIO63")
    2471                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_GPIO63")
    2472                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2473                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2474                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2475                      .dwendtag $C$DW$T$32
    2476              
    2477              
    2478              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2479                      .dwattr $C$DW$T$33, DW_AT_name("GPIOLPMSEL1_REG")
    2480                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2481              $C$DW$226       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    2483                      .dwattr $C$DW$226, DW_AT_name("all")
    2484                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_all")
    2485                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2486                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2487              $C$DW$227       .dwtag  DW_TAG_member
    2488                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$32)
    2489                      .dwattr $C$DW$227, DW_AT_name("bit")
    2490                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   47

    2491                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2492                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2493                      .dwendtag $C$DW$T$33
    2494              
    2495              
    2496              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2497                      .dwattr $C$DW$T$34, DW_AT_name("IORESTOREADDR_BITS")
    2498                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2499              $C$DW$228       .dwtag  DW_TAG_member
    2500                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$21)
    2501                      .dwattr $C$DW$228, DW_AT_name("ADDR")
    2502                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_ADDR")
    2503                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x16)
    2504                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2505                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$229       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    2508                      .dwattr $C$DW$229, DW_AT_name("rsvd1")
    2509                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_rsvd1")
    2510                      .dwattr $C$DW$229, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2511                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2512                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2513                      .dwendtag $C$DW$T$34
    2514              
    2515              
    2516              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2517                      .dwattr $C$DW$T$35, DW_AT_name("IORESTOREADDR_REG")
    2518                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2519              $C$DW$230       .dwtag  DW_TAG_member
    2520                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$21)
    2521                      .dwattr $C$DW$230, DW_AT_name("all")
    2522                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_all")
    2523                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2524                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2525              $C$DW$231       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$34)
    2527                      .dwattr $C$DW$231, DW_AT_name("bit")
    2528                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_bit")
    2529                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2530                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2531                      .dwendtag $C$DW$T$35
    2532              
    2533              
    2534              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2535                      .dwattr $C$DW$T$36, DW_AT_name("LPMCR_BITS")
    2536                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2537              $C$DW$232       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$232, DW_AT_name("LPM")
    2540                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_LPM")
    2541                      .dwattr $C$DW$232, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2542                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2543                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2544              $C$DW$233       .dwtag  DW_TAG_member
    2545                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   48

    2546                      .dwattr $C$DW$233, DW_AT_name("QUALSTDBY")
    2547                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_QUALSTDBY")
    2548                      .dwattr $C$DW$233, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    2549                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2551              $C$DW$234       .dwtag  DW_TAG_member
    2552                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    2553                      .dwattr $C$DW$234, DW_AT_name("rsvd1")
    2554                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_rsvd1")
    2555                      .dwattr $C$DW$234, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    2556                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2557                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2558              $C$DW$235       .dwtag  DW_TAG_member
    2559                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    2560                      .dwattr $C$DW$235, DW_AT_name("WDINTE")
    2561                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_WDINTE")
    2562                      .dwattr $C$DW$235, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2563                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2564                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2565              $C$DW$236       .dwtag  DW_TAG_member
    2566                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    2567                      .dwattr $C$DW$236, DW_AT_name("M0M1MODE")
    2568                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_M0M1MODE")
    2569                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2570                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2571                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$237       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2574                      .dwattr $C$DW$237, DW_AT_name("rsvd2")
    2575                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd2")
    2576                      .dwattr $C$DW$237, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0d)
    2577                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2578                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2579              $C$DW$238       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2581                      .dwattr $C$DW$238, DW_AT_name("IOISODIS")
    2582                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_IOISODIS")
    2583                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2584                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2585                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2586                      .dwendtag $C$DW$T$36
    2587              
    2588              
    2589              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2590                      .dwattr $C$DW$T$37, DW_AT_name("LPMCR_REG")
    2591                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2592              $C$DW$239       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$21)
    2594                      .dwattr $C$DW$239, DW_AT_name("all")
    2595                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_all")
    2596                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2597                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2598              $C$DW$240       .dwtag  DW_TAG_member
    2599                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$36)
    2600                      .dwattr $C$DW$240, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   49

    2601                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_bit")
    2602                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2603                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2604                      .dwendtag $C$DW$T$37
    2605              
    2606              
    2607              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2608                      .dwattr $C$DW$T$38, DW_AT_name("PCLKCR0_BITS")
    2609                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2610              $C$DW$241       .dwtag  DW_TAG_member
    2611                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2612                      .dwattr $C$DW$241, DW_AT_name("CLA1")
    2613                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_CLA1")
    2614                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2615                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2616                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2617              $C$DW$242       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$242, DW_AT_name("rsvd1")
    2620                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_rsvd1")
    2621                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2622                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2623                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2624              $C$DW$243       .dwtag  DW_TAG_member
    2625                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2626                      .dwattr $C$DW$243, DW_AT_name("DMA")
    2627                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_DMA")
    2628                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2629                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2630                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2631              $C$DW$244       .dwtag  DW_TAG_member
    2632                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2633                      .dwattr $C$DW$244, DW_AT_name("CPUTIMER0")
    2634                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_CPUTIMER0")
    2635                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2636                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2638              $C$DW$245       .dwtag  DW_TAG_member
    2639                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2640                      .dwattr $C$DW$245, DW_AT_name("CPUTIMER1")
    2641                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_CPUTIMER1")
    2642                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2643                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2644                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2645              $C$DW$246       .dwtag  DW_TAG_member
    2646                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2647                      .dwattr $C$DW$246, DW_AT_name("CPUTIMER2")
    2648                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_CPUTIMER2")
    2649                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2650                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2652              $C$DW$247       .dwtag  DW_TAG_member
    2653                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2654                      .dwattr $C$DW$247, DW_AT_name("rsvd2")
    2655                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:34:09 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0725210                         PAGE   50

    2656                      .dwattr $C$DW$247, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2657                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2658                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2659              $C$DW$248       .dwtag  DW_TAG_member
    2660                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2661                      .dwattr $C$DW$248, DW_AT_name("HRPWM")
    2662                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_HRPWM")
    2663                      .dwattr $C$DW$248, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2664                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2665                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2666              $C$DW$249       .dwtag  DW_TAG_member
    2667                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    2668                      .dwattr $C$DW$249, DW_AT_name("rsvd3")
    2669                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_rsvd3")
    2670                      .dwattr $C$DW$249, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2671                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2672                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2673              $C$DW$250       .dwtag  DW_TAG_member
    2674                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2675                      .dwattr $C$DW$250, DW_AT_name("TBCLKSYNC")
    2676                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_TBCLKSYNC")
    2677                      .dwattr $C$DW$250, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
