TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Thu Jan 30 10:33:21 2014                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\bootrom\Boot_ROM\F2837x_bootROM-REVB\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CRCCalcZ2")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CRCCalcZ2")

    3994                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    3995 000005a9 9A00          MOVB      AL,#0                 ; [CPU_] |1699| 
    3996 000005aa 6F16          B         $C$L106,UNC           ; [CPU_] |1699| 
    3997                      ; branch occurs ; [] |1699| 
    3998 000005ab       $C$L105:    
    3999                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4000 000005ab 8A46          MOVL      XAR4,*-SP[6]          ; [CPU_] |1702| 
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   87

    4001 000005ac 8344          MOVL      XAR5,*-SP[4]          ; [CPU_] |1702| 
    4002 000005ad 9241          MOV       AL,*-SP[1]            ; [CPU_] |1702| 
    4003              $C$DW$68        .dwtag  DW_TAG_TI_branch
    4004                      .dwattr $C$DW$68, DW_AT_low_pc(0x00)
    4005                      .dwattr $C$DW$68, DW_AT_name("_CRCCalcZ2")
    4006                      .dwattr $C$DW$68, DW_AT_TI_call
    4007 000005ae 7640!         LCR       #_CRCCalcZ2           ; [CPU_] |1702| 
         000005af 0000 
    4008                      ; call occurs [#_CRCCalcZ2] ; [] |1702| 
    4009 000005b0 964B          MOV       *-SP[11],AL           ; [CPU_] |1702| 
    4010                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4011 000005b1 761F!         MOVW      DP,#_DcsmRegsZ2+34    ; [CPU_U] 
         000005b2 0000 
    4012 000005b3 1822!         AND       @_DcsmRegsZ2+34,#0xfffe ; [CPU_] |1704| 
         000005b4 FFFE 
    4013                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4014 000005b5 0200          MOVB      ACC,#0                ; [CPU_] |1706| 
    4015 000005b6 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |1706| 
    4016                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4017 000005b7 1E46          MOVL      *-SP[6],ACC           ; [CPU_] |1707| 
    4018                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4019 000005b8 2847          MOV       *-SP[7],#65535        ; [CPU_] |1708| 
         000005b9 FFFF 
    4020                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4021 000005ba 2848          MOV       *-SP[8],#65535        ; [CPU_] |1709| 
         000005bb FFFF 
    4022                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4023 000005bc 2849          MOV       *-SP[9],#65535        ; [CPU_] |1710| 
         000005bd FFFF 
    4024                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4025 000005be 2B4A          MOV       *-SP[10],#0           ; [CPU_] |1711| 
    4026                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4027 000005bf 924B          MOV       AL,*-SP[11]           ; [CPU_] |1713| 
    4028 000005c0       $C$L106:    
    4029                      .dwpsn  file "C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootROM_dev/F2837x_bootROM/c
    4030 000005c0 FE8C          SUBB      SP,#12                ; [CPU_U] 
    4031                      .dwcfi  cfa_offset, -2
    4032              $C$DW$69        .dwtag  DW_TAG_TI_branch
    4033                      .dwattr $C$DW$69, DW_AT_low_pc(0x00)
    4034                      .dwattr $C$DW$69, DW_AT_TI_return
    4035 000005c1 0006          LRETR     ; [CPU_] 
    4036                      ; return occurs ; [] 
    4037                      .dwattr $C$DW$56, DW_AT_TI_end_file("C:/work/grepos/bootrom/Boot_ROM/F2837x_bootROM-REVB/F2837x_bootR
    4038                      .dwattr $C$DW$56, DW_AT_TI_end_line(0x6b3)
    4039                      .dwattr $C$DW$56, DW_AT_TI_end_column(0x01)
    4040                      .dwendentry
    4041                      .dwendtag $C$DW$56
    4042              
    4043              ;**************************************************************
    4044              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4045              ;**************************************************************
    4046                      .global _CRCCalcZ2
    4047                      .global _CRCCalcZ1
    4048                      .global _DcsmRegsCommon
    4049                      .global _DcsmRegsZ1
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   88

    4050                      .global _DcsmRegsZ2
    4051              
    4052              ;***************************************************************
    4053              ;* TYPE INFORMATION                                            *
    4054              ;***************************************************************
    4055              
    4056              $C$DW$T$19      .dwtag  DW_TAG_structure_type
    4057                      .dwattr $C$DW$T$19, DW_AT_name("DCSM_REGS_COMMON")
    4058                      .dwattr $C$DW$T$19, DW_AT_byte_size(0x08)
    4059              $C$DW$70        .dwtag  DW_TAG_member
    4060                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$26)
    4061                      .dwattr $C$DW$70, DW_AT_name("FLSEM")
    4062                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_FLSEM")
    4063                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4064                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    4065              $C$DW$71        .dwtag  DW_TAG_member
    4066                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$32)
    4067                      .dwattr $C$DW$71, DW_AT_name("SECTSTAT")
    4068                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_SECTSTAT")
    4069                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4070                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    4071              $C$DW$72        .dwtag  DW_TAG_member
    4072                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$28)
    4073                      .dwattr $C$DW$72, DW_AT_name("RAMSTAT")
    4074                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_RAMSTAT")
    4075                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4076                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    4077              $C$DW$73        .dwtag  DW_TAG_member
    4078                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$30)
    4079                      .dwattr $C$DW$73, DW_AT_name("SECDC")
    4080                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_SECDC")
    4081                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4082                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    4083                      .dwendtag $C$DW$T$19
    4084              
    4085              $C$DW$74        .dwtag  DW_TAG_TI_far_type
    4086                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    4087              $C$DW$T$73      .dwtag  DW_TAG_volatile_type
    4088                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$74)
    4089              
    4090              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    4091                      .dwattr $C$DW$T$23, DW_AT_name("DCSM_REGS_Z1")
    4092                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x24)
    4093              $C$DW$75        .dwtag  DW_TAG_member
    4094                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$50)
    4095                      .dwattr $C$DW$75, DW_AT_name("Z1_LINKPOINTER")
    4096                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_Z1_LINKPOINTER")
    4097                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4098                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    4099              $C$DW$76        .dwtag  DW_TAG_member
    4100                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$52)
    4101                      .dwattr $C$DW$76, DW_AT_name("Z1_OTPSECLOCK")
    4102                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_Z1_OTPSECLOCK")
    4103                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4104                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   89

    4105              $C$DW$77        .dwtag  DW_TAG_member
    4106                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$34)
    4107                      .dwattr $C$DW$77, DW_AT_name("Z1_BOOTCTRL")
    4108                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_Z1_BOOTCTRL")
    4109                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4110                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    4111              $C$DW$78        .dwtag  DW_TAG_member
    4112                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    4113                      .dwattr $C$DW$78, DW_AT_name("Z1_LINKPOINTERERR")
    4114                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_Z1_LINKPOINTERERR")
    4115                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4116                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    4117              $C$DW$79        .dwtag  DW_TAG_member
    4118                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$22)
    4119                      .dwattr $C$DW$79, DW_AT_name("rsvd1")
    4120                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_rsvd1")
    4121                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4122                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    4123              $C$DW$80        .dwtag  DW_TAG_member
    4124                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    4125                      .dwattr $C$DW$80, DW_AT_name("Z1_CSMKEY0")
    4126                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_Z1_CSMKEY0")
    4127                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4128                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    4129              $C$DW$81        .dwtag  DW_TAG_member
    4130                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
    4131                      .dwattr $C$DW$81, DW_AT_name("Z1_CSMKEY1")
    4132                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_Z1_CSMKEY1")
    4133                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4134                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    4135              $C$DW$82        .dwtag  DW_TAG_member
    4136                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
    4137                      .dwattr $C$DW$82, DW_AT_name("Z1_CSMKEY2")
    4138                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_Z1_CSMKEY2")
    4139                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4140                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    4141              $C$DW$83        .dwtag  DW_TAG_member
    4142                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    4143                      .dwattr $C$DW$83, DW_AT_name("Z1_CSMKEY3")
    4144                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_Z1_CSMKEY3")
    4145                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4146                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    4147              $C$DW$84        .dwtag  DW_TAG_member
    4148                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$38)
    4149                      .dwattr $C$DW$84, DW_AT_name("Z1_CSMLOCKSR")
    4150                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_Z1_CSMLOCKSR")
    4151                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4152                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    4153              $C$DW$85        .dwtag  DW_TAG_member
    4154                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$36)
    4155                      .dwattr $C$DW$85, DW_AT_name("Z1_CR")
    4156                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_Z1_CR")
    4157                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4158                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    4159              $C$DW$86        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   90

    4160                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$48)
    4161                      .dwattr $C$DW$86, DW_AT_name("Z1_GRABSECTR")
    4162                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_Z1_GRABSECTR")
    4163                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4164                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    4165              $C$DW$87        .dwtag  DW_TAG_member
    4166                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$46)
    4167                      .dwattr $C$DW$87, DW_AT_name("Z1_GRABRAMR")
    4168                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_Z1_GRABRAMR")
    4169                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4170                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    4171              $C$DW$88        .dwtag  DW_TAG_member
    4172                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$44)
    4173                      .dwattr $C$DW$88, DW_AT_name("Z1_EXEONLYSECTR")
    4174                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_Z1_EXEONLYSECTR")
    4175                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4176                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    4177              $C$DW$89        .dwtag  DW_TAG_member
    4178                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$42)
    4179                      .dwattr $C$DW$89, DW_AT_name("Z1_EXEONLYRAMR")
    4180                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_Z1_EXEONLYRAMR")
    4181                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4182                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    4183              $C$DW$90        .dwtag  DW_TAG_member
    4184                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$40)
    4185                      .dwattr $C$DW$90, DW_AT_name("Z1_EXEONLYDIS")
    4186                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_Z1_EXEONLYDIS")
    4187                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4188                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    4189                      .dwendtag $C$DW$T$23
    4190              
    4191              $C$DW$91        .dwtag  DW_TAG_TI_far_type
    4192                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$23)
    4193              $C$DW$T$74      .dwtag  DW_TAG_volatile_type
    4194                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$91)
    4195              
    4196              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4197                      .dwattr $C$DW$T$24, DW_AT_name("DCSM_REGS_Z2")
    4198                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x24)
    4199              $C$DW$92        .dwtag  DW_TAG_member
    4200                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$70)
    4201                      .dwattr $C$DW$92, DW_AT_name("Z2_LINKPOINTER")
    4202                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_Z2_LINKPOINTER")
    4203                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4204                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    4205              $C$DW$93        .dwtag  DW_TAG_member
    4206                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$72)
    4207                      .dwattr $C$DW$93, DW_AT_name("Z2_OTPSECLOCK")
    4208                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_Z2_OTPSECLOCK")
    4209                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4210                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    4211              $C$DW$94        .dwtag  DW_TAG_member
    4212                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$54)
    4213                      .dwattr $C$DW$94, DW_AT_name("Z2_BOOTCTRL")
    4214                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_Z2_BOOTCTRL")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   91

    4215                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4216                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    4217              $C$DW$95        .dwtag  DW_TAG_member
    4218                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
    4219                      .dwattr $C$DW$95, DW_AT_name("Z2_LINKPOINTERERR")
    4220                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_Z2_LINKPOINTERERR")
    4221                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4222                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    4223              $C$DW$96        .dwtag  DW_TAG_member
    4224                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$22)
    4225                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    4226                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    4227                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4228                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    4229              $C$DW$97        .dwtag  DW_TAG_member
    4230                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
    4231                      .dwattr $C$DW$97, DW_AT_name("Z2_CSMKEY0")
    4232                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Z2_CSMKEY0")
    4233                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4234                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    4235              $C$DW$98        .dwtag  DW_TAG_member
    4236                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
    4237                      .dwattr $C$DW$98, DW_AT_name("Z2_CSMKEY1")
    4238                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Z2_CSMKEY1")
    4239                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4240                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    4241              $C$DW$99        .dwtag  DW_TAG_member
    4242                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
    4243                      .dwattr $C$DW$99, DW_AT_name("Z2_CSMKEY2")
    4244                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Z2_CSMKEY2")
    4245                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4246                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    4247              $C$DW$100       .dwtag  DW_TAG_member
    4248                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
    4249                      .dwattr $C$DW$100, DW_AT_name("Z2_CSMKEY3")
    4250                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_Z2_CSMKEY3")
    4251                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4252                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    4253              $C$DW$101       .dwtag  DW_TAG_member
    4254                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$58)
    4255                      .dwattr $C$DW$101, DW_AT_name("Z2_CSMLOCKSR")
    4256                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_Z2_CSMLOCKSR")
    4257                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4258                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    4259              $C$DW$102       .dwtag  DW_TAG_member
    4260                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$56)
    4261                      .dwattr $C$DW$102, DW_AT_name("Z2_CR")
    4262                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_Z2_CR")
    4263                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    4264                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    4265              $C$DW$103       .dwtag  DW_TAG_member
    4266                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$68)
    4267                      .dwattr $C$DW$103, DW_AT_name("Z2_GRABSECTR")
    4268                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_Z2_GRABSECTR")
    4269                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   92

    4270                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    4271              $C$DW$104       .dwtag  DW_TAG_member
    4272                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$66)
    4273                      .dwattr $C$DW$104, DW_AT_name("Z2_GRABRAMR")
    4274                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_Z2_GRABRAMR")
    4275                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4276                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    4277              $C$DW$105       .dwtag  DW_TAG_member
    4278                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$64)
    4279                      .dwattr $C$DW$105, DW_AT_name("Z2_EXEONLYSECTR")
    4280                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_Z2_EXEONLYSECTR")
    4281                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4282                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    4283              $C$DW$106       .dwtag  DW_TAG_member
    4284                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$62)
    4285                      .dwattr $C$DW$106, DW_AT_name("Z2_EXEONLYRAMR")
    4286                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_Z2_EXEONLYRAMR")
    4287                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4288                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    4289              $C$DW$107       .dwtag  DW_TAG_member
    4290                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$60)
    4291                      .dwattr $C$DW$107, DW_AT_name("Z2_EXEONLYDIS")
    4292                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_Z2_EXEONLYDIS")
    4293                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4294                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    4295                      .dwendtag $C$DW$T$24
    4296              
    4297              $C$DW$108       .dwtag  DW_TAG_TI_far_type
    4298                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$24)
    4299              $C$DW$T$75      .dwtag  DW_TAG_volatile_type
    4300                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$108)
    4301              
    4302              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    4303                      .dwattr $C$DW$T$25, DW_AT_name("FLSEM_BITS")
    4304                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    4305              $C$DW$109       .dwtag  DW_TAG_member
    4306                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
    4307                      .dwattr $C$DW$109, DW_AT_name("SEM")
    4308                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_SEM")
    4309                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    4310                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4311                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    4312              $C$DW$110       .dwtag  DW_TAG_member
    4313                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
    4314                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    4315                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    4316                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    4317                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4318                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    4319              $C$DW$111       .dwtag  DW_TAG_member
    4320                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    4321                      .dwattr $C$DW$111, DW_AT_name("KEY")
    4322                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_KEY")
    4323                      .dwattr $C$DW$111, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4324                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   93

    4325                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    4326              $C$DW$112       .dwtag  DW_TAG_member
    4327                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
    4328                      .dwattr $C$DW$112, DW_AT_name("rsvd2")
    4329                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd2")
    4330                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    4331                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4332                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    4333                      .dwendtag $C$DW$T$25
    4334              
    4335              
    4336              $C$DW$T$26      .dwtag  DW_TAG_union_type
    4337                      .dwattr $C$DW$T$26, DW_AT_name("FLSEM_REG")
    4338                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    4339              $C$DW$113       .dwtag  DW_TAG_member
    4340                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
    4341                      .dwattr $C$DW$113, DW_AT_name("all")
    4342                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    4343                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4344                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    4345              $C$DW$114       .dwtag  DW_TAG_member
    4346                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$25)
    4347                      .dwattr $C$DW$114, DW_AT_name("bit")
    4348                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    4349                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4350                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    4351                      .dwendtag $C$DW$T$26
    4352              
    4353              
    4354              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    4355                      .dwattr $C$DW$T$27, DW_AT_name("RAMSTAT_BITS")
    4356                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    4357              $C$DW$115       .dwtag  DW_TAG_member
    4358                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
    4359                      .dwattr $C$DW$115, DW_AT_name("STATUS_RAM0")
    4360                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_STATUS_RAM0")
    4361                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    4362                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4363                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    4364              $C$DW$116       .dwtag  DW_TAG_member
    4365                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
    4366                      .dwattr $C$DW$116, DW_AT_name("STATUS_RAM1")
    4367                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_STATUS_RAM1")
    4368                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    4369                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4370                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    4371              $C$DW$117       .dwtag  DW_TAG_member
    4372                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    4373                      .dwattr $C$DW$117, DW_AT_name("STATUS_RAM2")
    4374                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_STATUS_RAM2")
    4375                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    4376                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4377                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    4378              $C$DW$118       .dwtag  DW_TAG_member
    4379                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   94

    4380                      .dwattr $C$DW$118, DW_AT_name("STATUS_RAM3")
    4381                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_STATUS_RAM3")
    4382                      .dwattr $C$DW$118, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4383                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4384                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    4385              $C$DW$119       .dwtag  DW_TAG_member
    4386                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$21)
    4387                      .dwattr $C$DW$119, DW_AT_name("STATUS_RAM4")
    4388                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_STATUS_RAM4")
    4389                      .dwattr $C$DW$119, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    4390                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4391                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    4392              $C$DW$120       .dwtag  DW_TAG_member
    4393                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
    4394                      .dwattr $C$DW$120, DW_AT_name("STATUS_RAM5")
    4395                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_STATUS_RAM5")
    4396                      .dwattr $C$DW$120, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    4397                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4398                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    4399              $C$DW$121       .dwtag  DW_TAG_member
    4400                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    4401                      .dwattr $C$DW$121, DW_AT_name("STATUS_RAM6")
    4402                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_STATUS_RAM6")
    4403                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4404                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4405                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    4406              $C$DW$122       .dwtag  DW_TAG_member
    4407                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    4408                      .dwattr $C$DW$122, DW_AT_name("STATUS_RAM7")
    4409                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_STATUS_RAM7")
    4410                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4411                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4412                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    4413              $C$DW$123       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
    4415                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    4416                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    4417                      .dwattr $C$DW$123, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    4418                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4419                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    4420              $C$DW$124       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    4422                      .dwattr $C$DW$124, DW_AT_name("STATUS_CLA1")
    4423                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_STATUS_CLA1")
    4424                      .dwattr $C$DW$124, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4425                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4426                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    4427              $C$DW$125       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    4429                      .dwattr $C$DW$125, DW_AT_name("rsvd2")
    4430                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd2")
    4431                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4432                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4433                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    4434                      .dwendtag $C$DW$T$27
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   95

    4435              
    4436              
    4437              $C$DW$T$28      .dwtag  DW_TAG_union_type
    4438                      .dwattr $C$DW$T$28, DW_AT_name("RAMSTAT_REG")
    4439                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    4440              $C$DW$126       .dwtag  DW_TAG_member
    4441                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    4442                      .dwattr $C$DW$126, DW_AT_name("all")
    4443                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    4444                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4445                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    4446              $C$DW$127       .dwtag  DW_TAG_member
    4447                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$27)
    4448                      .dwattr $C$DW$127, DW_AT_name("bit")
    4449                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    4450                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4451                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    4452                      .dwendtag $C$DW$T$28
    4453              
    4454              
    4455              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    4456                      .dwattr $C$DW$T$29, DW_AT_name("SECDC_BITS")
    4457                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    4458              $C$DW$128       .dwtag  DW_TAG_member
    4459                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    4460                      .dwattr $C$DW$128, DW_AT_name("CPUSLDIS")
    4461                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CPUSLDIS")
    4462                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4463                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4464                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    4465              $C$DW$129       .dwtag  DW_TAG_member
    4466                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    4467                      .dwattr $C$DW$129, DW_AT_name("ECSLDIS")
    4468                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ECSLDIS")
    4469                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4470                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4471                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    4472              $C$DW$130       .dwtag  DW_TAG_member
    4473                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    4474                      .dwattr $C$DW$130, DW_AT_name("FASTSPINEN")
    4475                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_FASTSPINEN")
    4476                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x04)
    4477                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4478                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    4479              $C$DW$131       .dwtag  DW_TAG_member
    4480                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
    4481                      .dwattr $C$DW$131, DW_AT_name("BANK2MAP")
    4482                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_BANK2MAP")
    4483                      .dwattr $C$DW$131, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x04)
    4484                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4485                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    4486              $C$DW$132       .dwtag  DW_TAG_member
    4487                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
    4488                      .dwattr $C$DW$132, DW_AT_name("rsvd1")
    4489                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   96

    4490                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    4491                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4492                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    4493                      .dwendtag $C$DW$T$29
    4494              
    4495              
    4496              $C$DW$T$30      .dwtag  DW_TAG_union_type
    4497                      .dwattr $C$DW$T$30, DW_AT_name("SECDC_REG")
    4498                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    4499              $C$DW$133       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    4501                      .dwattr $C$DW$133, DW_AT_name("all")
    4502                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    4503                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4504                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    4505              $C$DW$134       .dwtag  DW_TAG_member
    4506                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$29)
    4507                      .dwattr $C$DW$134, DW_AT_name("bit")
    4508                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    4509                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4510                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    4511                      .dwendtag $C$DW$T$30
    4512              
    4513              
    4514              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    4515                      .dwattr $C$DW$T$31, DW_AT_name("SECTSTAT_BITS")
    4516                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    4517              $C$DW$135       .dwtag  DW_TAG_member
    4518                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    4519                      .dwattr $C$DW$135, DW_AT_name("STATUS_SECTA")
    4520                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_STATUS_SECTA")
    4521                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    4522                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4523                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    4524              $C$DW$136       .dwtag  DW_TAG_member
    4525                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    4526                      .dwattr $C$DW$136, DW_AT_name("STATUS_SECTB")
    4527                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_STATUS_SECTB")
    4528                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    4529                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4530                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    4531              $C$DW$137       .dwtag  DW_TAG_member
    4532                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
    4533                      .dwattr $C$DW$137, DW_AT_name("STATUS_SECTC")
    4534                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_STATUS_SECTC")
    4535                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    4536                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4537                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    4538              $C$DW$138       .dwtag  DW_TAG_member
    4539                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
    4540                      .dwattr $C$DW$138, DW_AT_name("STATUS_SECTD")
    4541                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_STATUS_SECTD")
    4542                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4543                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4544                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   97

    4545              $C$DW$139       .dwtag  DW_TAG_member
    4546                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    4547                      .dwattr $C$DW$139, DW_AT_name("STATUS_SECTE")
    4548                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_STATUS_SECTE")
    4549                      .dwattr $C$DW$139, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    4550                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4551                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    4552              $C$DW$140       .dwtag  DW_TAG_member
    4553                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    4554                      .dwattr $C$DW$140, DW_AT_name("STATUS_SECTF")
    4555                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_STATUS_SECTF")
    4556                      .dwattr $C$DW$140, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    4557                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4558                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    4559              $C$DW$141       .dwtag  DW_TAG_member
    4560                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
    4561                      .dwattr $C$DW$141, DW_AT_name("STATUS_SECTG")
    4562                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_STATUS_SECTG")
    4563                      .dwattr $C$DW$141, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4564                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4565                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    4566              $C$DW$142       .dwtag  DW_TAG_member
    4567                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    4568                      .dwattr $C$DW$142, DW_AT_name("STATUS_SECTH")
    4569                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_STATUS_SECTH")
    4570                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4571                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4572                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    4573              $C$DW$143       .dwtag  DW_TAG_member
    4574                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    4575                      .dwattr $C$DW$143, DW_AT_name("STATUS_SECTI")
    4576                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_STATUS_SECTI")
    4577                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    4578                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4579                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    4580              $C$DW$144       .dwtag  DW_TAG_member
    4581                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    4582                      .dwattr $C$DW$144, DW_AT_name("STATUS_SECTJ")
    4583                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_STATUS_SECTJ")
    4584                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    4585                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4586                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    4587              $C$DW$145       .dwtag  DW_TAG_member
    4588                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$21)
    4589                      .dwattr $C$DW$145, DW_AT_name("STATUS_SECTK")
    4590                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_STATUS_SECTK")
    4591                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    4592                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4593                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    4594              $C$DW$146       .dwtag  DW_TAG_member
    4595                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    4596                      .dwattr $C$DW$146, DW_AT_name("STATUS_SECTL")
    4597                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_STATUS_SECTL")
    4598                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    4599                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   98

    4600                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    4601              $C$DW$147       .dwtag  DW_TAG_member
    4602                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    4603                      .dwattr $C$DW$147, DW_AT_name("STATUS_SECTM")
    4604                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_STATUS_SECTM")
    4605                      .dwattr $C$DW$147, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    4606                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4607                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    4608              $C$DW$148       .dwtag  DW_TAG_member
    4609                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    4610                      .dwattr $C$DW$148, DW_AT_name("STATUS_SECTN")
    4611                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_STATUS_SECTN")
    4612                      .dwattr $C$DW$148, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    4613                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4614                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    4615              $C$DW$149       .dwtag  DW_TAG_member
    4616                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    4617                      .dwattr $C$DW$149, DW_AT_name("STATUS_BANK2")
    4618                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_STATUS_BANK2")
    4619                      .dwattr $C$DW$149, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    4620                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4621                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    4622              $C$DW$150       .dwtag  DW_TAG_member
    4623                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    4624                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    4625                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    4626                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    4627                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4628                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    4629                      .dwendtag $C$DW$T$31
    4630              
    4631              
    4632              $C$DW$T$32      .dwtag  DW_TAG_union_type
    4633                      .dwattr $C$DW$T$32, DW_AT_name("SECTSTAT_REG")
    4634                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    4635              $C$DW$151       .dwtag  DW_TAG_member
    4636                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$20)
    4637                      .dwattr $C$DW$151, DW_AT_name("all")
    4638                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    4639                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4640                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    4641              $C$DW$152       .dwtag  DW_TAG_member
    4642                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$31)
    4643                      .dwattr $C$DW$152, DW_AT_name("bit")
    4644                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    4645                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4646                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    4647                      .dwendtag $C$DW$T$32
    4648              
    4649              
    4650              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    4651                      .dwattr $C$DW$T$33, DW_AT_name("Z1_BOOTCTRL_BITS")
    4652                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    4653              $C$DW$153       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE   99

    4655                      .dwattr $C$DW$153, DW_AT_name("KEY")
    4656                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_KEY")
    4657                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4658                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4659                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    4660              $C$DW$154       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    4662                      .dwattr $C$DW$154, DW_AT_name("BMODE")
    4663                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_BMODE")
    4664                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4665                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4666                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    4667              $C$DW$155       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    4669                      .dwattr $C$DW$155, DW_AT_name("BOOTPIN0")
    4670                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_BOOTPIN0")
    4671                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    4672                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4673                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    4674              $C$DW$156       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    4676                      .dwattr $C$DW$156, DW_AT_name("BOOTPIN1")
    4677                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_BOOTPIN1")
    4678                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4679                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4680                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    4681                      .dwendtag $C$DW$T$33
    4682              
    4683              
    4684              $C$DW$T$34      .dwtag  DW_TAG_union_type
    4685                      .dwattr $C$DW$T$34, DW_AT_name("Z1_BOOTCTRL_REG")
    4686                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    4687              $C$DW$157       .dwtag  DW_TAG_member
    4688                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    4689                      .dwattr $C$DW$157, DW_AT_name("all")
    4690                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_all")
    4691                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4692                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    4693              $C$DW$158       .dwtag  DW_TAG_member
    4694                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$33)
    4695                      .dwattr $C$DW$158, DW_AT_name("bit")
    4696                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_bit")
    4697                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4698                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    4699                      .dwendtag $C$DW$T$34
    4700              
    4701              
    4702              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    4703                      .dwattr $C$DW$T$35, DW_AT_name("Z1_CR_BITS")
    4704                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    4705              $C$DW$159       .dwtag  DW_TAG_member
    4706                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    4707                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    4708                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    4709                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  100

    4710                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4711                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    4712              $C$DW$160       .dwtag  DW_TAG_member
    4713                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    4714                      .dwattr $C$DW$160, DW_AT_name("ALLZERO")
    4715                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ALLZERO")
    4716                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4717                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4718                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    4719              $C$DW$161       .dwtag  DW_TAG_member
    4720                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    4721                      .dwattr $C$DW$161, DW_AT_name("ALLONE")
    4722                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ALLONE")
    4723                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4724                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4725                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    4726              $C$DW$162       .dwtag  DW_TAG_member
    4727                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    4728                      .dwattr $C$DW$162, DW_AT_name("UNSECURE")
    4729                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_UNSECURE")
    4730                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4731                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4732                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    4733              $C$DW$163       .dwtag  DW_TAG_member
    4734                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    4735                      .dwattr $C$DW$163, DW_AT_name("ARMED")
    4736                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ARMED")
    4737                      .dwattr $C$DW$163, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4738                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4739                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    4740              $C$DW$164       .dwtag  DW_TAG_member
    4741                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    4742                      .dwattr $C$DW$164, DW_AT_name("USBD_OPEN")
    4743                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_USBD_OPEN")
    4744                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4745                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4746                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4747              $C$DW$165       .dwtag  DW_TAG_member
    4748                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    4749                      .dwattr $C$DW$165, DW_AT_name("rsvd2")
    4750                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd2")
    4751                      .dwattr $C$DW$165, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    4752                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4753                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    4754              $C$DW$166       .dwtag  DW_TAG_member
    4755                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    4756                      .dwattr $C$DW$166, DW_AT_name("FORCESEC")
    4757                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_FORCESEC")
    4758                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    4759                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4760                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4761                      .dwendtag $C$DW$T$35
    4762              
    4763              
    4764              $C$DW$T$36      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  101

    4765                      .dwattr $C$DW$T$36, DW_AT_name("Z1_CR_REG")
    4766                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    4767              $C$DW$167       .dwtag  DW_TAG_member
    4768                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    4769                      .dwattr $C$DW$167, DW_AT_name("all")
    4770                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_all")
    4771                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4772                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4773              $C$DW$168       .dwtag  DW_TAG_member
    4774                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$35)
    4775                      .dwattr $C$DW$168, DW_AT_name("bit")
    4776                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_bit")
    4777                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4778                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4779                      .dwendtag $C$DW$T$36
    4780              
    4781              
    4782              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    4783                      .dwattr $C$DW$T$37, DW_AT_name("Z1_CSMLOCKSR_BITS")
    4784                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    4785              $C$DW$169       .dwtag  DW_TAG_member
    4786                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    4787                      .dwattr $C$DW$169, DW_AT_name("LOCK0")
    4788                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_LOCK0")
    4789                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4790                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4791                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4792              $C$DW$170       .dwtag  DW_TAG_member
    4793                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    4794                      .dwattr $C$DW$170, DW_AT_name("LOCK1")
    4795                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_LOCK1")
    4796                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4797                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4798                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4799              $C$DW$171       .dwtag  DW_TAG_member
    4800                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    4801                      .dwattr $C$DW$171, DW_AT_name("LOCK2")
    4802                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_LOCK2")
    4803                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4804                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4805                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4806              $C$DW$172       .dwtag  DW_TAG_member
    4807                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$21)
    4808                      .dwattr $C$DW$172, DW_AT_name("LOCK3")
    4809                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_LOCK3")
    4810                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4811                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4812                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4813              $C$DW$173       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    4815                      .dwattr $C$DW$173, DW_AT_name("rsvd1")
    4816                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd1")
    4817                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    4818                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4819                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  102

    4820                      .dwendtag $C$DW$T$37
    4821              
    4822              
    4823              $C$DW$T$38      .dwtag  DW_TAG_union_type
    4824                      .dwattr $C$DW$T$38, DW_AT_name("Z1_CSMLOCKSR_REG")
    4825                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    4826              $C$DW$174       .dwtag  DW_TAG_member
    4827                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    4828                      .dwattr $C$DW$174, DW_AT_name("all")
    4829                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_all")
    4830                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4831                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4832              $C$DW$175       .dwtag  DW_TAG_member
    4833                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$37)
    4834                      .dwattr $C$DW$175, DW_AT_name("bit")
    4835                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_bit")
    4836                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4837                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4838                      .dwendtag $C$DW$T$38
    4839              
    4840              
    4841              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    4842                      .dwattr $C$DW$T$39, DW_AT_name("Z1_EXEONLYDIS_BITS")
    4843                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    4844              $C$DW$176       .dwtag  DW_TAG_member
    4845                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    4846                      .dwattr $C$DW$176, DW_AT_name("DIS")
    4847                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_DIS")
    4848                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4849                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4850                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4851              $C$DW$177       .dwtag  DW_TAG_member
    4852                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    4853                      .dwattr $C$DW$177, DW_AT_name("rsvd1")
    4854                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd1")
    4855                      .dwattr $C$DW$177, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    4856                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4857                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    4858                      .dwendtag $C$DW$T$39
    4859              
    4860              
    4861              $C$DW$T$40      .dwtag  DW_TAG_union_type
    4862                      .dwattr $C$DW$T$40, DW_AT_name("Z1_EXEONLYDIS_REG")
    4863                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    4864              $C$DW$178       .dwtag  DW_TAG_member
    4865                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    4866                      .dwattr $C$DW$178, DW_AT_name("all")
    4867                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_all")
    4868                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4869                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    4870              $C$DW$179       .dwtag  DW_TAG_member
    4871                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$39)
    4872                      .dwattr $C$DW$179, DW_AT_name("bit")
    4873                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_bit")
    4874                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  103

    4875                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    4876                      .dwendtag $C$DW$T$40
    4877              
    4878              
    4879              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    4880                      .dwattr $C$DW$T$41, DW_AT_name("Z1_EXEONLYRAMR_BITS")
    4881                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    4882              $C$DW$180       .dwtag  DW_TAG_member
    4883                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    4884                      .dwattr $C$DW$180, DW_AT_name("EXEONLY_RAM0")
    4885                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_EXEONLY_RAM0")
    4886                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4887                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4888                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    4889              $C$DW$181       .dwtag  DW_TAG_member
    4890                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    4891                      .dwattr $C$DW$181, DW_AT_name("EXEONLY_RAM1")
    4892                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_EXEONLY_RAM1")
    4893                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4894                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4895                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    4896              $C$DW$182       .dwtag  DW_TAG_member
    4897                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    4898                      .dwattr $C$DW$182, DW_AT_name("EXEONLY_RAM2")
    4899                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_EXEONLY_RAM2")
    4900                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4901                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4902                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    4903              $C$DW$183       .dwtag  DW_TAG_member
    4904                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    4905                      .dwattr $C$DW$183, DW_AT_name("EXEONLY_RAM3")
    4906                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_EXEONLY_RAM3")
    4907                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4908                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4909                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    4910              $C$DW$184       .dwtag  DW_TAG_member
    4911                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    4912                      .dwattr $C$DW$184, DW_AT_name("EXEONLY_RAM4")
    4913                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_EXEONLY_RAM4")
    4914                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4915                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4916                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4917              $C$DW$185       .dwtag  DW_TAG_member
    4918                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
    4919                      .dwattr $C$DW$185, DW_AT_name("EXEONLY_RAM5")
    4920                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_EXEONLY_RAM5")
    4921                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4922                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4923                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    4924              $C$DW$186       .dwtag  DW_TAG_member
    4925                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    4926                      .dwattr $C$DW$186, DW_AT_name("EXEONLY_RAM6")
    4927                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_EXEONLY_RAM6")
    4928                      .dwattr $C$DW$186, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4929                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  104

    4930                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4931              $C$DW$187       .dwtag  DW_TAG_member
    4932                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    4933                      .dwattr $C$DW$187, DW_AT_name("EXEONLY_RAM7")
    4934                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_EXEONLY_RAM7")
    4935                      .dwattr $C$DW$187, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4936                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4937                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4938              $C$DW$188       .dwtag  DW_TAG_member
    4939                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    4940                      .dwattr $C$DW$188, DW_AT_name("rsvd1")
    4941                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd1")
    4942                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4943                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4944                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4945              $C$DW$189       .dwtag  DW_TAG_member
    4946                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    4947                      .dwattr $C$DW$189, DW_AT_name("rsvd2")
    4948                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd2")
    4949                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    4950                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4951                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4952                      .dwendtag $C$DW$T$41
    4953              
    4954              
    4955              $C$DW$T$42      .dwtag  DW_TAG_union_type
    4956                      .dwattr $C$DW$T$42, DW_AT_name("Z1_EXEONLYRAMR_REG")
    4957                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    4958              $C$DW$190       .dwtag  DW_TAG_member
    4959                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$20)
    4960                      .dwattr $C$DW$190, DW_AT_name("all")
    4961                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_all")
    4962                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4963                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4964              $C$DW$191       .dwtag  DW_TAG_member
    4965                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$41)
    4966                      .dwattr $C$DW$191, DW_AT_name("bit")
    4967                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_bit")
    4968                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4969                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    4970                      .dwendtag $C$DW$T$42
    4971              
    4972              
    4973              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4974                      .dwattr $C$DW$T$43, DW_AT_name("Z1_EXEONLYSECTR_BITS")
    4975                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    4976              $C$DW$192       .dwtag  DW_TAG_member
    4977                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    4978                      .dwattr $C$DW$192, DW_AT_name("EXEONLY_SECTA")
    4979                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_EXEONLY_SECTA")
    4980                      .dwattr $C$DW$192, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4981                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4982                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    4983              $C$DW$193       .dwtag  DW_TAG_member
    4984                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  105

    4985                      .dwattr $C$DW$193, DW_AT_name("EXEONLY_SECTB")
    4986                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_EXEONLY_SECTB")
    4987                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4988                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4989                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    4990              $C$DW$194       .dwtag  DW_TAG_member
    4991                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    4992                      .dwattr $C$DW$194, DW_AT_name("EXEONLY_SECTC")
    4993                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_EXEONLY_SECTC")
    4994                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4995                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4996                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    4997              $C$DW$195       .dwtag  DW_TAG_member
    4998                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    4999                      .dwattr $C$DW$195, DW_AT_name("EXEONLY_SECTD")
    5000                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_EXEONLY_SECTD")
    5001                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    5002                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5003                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    5004              $C$DW$196       .dwtag  DW_TAG_member
    5005                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    5006                      .dwattr $C$DW$196, DW_AT_name("EXEONLY_SECTE")
    5007                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_EXEONLY_SECTE")
    5008                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    5009                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5010                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    5011              $C$DW$197       .dwtag  DW_TAG_member
    5012                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    5013                      .dwattr $C$DW$197, DW_AT_name("EXEONLY_SECTF")
    5014                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_EXEONLY_SECTF")
    5015                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    5016                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5017                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    5018              $C$DW$198       .dwtag  DW_TAG_member
    5019                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    5020                      .dwattr $C$DW$198, DW_AT_name("EXEONLY_SECTG")
    5021                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_EXEONLY_SECTG")
    5022                      .dwattr $C$DW$198, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    5023                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5024                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    5025              $C$DW$199       .dwtag  DW_TAG_member
    5026                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    5027                      .dwattr $C$DW$199, DW_AT_name("EXEONLY_SECTH")
    5028                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_EXEONLY_SECTH")
    5029                      .dwattr $C$DW$199, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    5030                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5031                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    5032              $C$DW$200       .dwtag  DW_TAG_member
    5033                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    5034                      .dwattr $C$DW$200, DW_AT_name("EXEONLY_SECTI")
    5035                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_EXEONLY_SECTI")
    5036                      .dwattr $C$DW$200, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    5037                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5038                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    5039              $C$DW$201       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  106

    5040                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    5041                      .dwattr $C$DW$201, DW_AT_name("EXEONLY_SECTJ")
    5042                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_EXEONLY_SECTJ")
    5043                      .dwattr $C$DW$201, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    5044                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5045                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    5046              $C$DW$202       .dwtag  DW_TAG_member
    5047                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    5048                      .dwattr $C$DW$202, DW_AT_name("EXEONLY_SECTK")
    5049                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_EXEONLY_SECTK")
    5050                      .dwattr $C$DW$202, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    5051                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5052                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    5053              $C$DW$203       .dwtag  DW_TAG_member
    5054                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    5055                      .dwattr $C$DW$203, DW_AT_name("EXEONLY_SECTL")
    5056                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_EXEONLY_SECTL")
    5057                      .dwattr $C$DW$203, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    5058                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5059                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    5060              $C$DW$204       .dwtag  DW_TAG_member
    5061                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$21)
    5062                      .dwattr $C$DW$204, DW_AT_name("EXEONLY_SECTM")
    5063                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_EXEONLY_SECTM")
    5064                      .dwattr $C$DW$204, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    5065                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5066                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    5067              $C$DW$205       .dwtag  DW_TAG_member
    5068                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    5069                      .dwattr $C$DW$205, DW_AT_name("EXEONLY_SECTN")
    5070                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_EXEONLY_SECTN")
    5071                      .dwattr $C$DW$205, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    5072                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5073                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    5074              $C$DW$206       .dwtag  DW_TAG_member
    5075                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    5076                      .dwattr $C$DW$206, DW_AT_name("EXEONLY_BANK2")
    5077                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_EXEONLY_BANK2")
    5078                      .dwattr $C$DW$206, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    5079                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5080                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    5081              $C$DW$207       .dwtag  DW_TAG_member
    5082                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    5083                      .dwattr $C$DW$207, DW_AT_name("rsvd1")
    5084                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd1")
    5085                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    5086                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5087                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    5088              $C$DW$208       .dwtag  DW_TAG_member
    5089                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    5090                      .dwattr $C$DW$208, DW_AT_name("rsvd2")
    5091                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_rsvd2")
    5092                      .dwattr $C$DW$208, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    5093                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5094                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  107

    5095                      .dwendtag $C$DW$T$43
    5096              
    5097              
    5098              $C$DW$T$44      .dwtag  DW_TAG_union_type
    5099                      .dwattr $C$DW$T$44, DW_AT_name("Z1_EXEONLYSECTR_REG")
    5100                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    5101              $C$DW$209       .dwtag  DW_TAG_member
    5102                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$20)
    5103                      .dwattr $C$DW$209, DW_AT_name("all")
    5104                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_all")
    5105                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5106                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    5107              $C$DW$210       .dwtag  DW_TAG_member
    5108                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$43)
    5109                      .dwattr $C$DW$210, DW_AT_name("bit")
    5110                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_bit")
    5111                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5112                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    5113                      .dwendtag $C$DW$T$44
    5114              
    5115              
    5116              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    5117                      .dwattr $C$DW$T$45, DW_AT_name("Z1_GRABRAMR_BITS")
    5118                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    5119              $C$DW$211       .dwtag  DW_TAG_member
    5120                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    5121                      .dwattr $C$DW$211, DW_AT_name("GRAB_RAM0")
    5122                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GRAB_RAM0")
    5123                      .dwattr $C$DW$211, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    5124                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5125                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    5126              $C$DW$212       .dwtag  DW_TAG_member
    5127                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$21)
    5128                      .dwattr $C$DW$212, DW_AT_name("GRAB_RAM1")
    5129                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GRAB_RAM1")
    5130                      .dwattr $C$DW$212, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    5131                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5132                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    5133              $C$DW$213       .dwtag  DW_TAG_member
    5134                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    5135                      .dwattr $C$DW$213, DW_AT_name("GRAB_RAM2")
    5136                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GRAB_RAM2")
    5137                      .dwattr $C$DW$213, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    5138                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5139                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    5140              $C$DW$214       .dwtag  DW_TAG_member
    5141                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$21)
    5142                      .dwattr $C$DW$214, DW_AT_name("GRAB_RAM3")
    5143                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GRAB_RAM3")
    5144                      .dwattr $C$DW$214, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    5145                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5146                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    5147              $C$DW$215       .dwtag  DW_TAG_member
    5148                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$21)
    5149                      .dwattr $C$DW$215, DW_AT_name("GRAB_RAM4")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  108

    5150                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GRAB_RAM4")
    5151                      .dwattr $C$DW$215, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    5152                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5153                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    5154              $C$DW$216       .dwtag  DW_TAG_member
    5155                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$21)
    5156                      .dwattr $C$DW$216, DW_AT_name("GRAB_RAM5")
    5157                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_GRAB_RAM5")
    5158                      .dwattr $C$DW$216, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    5159                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5160                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    5161              $C$DW$217       .dwtag  DW_TAG_member
    5162                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$21)
    5163                      .dwattr $C$DW$217, DW_AT_name("GRAB_RAM6")
    5164                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GRAB_RAM6")
    5165                      .dwattr $C$DW$217, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    5166                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5167                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    5168              $C$DW$218       .dwtag  DW_TAG_member
    5169                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$21)
    5170                      .dwattr $C$DW$218, DW_AT_name("GRAB_RAM7")
    5171                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GRAB_RAM7")
    5172                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    5173                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5174                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    5175              $C$DW$219       .dwtag  DW_TAG_member
    5176                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$21)
    5177                      .dwattr $C$DW$219, DW_AT_name("rsvd1")
    5178                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_rsvd1")
    5179                      .dwattr $C$DW$219, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    5180                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5181                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    5182              $C$DW$220       .dwtag  DW_TAG_member
    5183                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    5184                      .dwattr $C$DW$220, DW_AT_name("GRAB_CLA1")
    5185                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_GRAB_CLA1")
    5186                      .dwattr $C$DW$220, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    5187                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5188                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    5189              $C$DW$221       .dwtag  DW_TAG_member
    5190                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    5191                      .dwattr $C$DW$221, DW_AT_name("rsvd2")
    5192                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_rsvd2")
    5193                      .dwattr $C$DW$221, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    5194                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    5195                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    5196                      .dwendtag $C$DW$T$45
    5197              
    5198              
    5199              $C$DW$T$46      .dwtag  DW_TAG_union_type
    5200                      .dwattr $C$DW$T$46, DW_AT_name("Z1_GRABRAMR_REG")
    5201                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    5202              $C$DW$222       .dwtag  DW_TAG_member
    5203                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$20)
    5204                      .dwattr $C$DW$222, DW_AT_name("all")
TMS320C2000 Assembler PC v6.1.3 Thu Jan 30 10:33:25 2014

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0939610                         PAGE  109

    5205                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_all")
    5206                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5207                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    5208              $C$DW$223       .dwtag  DW_TAG_member
    5209                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$45)
    5210                      .dwattr $C$DW$223, DW_AT_name("bit")
    5211                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_bit")
