TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:21 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("c1brom_itrap_isr")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_c1brom_itrap_isr")

    2562                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    2563              $C$DW$142       .dwtag  DW_TAG_TI_branch
    2564                      .dwattr $C$DW$142, DW_AT_low_pc(0x00)
    2565                      .dwattr $C$DW$142, DW_AT_name("_sysctl_wdog_enable")
    2566                      .dwattr $C$DW$142, DW_AT_TI_call
    2567 0000044b 7640!         LCR       #_sysctl_wdog_enable  ; [CPU_] |727| 
         0000044c 0000 
    2568                      ; call occurs [#_sysctl_wdog_enable] ; [] |727| 
    2569 0000044d       $C$L64:    
    2570                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    2571 0000044d 7625     ESTOP0
    2572 0000044e       $C$L65:    
    2573 0000044e       $C$DW$L$_WaitBoot$6$B:
    2574                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
    2575 0000044e 6F00          B         $C$L65,UNC            ; [CPU_] |738| 
    2576                      ; branch occurs ; [] |738| 
    2577              $C$DW$L$_WaitBoot$6$E:
    2578              
    2579              $C$DW$143       .dwtag  DW_TAG_TI_loop
    2580                      .dwattr $C$DW$143, DW_AT_name("C:\\Users\\a0272466\\AppData\\Local\\Temp\\0274410:$C$L65:1:1380659241
    2581                      .dwattr $C$DW$143, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bo
    2582                      .dwattr $C$DW$143, DW_AT_TI_begin_line(0x2e0)
    2583                      .dwattr $C$DW$143, DW_AT_TI_end_line(0x2e2)
    2584              $C$DW$144       .dwtag  DW_TAG_TI_loop_range
    2585                      .dwattr $C$DW$144, DW_AT_low_pc($C$DW$L$_WaitBoot$6$B)
    2586                      .dwattr $C$DW$144, DW_AT_high_pc($C$DW$L$_WaitBoot$6$E)
    2587                      .dwendtag $C$DW$143
    2588              
    2589                      .dwattr $C$DW$140, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boot
    2590                      .dwattr $C$DW$140, DW_AT_TI_end_line(0x2e3)
    2591                      .dwattr $C$DW$140, DW_AT_TI_end_column(0x01)
    2592                      .dwendentry
    2593                      .dwendtag $C$DW$140
    2594              
    2595              ;**************************************************************
    2596              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2597              ;**************************************************************
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   52

    2598                      .global _c1brom_itrap_isr
    2599                      .global _c1brom_c2c1_ipc_int1_isr
    2600                      .global _c1brom_init_pie_control
    2601                      .global _c1brom_init_pie_vect_table
    2602                      .global _c1brom_handle_nmi
    2603                      .global _c1brom_handle_nmi_at_start
    2604                      .global _SelectBootMode
    2605                      .global _sysctl_wdog_enable
    2606                      .global _SCI_Boot
    2607                      .global _iTrap_addr
    2608                      .global _I2C_Boot
    2609                      .global _Parallel_Boot
    2610                      .global _USB_Boot
    2611                      .global _DCAN_Boot
    2612                      .global _SPI_Boot
    2613                      .global _NmiIntruptRegs
    2614                      .global _PieCtrlRegs
    2615                      .global _DcsmRegsZ1
    2616                      .global _DcsmRegsZ2
    2617                      .global _GpioDataRegs
    2618                      .global _ClkCfgRegs
    2619                      .global _AnalogSubsysRegs
    2620                      .global _CpuSysRegs
    2621                      .global _DevCfgRegs
    2622                      .global _FlashCtrlRegs
    2623                      .global _PieVectTable
    2624              
    2625              ;***************************************************************
    2626              ;* TYPE INFORMATION                                            *
    2627              ;***************************************************************
    2628              
    2629              $C$DW$T$464     .dwtag  DW_TAG_enumeration_type
    2630                      .dwattr $C$DW$T$464, DW_AT_byte_size(0x01)
    2631              $C$DW$145       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_STATUS_INVALID"), DW_AT_const_value(0x00)
    2632              $C$DW$146       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_PENDING"), DW_AT_const_value(0x01)
    2633              $C$DW$147       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_SUCCESS"), DW_AT_const_value(0x02)
    2634              $C$DW$148       .dwtag  DW_TAG_enumerator, DW_AT_name("COMMAND_COMPLETE_FAILURE"), DW_AT_const_value(0x03)
    2635                      .dwendtag $C$DW$T$464
    2636              
    2637              $C$DW$T$465     .dwtag  DW_TAG_typedef, DW_AT_name("command_status_t")
    2638                      .dwattr $C$DW$T$465, DW_AT_type(*$C$DW$T$464)
    2639                      .dwattr $C$DW$T$465, DW_AT_language(DW_LANG_C)
    2640              
    2641              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    2642                      .dwattr $C$DW$T$23, DW_AT_name("ANALOG_SUBSYS_REGS")
    2643                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x66)
    2644              $C$DW$149       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    2646                      .dwattr $C$DW$149, DW_AT_name("rsvd1")
    2647                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd1")
    2648                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$150       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$221)
    2652                      .dwattr $C$DW$150, DW_AT_name("INTOSC1TRIM")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   53

    2653                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2654                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2655                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2656              $C$DW$151       .dwtag  DW_TAG_member
    2657                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$225)
    2658                      .dwattr $C$DW$151, DW_AT_name("INTOSC2TRIM")
    2659                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2660                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2661                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2662              $C$DW$152       .dwtag  DW_TAG_member
    2663                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    2664                      .dwattr $C$DW$152, DW_AT_name("INTERNALTESTCTL")
    2665                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_INTERNALTESTCTL")
    2666                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2667                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2668              $C$DW$153       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$411)
    2670                      .dwattr $C$DW$153, DW_AT_name("TSNSCTL")
    2671                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_TSNSCTL")
    2672                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2673                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2674              $C$DW$154       .dwtag  DW_TAG_member
    2675                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$25)
    2676                      .dwattr $C$DW$154, DW_AT_name("ANAREFCTL")
    2677                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ANAREFCTL")
    2678                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2679                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2680              $C$DW$155       .dwtag  DW_TAG_member
    2681                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$415)
    2682                      .dwattr $C$DW$155, DW_AT_name("VMONCTL")
    2683                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_VMONCTL")
    2684                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2685                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2686              $C$DW$156       .dwtag  DW_TAG_member
    2687                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$417)
    2688                      .dwattr $C$DW$156, DW_AT_name("VMONSTS")
    2689                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_VMONSTS")
    2690                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    2691                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2692              $C$DW$157       .dwtag  DW_TAG_member
    2693                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$413)
    2694                      .dwattr $C$DW$157, DW_AT_name("VMONCLR")
    2695                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_VMONCLR")
    2696                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2697                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2698              $C$DW$158       .dwtag  DW_TAG_member
    2699                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$419)
    2700                      .dwattr $C$DW$158, DW_AT_name("VREGCTL")
    2701                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_VREGCTL")
    2702                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x2b]
    2703                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2704              $C$DW$159       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$229)
    2706                      .dwattr $C$DW$159, DW_AT_name("LOCK")
    2707                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_LOCK")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   54

    2708                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2709                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2710              $C$DW$160       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$219)
    2712                      .dwattr $C$DW$160, DW_AT_name("INTOSC1CSR")
    2713                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_INTOSC1CSR")
    2714                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2715                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$161       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$223)
    2718                      .dwattr $C$DW$161, DW_AT_name("INTOSC2CSR")
    2719                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_INTOSC2CSR")
    2720                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2721                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2722              $C$DW$162       .dwtag  DW_TAG_member
    2723                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2724                      .dwattr $C$DW$162, DW_AT_name("TSNSCFG")
    2725                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_TSNSCFG")
    2726                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2727                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2728              $C$DW$163       .dwtag  DW_TAG_member
    2729                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$250)
    2730                      .dwattr $C$DW$163, DW_AT_name("OSCREFTRIM")
    2731                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_OSCREFTRIM")
    2732                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2733                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2734              $C$DW$164       .dwtag  DW_TAG_member
    2735                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$27)
    2736                      .dwattr $C$DW$164, DW_AT_name("ANAREFTRIM1")
    2737                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ANAREFTRIM1")
    2738                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2739                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2740              $C$DW$165       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$29)
    2742                      .dwattr $C$DW$165, DW_AT_name("ANAREFTRIM2")
    2743                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ANAREFTRIM2")
    2744                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2745                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2746              $C$DW$166       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$31)
    2748                      .dwattr $C$DW$166, DW_AT_name("ANAREFTRIM3")
    2749                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ANAREFTRIM3")
    2750                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2751                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2752              $C$DW$167       .dwtag  DW_TAG_member
    2753                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$33)
    2754                      .dwattr $C$DW$167, DW_AT_name("ANAREFTRIM4")
    2755                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ANAREFTRIM4")
    2756                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2757                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2758              $C$DW$168       .dwtag  DW_TAG_member
    2759                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$351)
    2760                      .dwattr $C$DW$168, DW_AT_name("PMMREFTRIM")
    2761                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PMMREFTRIM")
    2762                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   55

    2763                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2764              $C$DW$169       .dwtag  DW_TAG_member
    2765                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$355)
    2766                      .dwattr $C$DW$169, DW_AT_name("PMMVREGTRIM")
    2767                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PMMVREGTRIM")
    2768                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2769                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2770              $C$DW$170       .dwtag  DW_TAG_member
    2771                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$353)
    2772                      .dwattr $C$DW$170, DW_AT_name("PMMVMONTRIM")
    2773                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PMMVMONTRIM")
    2774                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    2775                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2776              $C$DW$171       .dwtag  DW_TAG_member
    2777                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$349)
    2778                      .dwattr $C$DW$171, DW_AT_name("PMMCSR")
    2779                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PMMCSR")
    2780                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    2781                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$172       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$407)
    2784                      .dwattr $C$DW$172, DW_AT_name("TESTANACTL")
    2785                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_TESTANACTL")
    2786                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    2787                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2788              $C$DW$173       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    2790                      .dwattr $C$DW$173, DW_AT_name("rsvd")
    2791                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd")
    2792                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    2793                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2794                      .dwendtag $C$DW$T$23
    2795              
    2796              $C$DW$174       .dwtag  DW_TAG_TI_far_type
    2797                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$23)
    2798              $C$DW$T$468     .dwtag  DW_TAG_volatile_type
    2799                      .dwattr $C$DW$T$468, DW_AT_type(*$C$DW$174)
    2800              
    2801              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2802                      .dwattr $C$DW$T$24, DW_AT_name("ANAREFCTL_BITS")
    2803                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    2804              $C$DW$175       .dwtag  DW_TAG_member
    2805                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2806                      .dwattr $C$DW$175, DW_AT_name("ANAREF1SEL")
    2807                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ANAREF1SEL")
    2808                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2809                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2810                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2811              $C$DW$176       .dwtag  DW_TAG_member
    2812                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2813                      .dwattr $C$DW$176, DW_AT_name("ANAREF2SEL")
    2814                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ANAREF2SEL")
    2815                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2816                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2817                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   56

    2818              $C$DW$177       .dwtag  DW_TAG_member
    2819                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2820                      .dwattr $C$DW$177, DW_AT_name("ANAREF3SEL")
    2821                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ANAREF3SEL")
    2822                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2823                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2824                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2825              $C$DW$178       .dwtag  DW_TAG_member
    2826                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2827                      .dwattr $C$DW$178, DW_AT_name("ANAREF4SEL")
    2828                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ANAREF4SEL")
    2829                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2830                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2831                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2832              $C$DW$179       .dwtag  DW_TAG_member
    2833                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2834                      .dwattr $C$DW$179, DW_AT_name("rsvd1")
    2835                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd1")
    2836                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2837                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2838                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2839                      .dwendtag $C$DW$T$24
    2840              
    2841              
    2842              $C$DW$T$25      .dwtag  DW_TAG_union_type
    2843                      .dwattr $C$DW$T$25, DW_AT_name("ANAREFCTL_REG")
    2844                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2845              $C$DW$180       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2847                      .dwattr $C$DW$180, DW_AT_name("all")
    2848                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_all")
    2849                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2850                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2851              $C$DW$181       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$24)
    2853                      .dwattr $C$DW$181, DW_AT_name("bit")
    2854                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_bit")
    2855                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2856                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2857                      .dwendtag $C$DW$T$25
    2858              
    2859              
    2860              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2861                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIM1_BITS")
    2862                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2863              $C$DW$182       .dwtag  DW_TAG_member
    2864                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2865                      .dwattr $C$DW$182, DW_AT_name("BGVALTRIM")
    2866                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_BGVALTRIM")
    2867                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2868                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2869                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2870              $C$DW$183       .dwtag  DW_TAG_member
    2871                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2872                      .dwattr $C$DW$183, DW_AT_name("BGSLOPETRIM")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   57

    2873                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2874                      .dwattr $C$DW$183, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    2875                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2876                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2877              $C$DW$184       .dwtag  DW_TAG_member
    2878                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2879                      .dwattr $C$DW$184, DW_AT_name("IREFTRIM")
    2880                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_IREFTRIM")
    2881                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    2882                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2883                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2884              $C$DW$185       .dwtag  DW_TAG_member
    2885                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2886                      .dwattr $C$DW$185, DW_AT_name("CONFIG")
    2887                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CONFIG")
    2888                      .dwattr $C$DW$185, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2889                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2890                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2891              $C$DW$186       .dwtag  DW_TAG_member
    2892                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2893                      .dwattr $C$DW$186, DW_AT_name("rsvd1")
    2894                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd1")
    2895                      .dwattr $C$DW$186, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2896                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2897                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2898                      .dwendtag $C$DW$T$26
    2899              
    2900              
    2901              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2902                      .dwattr $C$DW$T$27, DW_AT_name("ANAREFTRIM1_REG")
    2903                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    2904              $C$DW$187       .dwtag  DW_TAG_member
    2905                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    2906                      .dwattr $C$DW$187, DW_AT_name("all")
    2907                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_all")
    2908                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2909                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2910              $C$DW$188       .dwtag  DW_TAG_member
    2911                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$26)
    2912                      .dwattr $C$DW$188, DW_AT_name("bit")
    2913                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_bit")
    2914                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2915                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2916                      .dwendtag $C$DW$T$27
    2917              
    2918              
    2919              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2920                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIM2_BITS")
    2921                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2922              $C$DW$189       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2924                      .dwattr $C$DW$189, DW_AT_name("BGVALTRIM")
    2925                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_BGVALTRIM")
    2926                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2927                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   58

    2928                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2929              $C$DW$190       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2931                      .dwattr $C$DW$190, DW_AT_name("BGSLOPETRIM")
    2932                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2933                      .dwattr $C$DW$190, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    2934                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2935                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2936              $C$DW$191       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2938                      .dwattr $C$DW$191, DW_AT_name("IREFTRIM")
    2939                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_IREFTRIM")
    2940                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    2941                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2942                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2943              $C$DW$192       .dwtag  DW_TAG_member
    2944                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2945                      .dwattr $C$DW$192, DW_AT_name("CONFIG")
    2946                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_CONFIG")
    2947                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2948                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2949                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2950              $C$DW$193       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2952                      .dwattr $C$DW$193, DW_AT_name("rsvd1")
    2953                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd1")
    2954                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2955                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2956                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2957                      .dwendtag $C$DW$T$28
    2958              
    2959              
    2960              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2961                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIM2_REG")
    2962                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2963              $C$DW$194       .dwtag  DW_TAG_member
    2964                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    2965                      .dwattr $C$DW$194, DW_AT_name("all")
    2966                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    2967                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2968                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2969              $C$DW$195       .dwtag  DW_TAG_member
    2970                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$28)
    2971                      .dwattr $C$DW$195, DW_AT_name("bit")
    2972                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    2973                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2974                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2975                      .dwendtag $C$DW$T$29
    2976              
    2977              
    2978              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2979                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIM3_BITS")
    2980                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2981              $C$DW$196       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   59

    2983                      .dwattr $C$DW$196, DW_AT_name("BGVALTRIM")
    2984                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_BGVALTRIM")
    2985                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    2986                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2987                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2988              $C$DW$197       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2990                      .dwattr $C$DW$197, DW_AT_name("BGSLOPETRIM")
    2991                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2992                      .dwattr $C$DW$197, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    2993                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2994                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2995              $C$DW$198       .dwtag  DW_TAG_member
    2996                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2997                      .dwattr $C$DW$198, DW_AT_name("IREFTRIM")
    2998                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_IREFTRIM")
    2999                      .dwattr $C$DW$198, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    3000                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3001                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3002              $C$DW$199       .dwtag  DW_TAG_member
    3003                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3004                      .dwattr $C$DW$199, DW_AT_name("CONFIG")
    3005                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CONFIG")
    3006                      .dwattr $C$DW$199, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3007                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3008                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3009              $C$DW$200       .dwtag  DW_TAG_member
    3010                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3011                      .dwattr $C$DW$200, DW_AT_name("rsvd1")
    3012                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd1")
    3013                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3014                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3015                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3016                      .dwendtag $C$DW$T$30
    3017              
    3018              
    3019              $C$DW$T$31      .dwtag  DW_TAG_union_type
    3020                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIM3_REG")
    3021                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    3022              $C$DW$201       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    3024                      .dwattr $C$DW$201, DW_AT_name("all")
    3025                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    3026                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3027                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3028              $C$DW$202       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$30)
    3030                      .dwattr $C$DW$202, DW_AT_name("bit")
    3031                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    3032                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3033                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3034                      .dwendtag $C$DW$T$31
    3035              
    3036              
    3037              $C$DW$T$32      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   60

    3038                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIM4_BITS")
    3039                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    3040              $C$DW$203       .dwtag  DW_TAG_member
    3041                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3042                      .dwattr $C$DW$203, DW_AT_name("BGVALTRIM")
    3043                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_BGVALTRIM")
    3044                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x06)
    3045                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3046                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3047              $C$DW$204       .dwtag  DW_TAG_member
    3048                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3049                      .dwattr $C$DW$204, DW_AT_name("BGSLOPETRIM")
    3050                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    3051                      .dwattr $C$DW$204, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x05)
    3052                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3053                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3054              $C$DW$205       .dwtag  DW_TAG_member
    3055                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3056                      .dwattr $C$DW$205, DW_AT_name("IREFTRIM")
    3057                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_IREFTRIM")
    3058                      .dwattr $C$DW$205, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
    3059                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3060                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3061              $C$DW$206       .dwtag  DW_TAG_member
    3062                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3063                      .dwattr $C$DW$206, DW_AT_name("CONFIG")
    3064                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_CONFIG")
    3065                      .dwattr $C$DW$206, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3066                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3067                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3068              $C$DW$207       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3070                      .dwattr $C$DW$207, DW_AT_name("rsvd1")
    3071                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_rsvd1")
    3072                      .dwattr $C$DW$207, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3073                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3074                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3075                      .dwendtag $C$DW$T$32
    3076              
    3077              
    3078              $C$DW$T$33      .dwtag  DW_TAG_union_type
    3079                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIM4_REG")
    3080                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    3081              $C$DW$208       .dwtag  DW_TAG_member
    3082                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$21)
    3083                      .dwattr $C$DW$208, DW_AT_name("all")
    3084                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_all")
    3085                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3086                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3087              $C$DW$209       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$32)
    3089                      .dwattr $C$DW$209, DW_AT_name("bit")
    3090                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_bit")
    3091                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3092                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   61

    3093                      .dwendtag $C$DW$T$33
    3094              
    3095              
    3096              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3097                      .dwattr $C$DW$T$34, DW_AT_name("AUXCLKDIVSEL_BITS")
    3098                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    3099              $C$DW$210       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3101                      .dwattr $C$DW$210, DW_AT_name("AUXPLLDIV")
    3102                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_AUXPLLDIV")
    3103                      .dwattr $C$DW$210, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3104                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3105                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3106              $C$DW$211       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3108                      .dwattr $C$DW$211, DW_AT_name("rsvd1")
    3109                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd1")
    3110                      .dwattr $C$DW$211, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3111                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3112                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3113              $C$DW$212       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3115                      .dwattr $C$DW$212, DW_AT_name("rsvd2")
    3116                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_rsvd2")
    3117                      .dwattr $C$DW$212, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3118                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3119                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3120                      .dwendtag $C$DW$T$34
    3121              
    3122              
    3123              $C$DW$T$35      .dwtag  DW_TAG_union_type
    3124                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_REG")
    3125                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    3126              $C$DW$213       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    3128                      .dwattr $C$DW$213, DW_AT_name("all")
    3129                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_all")
    3130                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3131                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3132              $C$DW$214       .dwtag  DW_TAG_member
    3133                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$34)
    3134                      .dwattr $C$DW$214, DW_AT_name("bit")
    3135                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_bit")
    3136                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3137                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3138                      .dwendtag $C$DW$T$35
    3139              
    3140              
    3141              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3142                      .dwattr $C$DW$T$36, DW_AT_name("AUXPLLCTL1_BITS")
    3143                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    3144              $C$DW$215       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    3146                      .dwattr $C$DW$215, DW_AT_name("PLLEN")
    3147                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_PLLEN")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   62

    3148                      .dwattr $C$DW$215, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3149                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3150                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3151              $C$DW$216       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3153                      .dwattr $C$DW$216, DW_AT_name("PLLCLKEN")
    3154                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_PLLCLKEN")
    3155                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3156                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3157                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3158              $C$DW$217       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3160                      .dwattr $C$DW$217, DW_AT_name("rsvd1")
    3161                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd1")
    3162                      .dwattr $C$DW$217, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3163                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3164                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$218       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3167                      .dwattr $C$DW$218, DW_AT_name("rsvd2")
    3168                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_rsvd2")
    3169                      .dwattr $C$DW$218, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3170                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3171                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3172                      .dwendtag $C$DW$T$36
    3173              
    3174              
    3175              $C$DW$T$37      .dwtag  DW_TAG_union_type
    3176                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_REG")
    3177                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    3178              $C$DW$219       .dwtag  DW_TAG_member
    3179                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$21)
    3180                      .dwattr $C$DW$219, DW_AT_name("all")
    3181                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_all")
    3182                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3183                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3184              $C$DW$220       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$36)
    3186                      .dwattr $C$DW$220, DW_AT_name("bit")
    3187                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_bit")
    3188                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3189                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3190                      .dwendtag $C$DW$T$37
    3191              
    3192              
    3193              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3194                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLMULT_BITS")
    3195                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    3196              $C$DW$221       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3198                      .dwattr $C$DW$221, DW_AT_name("IMULT")
    3199                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_IMULT")
    3200                      .dwattr $C$DW$221, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
    3201                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3202                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   63

    3203              $C$DW$222       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3205                      .dwattr $C$DW$222, DW_AT_name("rsvd1")
    3206                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_rsvd1")
    3207                      .dwattr $C$DW$222, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3208                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3209                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3210              $C$DW$223       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3212                      .dwattr $C$DW$223, DW_AT_name("FMULT")
    3213                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_FMULT")
    3214                      .dwattr $C$DW$223, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3215                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3216                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3217              $C$DW$224       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3219                      .dwattr $C$DW$224, DW_AT_name("rsvd2")
    3220                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_rsvd2")
    3221                      .dwattr $C$DW$224, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    3222                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3223                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3224              $C$DW$225       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3226                      .dwattr $C$DW$225, DW_AT_name("rsvd3")
    3227                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_rsvd3")
    3228                      .dwattr $C$DW$225, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3229                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3230                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3231                      .dwendtag $C$DW$T$38
    3232              
    3233              
    3234              $C$DW$T$39      .dwtag  DW_TAG_union_type
    3235                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_REG")
    3236                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    3237              $C$DW$226       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    3239                      .dwattr $C$DW$226, DW_AT_name("all")
    3240                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_all")
    3241                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3242                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3243              $C$DW$227       .dwtag  DW_TAG_member
    3244                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$38)
    3245                      .dwattr $C$DW$227, DW_AT_name("bit")
    3246                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_bit")
    3247                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3248                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3249                      .dwendtag $C$DW$T$39
    3250              
    3251              
    3252              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3253                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLSTS_BITS")
    3254                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    3255              $C$DW$228       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    3257                      .dwattr $C$DW$228, DW_AT_name("LOCKS")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   64

    3258                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_LOCKS")
    3259                      .dwattr $C$DW$228, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3260                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3261                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3262              $C$DW$229       .dwtag  DW_TAG_member
    3263                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3264                      .dwattr $C$DW$229, DW_AT_name("SLIPS")
    3265                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_SLIPS")
    3266                      .dwattr $C$DW$229, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3267                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3268                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3269              $C$DW$230       .dwtag  DW_TAG_member
    3270                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3271                      .dwattr $C$DW$230, DW_AT_name("rsvd1")
    3272                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_rsvd1")
    3273                      .dwattr $C$DW$230, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3274                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3275                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3276              $C$DW$231       .dwtag  DW_TAG_member
    3277                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3278                      .dwattr $C$DW$231, DW_AT_name("rsvd2")
    3279                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_rsvd2")
    3280                      .dwattr $C$DW$231, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3281                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3282                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3283                      .dwendtag $C$DW$T$40
    3284              
    3285              
    3286              $C$DW$T$41      .dwtag  DW_TAG_union_type
    3287                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_REG")
    3288                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    3289              $C$DW$232       .dwtag  DW_TAG_member
    3290                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$21)
    3291                      .dwattr $C$DW$232, DW_AT_name("all")
    3292                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_all")
    3293                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3294                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3295              $C$DW$233       .dwtag  DW_TAG_member
    3296                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$40)
    3297                      .dwattr $C$DW$233, DW_AT_name("bit")
    3298                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_bit")
    3299                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3300                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3301                      .dwendtag $C$DW$T$41
    3302              
    3303              
    3304              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    3305                      .dwattr $C$DW$T$42, DW_AT_name("CCR_BITS")
    3306                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    3307              $C$DW$234       .dwtag  DW_TAG_member
    3308                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$19)
    3309                      .dwattr $C$DW$234, DW_AT_name("VMAPS")
    3310                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_VMAPS")
    3311                      .dwattr $C$DW$234, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3312                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   65

    3313                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3314              $C$DW$235       .dwtag  DW_TAG_member
    3315                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    3316                      .dwattr $C$DW$235, DW_AT_name("MONPRIV")
    3317                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_MONPRIV")
    3318                      .dwattr $C$DW$235, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3319                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3320                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3321              $C$DW$236       .dwtag  DW_TAG_member
    3322                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3323                      .dwattr $C$DW$236, DW_AT_name("ENPROT")
    3324                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_ENPROT")
    3325                      .dwattr $C$DW$236, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3326                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3327                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3328              $C$DW$237       .dwtag  DW_TAG_member
    3329                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3330                      .dwattr $C$DW$237, DW_AT_name("rsvd1")
    3331                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_rsvd1")
    3332                      .dwattr $C$DW$237, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    3333                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3334                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3335              $C$DW$238       .dwtag  DW_TAG_member
    3336                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3337                      .dwattr $C$DW$238, DW_AT_name("rsvd2")
    3338                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_rsvd2")
    3339                      .dwattr $C$DW$238, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3340                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3341                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3342                      .dwendtag $C$DW$T$42
    3343              
    3344              
    3345              $C$DW$T$43      .dwtag  DW_TAG_union_type
    3346                      .dwattr $C$DW$T$43, DW_AT_name("CCR_REG")
    3347                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    3348              $C$DW$239       .dwtag  DW_TAG_member
    3349                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$21)
    3350                      .dwattr $C$DW$239, DW_AT_name("all")
    3351                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_all")
    3352                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3353                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3354              $C$DW$240       .dwtag  DW_TAG_member
    3355                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$42)
    3356                      .dwattr $C$DW$240, DW_AT_name("bit")
    3357                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_bit")
    3358                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3359                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3360                      .dwendtag $C$DW$T$43
    3361              
    3362              
    3363              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3364                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_BITS")
    3365                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    3366              $C$DW$241       .dwtag  DW_TAG_member
    3367                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   66

    3368                      .dwattr $C$DW$241, DW_AT_name("CLKSRCCTL1")
    3369                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3370                      .dwattr $C$DW$241, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    3371                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3372                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3373              $C$DW$242       .dwtag  DW_TAG_member
    3374                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3375                      .dwattr $C$DW$242, DW_AT_name("CLKSRCCTL2")
    3376                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3377                      .dwattr $C$DW$242, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    3378                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3379                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3380              $C$DW$243       .dwtag  DW_TAG_member
    3381                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3382                      .dwattr $C$DW$243, DW_AT_name("CLKSRCCTL3")
    3383                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3384                      .dwattr $C$DW$243, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3385                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3386                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3387              $C$DW$244       .dwtag  DW_TAG_member
    3388                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3389                      .dwattr $C$DW$244, DW_AT_name("SYSPLLCTL1")
    3390                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3391                      .dwattr $C$DW$244, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3392                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3393                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3394              $C$DW$245       .dwtag  DW_TAG_member
    3395                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3396                      .dwattr $C$DW$245, DW_AT_name("SYSPLLCTL2")
    3397                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    3398                      .dwattr $C$DW$245, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3399                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3400                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3401              $C$DW$246       .dwtag  DW_TAG_member
    3402                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    3403                      .dwattr $C$DW$246, DW_AT_name("SYSPLLCTL3")
    3404                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    3405                      .dwattr $C$DW$246, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3406                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3407                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3408              $C$DW$247       .dwtag  DW_TAG_member
    3409                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    3410                      .dwattr $C$DW$247, DW_AT_name("SYSPLLMULT")
    3411                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3412                      .dwattr $C$DW$247, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    3413                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3414                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3415              $C$DW$248       .dwtag  DW_TAG_member
    3416                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3417                      .dwattr $C$DW$248, DW_AT_name("AUXPLLCTL1")
    3418                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3419                      .dwattr $C$DW$248, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    3420                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3421                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3422              $C$DW$249       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   67

    3423                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3424                      .dwattr $C$DW$249, DW_AT_name("rsvd1")
    3425                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_rsvd1")
    3426                      .dwattr $C$DW$249, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3427                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3428                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3429              $C$DW$250       .dwtag  DW_TAG_member
    3430                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    3431                      .dwattr $C$DW$250, DW_AT_name("AUXPLLMULT")
    3432                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3433                      .dwattr $C$DW$250, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    3434                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3435                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3436              $C$DW$251       .dwtag  DW_TAG_member
    3437                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3438                      .dwattr $C$DW$251, DW_AT_name("SYSCLKDIVSEL")
    3439                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3440                      .dwattr $C$DW$251, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    3441                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3442                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3443              $C$DW$252       .dwtag  DW_TAG_member
    3444                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$19)
    3445                      .dwattr $C$DW$252, DW_AT_name("AUXCLKDIVSEL")
    3446                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    3447                      .dwattr $C$DW$252, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    3448                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3449                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3450              $C$DW$253       .dwtag  DW_TAG_member
    3451                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3452                      .dwattr $C$DW$253, DW_AT_name("PERCLKDIVSEL")
    3453                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3454                      .dwattr $C$DW$253, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    3455                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3456                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3457              $C$DW$254       .dwtag  DW_TAG_member
    3458                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$19)
    3459                      .dwattr $C$DW$254, DW_AT_name("rsvd2")
    3460                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_rsvd2")
    3461                      .dwattr $C$DW$254, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    3462                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3463                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3464              $C$DW$255       .dwtag  DW_TAG_member
    3465                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$19)
    3466                      .dwattr $C$DW$255, DW_AT_name("LOSPCP")
    3467                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_LOSPCP")
    3468                      .dwattr $C$DW$255, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    3469                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3470                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3471              $C$DW$256       .dwtag  DW_TAG_member
    3472                      .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$19)
    3473                      .dwattr $C$DW$256, DW_AT_name("rsvd3")
    3474                      .dwattr $C$DW$256, DW_AT_TI_symbol_name("_rsvd3")
    3475                      .dwattr $C$DW$256, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3476                      .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3477                      .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   68

    3478                      .dwendtag $C$DW$T$44
    3479              
    3480              
    3481              $C$DW$T$45      .dwtag  DW_TAG_union_type
    3482                      .dwattr $C$DW$T$45, DW_AT_name("CLKCFGLOCK1_REG")
    3483                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    3484              $C$DW$257       .dwtag  DW_TAG_member
    3485                      .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$21)
    3486                      .dwattr $C$DW$257, DW_AT_name("all")
    3487                      .dwattr $C$DW$257, DW_AT_TI_symbol_name("_all")
    3488                      .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3489                      .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3490              $C$DW$258       .dwtag  DW_TAG_member
    3491                      .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$44)
    3492                      .dwattr $C$DW$258, DW_AT_name("bit")
    3493                      .dwattr $C$DW$258, DW_AT_TI_symbol_name("_bit")
    3494                      .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3495                      .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3496                      .dwendtag $C$DW$T$45
    3497              
    3498              
    3499              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3500                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_BITS")
    3501                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3502              $C$DW$259       .dwtag  DW_TAG_member
    3503                      .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3504                      .dwattr $C$DW$259, DW_AT_name("SEM")
    3505                      .dwattr $C$DW$259, DW_AT_TI_symbol_name("_SEM")
    3506                      .dwattr $C$DW$259, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3507                      .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3508                      .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3509              $C$DW$260       .dwtag  DW_TAG_member
    3510                      .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$19)
    3511                      .dwattr $C$DW$260, DW_AT_name("rsvd1")
    3512                      .dwattr $C$DW$260, DW_AT_TI_symbol_name("_rsvd1")
    3513                      .dwattr $C$DW$260, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    3514                      .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3515                      .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3516              $C$DW$261       .dwtag  DW_TAG_member
    3517                      .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3518                      .dwattr $C$DW$261, DW_AT_name("KEY")
    3519                      .dwattr $C$DW$261, DW_AT_TI_symbol_name("_KEY")
    3520                      .dwattr $C$DW$261, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3521                      .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3522                      .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3523                      .dwendtag $C$DW$T$46
    3524              
    3525              
    3526              $C$DW$T$47      .dwtag  DW_TAG_union_type
    3527                      .dwattr $C$DW$T$47, DW_AT_name("CLKSEM_REG")
    3528                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3529              $C$DW$262       .dwtag  DW_TAG_member
    3530                      .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$21)
    3531                      .dwattr $C$DW$262, DW_AT_name("all")
    3532                      .dwattr $C$DW$262, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   69

    3533                      .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3534                      .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3535              $C$DW$263       .dwtag  DW_TAG_member
    3536                      .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$46)
    3537                      .dwattr $C$DW$263, DW_AT_name("bit")
    3538                      .dwattr $C$DW$263, DW_AT_TI_symbol_name("_bit")
    3539                      .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3540                      .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3541                      .dwendtag $C$DW$T$47
    3542              
    3543              
    3544              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3545                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_BITS")
    3546                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3547              $C$DW$264       .dwtag  DW_TAG_member
    3548                      .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3549                      .dwattr $C$DW$264, DW_AT_name("OSCCLKSRCSEL")
    3550                      .dwattr $C$DW$264, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    3551                      .dwattr $C$DW$264, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3552                      .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3553                      .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3554              $C$DW$265       .dwtag  DW_TAG_member
    3555                      .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3556                      .dwattr $C$DW$265, DW_AT_name("rsvd1")
    3557                      .dwattr $C$DW$265, DW_AT_TI_symbol_name("_rsvd1")
    3558                      .dwattr $C$DW$265, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    3559                      .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3560                      .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3561              $C$DW$266       .dwtag  DW_TAG_member
    3562                      .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3563                      .dwattr $C$DW$266, DW_AT_name("INTOSC2OFF")
    3564                      .dwattr $C$DW$266, DW_AT_TI_symbol_name("_INTOSC2OFF")
    3565                      .dwattr $C$DW$266, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    3566                      .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3567                      .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3568              $C$DW$267       .dwtag  DW_TAG_member
    3569                      .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3570                      .dwattr $C$DW$267, DW_AT_name("XTALOFF")
    3571                      .dwattr $C$DW$267, DW_AT_TI_symbol_name("_XTALOFF")
    3572                      .dwattr $C$DW$267, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    3573                      .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3574                      .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3575              $C$DW$268       .dwtag  DW_TAG_member
    3576                      .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3577                      .dwattr $C$DW$268, DW_AT_name("WDHALTI")
    3578                      .dwattr $C$DW$268, DW_AT_TI_symbol_name("_WDHALTI")
    3579                      .dwattr $C$DW$268, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    3580                      .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3581                      .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3582              $C$DW$269       .dwtag  DW_TAG_member
    3583                      .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3584                      .dwattr $C$DW$269, DW_AT_name("rsvd2")
    3585                      .dwattr $C$DW$269, DW_AT_TI_symbol_name("_rsvd2")
    3586                      .dwattr $C$DW$269, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    3587                      .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   70

    3588                      .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3589              $C$DW$270       .dwtag  DW_TAG_member
    3590                      .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$19)
    3591                      .dwattr $C$DW$270, DW_AT_name("rsvd3")
    3592                      .dwattr $C$DW$270, DW_AT_TI_symbol_name("_rsvd3")
    3593                      .dwattr $C$DW$270, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3594                      .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3595                      .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3596                      .dwendtag $C$DW$T$48
    3597              
    3598              
    3599              $C$DW$T$49      .dwtag  DW_TAG_union_type
    3600                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL1_REG")
    3601                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    3602              $C$DW$271       .dwtag  DW_TAG_member
    3603                      .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$21)
    3604                      .dwattr $C$DW$271, DW_AT_name("all")
    3605                      .dwattr $C$DW$271, DW_AT_TI_symbol_name("_all")
    3606                      .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3607                      .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3608              $C$DW$272       .dwtag  DW_TAG_member
    3609                      .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$48)
    3610                      .dwattr $C$DW$272, DW_AT_name("bit")
    3611                      .dwattr $C$DW$272, DW_AT_TI_symbol_name("_bit")
    3612                      .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3613                      .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3614                      .dwendtag $C$DW$T$49
    3615              
    3616              
    3617              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3618                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_BITS")
    3619                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3620              $C$DW$273       .dwtag  DW_TAG_member
    3621                      .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    3622                      .dwattr $C$DW$273, DW_AT_name("AUXOSCCLKSRCSEL")
    3623                      .dwattr $C$DW$273, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    3624                      .dwattr $C$DW$273, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3625                      .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3626                      .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3627              $C$DW$274       .dwtag  DW_TAG_member
    3628                      .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3629                      .dwattr $C$DW$274, DW_AT_name("CANABCLKSEL")
    3630                      .dwattr $C$DW$274, DW_AT_TI_symbol_name("_CANABCLKSEL")
    3631                      .dwattr $C$DW$274, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3632                      .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3633                      .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3634              $C$DW$275       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
    3636                      .dwattr $C$DW$275, DW_AT_name("CANBBCLKSEL")
    3637                      .dwattr $C$DW$275, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    3638                      .dwattr $C$DW$275, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    3639                      .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3640                      .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3641              $C$DW$276       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   71

    3643                      .dwattr $C$DW$276, DW_AT_name("rsvd1")
    3644                      .dwattr $C$DW$276, DW_AT_TI_symbol_name("_rsvd1")
    3645                      .dwattr $C$DW$276, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    3646                      .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3647                      .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3648              $C$DW$277       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3650                      .dwattr $C$DW$277, DW_AT_name("rsvd2")
    3651                      .dwattr $C$DW$277, DW_AT_TI_symbol_name("_rsvd2")
    3652                      .dwattr $C$DW$277, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    3653                      .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3654                      .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3655                      .dwendtag $C$DW$T$50
    3656              
    3657              
    3658              $C$DW$T$51      .dwtag  DW_TAG_union_type
    3659                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL2_REG")
    3660                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3661              $C$DW$278       .dwtag  DW_TAG_member
    3662                      .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$21)
    3663                      .dwattr $C$DW$278, DW_AT_name("all")
    3664                      .dwattr $C$DW$278, DW_AT_TI_symbol_name("_all")
    3665                      .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3666                      .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3667              $C$DW$279       .dwtag  DW_TAG_member
    3668                      .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$50)
    3669                      .dwattr $C$DW$279, DW_AT_name("bit")
    3670                      .dwattr $C$DW$279, DW_AT_TI_symbol_name("_bit")
    3671                      .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3672                      .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3673                      .dwendtag $C$DW$T$51
    3674              
    3675              
    3676              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3677                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_BITS")
    3678                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3679              $C$DW$280       .dwtag  DW_TAG_member
    3680                      .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    3681                      .dwattr $C$DW$280, DW_AT_name("XCLKOUTSEL")
    3682                      .dwattr $C$DW$280, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3683                      .dwattr $C$DW$280, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    3684                      .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3685                      .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3686              $C$DW$281       .dwtag  DW_TAG_member
    3687                      .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    3688                      .dwattr $C$DW$281, DW_AT_name("rsvd1")
    3689                      .dwattr $C$DW$281, DW_AT_TI_symbol_name("_rsvd1")
    3690                      .dwattr $C$DW$281, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    3691                      .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3692                      .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3693              $C$DW$282       .dwtag  DW_TAG_member
    3694                      .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    3695                      .dwattr $C$DW$282, DW_AT_name("rsvd2")
    3696                      .dwattr $C$DW$282, DW_AT_TI_symbol_name("_rsvd2")
    3697                      .dwattr $C$DW$282, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   72

    3698                      .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3699                      .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3700                      .dwendtag $C$DW$T$52
    3701              
    3702              
    3703              $C$DW$T$53      .dwtag  DW_TAG_union_type
    3704                      .dwattr $C$DW$T$53, DW_AT_name("CLKSRCCTL3_REG")
    3705                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    3706              $C$DW$283       .dwtag  DW_TAG_member
    3707                      .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$21)
    3708                      .dwattr $C$DW$283, DW_AT_name("all")
    3709                      .dwattr $C$DW$283, DW_AT_TI_symbol_name("_all")
    3710                      .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3711                      .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3712              $C$DW$284       .dwtag  DW_TAG_member
    3713                      .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$52)
    3714                      .dwattr $C$DW$284, DW_AT_name("bit")
    3715                      .dwattr $C$DW$284, DW_AT_TI_symbol_name("_bit")
    3716                      .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3717                      .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3718                      .dwendtag $C$DW$T$53
    3719              
    3720              
    3721              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3722                      .dwattr $C$DW$T$56, DW_AT_name("CLK_CFG_REGS")
    3723                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x32)
    3724              $C$DW$285       .dwtag  DW_TAG_member
    3725                      .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$47)
    3726                      .dwattr $C$DW$285, DW_AT_name("CLKSEM")
    3727                      .dwattr $C$DW$285, DW_AT_TI_symbol_name("_CLKSEM")
    3728                      .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3729                      .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3730              $C$DW$286       .dwtag  DW_TAG_member
    3731                      .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$45)
    3732                      .dwattr $C$DW$286, DW_AT_name("CLKCFGLOCK1")
    3733                      .dwattr $C$DW$286, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3734                      .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3735                      .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3736              $C$DW$287       .dwtag  DW_TAG_member
    3737                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$54)
    3738                      .dwattr $C$DW$287, DW_AT_name("rsvd1")
    3739                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_rsvd1")
    3740                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3741                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3742              $C$DW$288       .dwtag  DW_TAG_member
    3743                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$49)
    3744                      .dwattr $C$DW$288, DW_AT_name("CLKSRCCTL1")
    3745                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3746                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3747                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3748              $C$DW$289       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$51)
    3750                      .dwattr $C$DW$289, DW_AT_name("CLKSRCCTL2")
    3751                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3752                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   73

    3753                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3754              $C$DW$290       .dwtag  DW_TAG_member
    3755                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$53)
    3756                      .dwattr $C$DW$290, DW_AT_name("CLKSRCCTL3")
    3757                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3758                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3759                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3760              $C$DW$291       .dwtag  DW_TAG_member
    3761                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$397)
    3762                      .dwattr $C$DW$291, DW_AT_name("SYSPLLCTL1")
    3763                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3764                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3765                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3766              $C$DW$292       .dwtag  DW_TAG_member
    3767                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$399)
    3768                      .dwattr $C$DW$292, DW_AT_name("SYSPLLCTL2")
    3769                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    3770                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3771                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3772              $C$DW$293       .dwtag  DW_TAG_member
    3773                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$401)
    3774                      .dwattr $C$DW$293, DW_AT_name("SYSPLLCTL3")
    3775                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    3776                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3777                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3778              $C$DW$294       .dwtag  DW_TAG_member
    3779                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$403)
    3780                      .dwattr $C$DW$294, DW_AT_name("SYSPLLMULT")
    3781                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3782                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3783                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3784              $C$DW$295       .dwtag  DW_TAG_member
    3785                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$405)
    3786                      .dwattr $C$DW$295, DW_AT_name("SYSPLLSTS")
    3787                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3788                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3789                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3790              $C$DW$296       .dwtag  DW_TAG_member
    3791                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$37)
    3792                      .dwattr $C$DW$296, DW_AT_name("AUXPLLCTL1")
    3793                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3794                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3795                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3796              $C$DW$297       .dwtag  DW_TAG_member
    3797                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$54)
    3798                      .dwattr $C$DW$297, DW_AT_name("rsvd2")
    3799                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_rsvd2")
    3800                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3801                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3802              $C$DW$298       .dwtag  DW_TAG_member
    3803                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$39)
    3804                      .dwattr $C$DW$298, DW_AT_name("AUXPLLMULT")
    3805                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3806                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3807                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:22 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0274410                         PAGE   74

    3808              $C$DW$299       .dwtag  DW_TAG_member
    3809                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$41)
    3810                      .dwattr $C$DW$299, DW_AT_name("AUXPLLSTS")
    3811                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3812                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
