TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:14 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   13

     616                      .dwendentry
     617                      .dwendtag $C$DW$44
     618              
     619 000000b0               .sect   ".text"
     620                      .global _I2C_Pinmux_Option2
     621              
     622              $C$DW$46        .dwtag  DW_TAG_subprogram, DW_AT_name("I2C_Pinmux_Option2")
     623                      .dwattr $C$DW$46, DW_AT_low_pc(_I2C_Pinmux_Option2)
     624                      .dwattr $C$DW$46, DW_AT_high_pc(0x00)
     625                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_I2C_Pinmux_Option2")
     626                      .dwattr $C$DW$46, DW_AT_external
     627                      .dwattr $C$DW$46, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     628                      .dwattr $C$DW$46, DW_AT_TI_begin_line(0x136)
     629                      .dwattr $C$DW$46, DW_AT_TI_begin_column(0x06)
     630                      .dwattr $C$DW$46, DW_AT_TI_max_frame_size(-2)
     631                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     632              
     633                      .dwfde $C$DW$CIE, _I2C_Pinmux_Option2
     634              
     635              ;***************************************************************
     636              ;* FNAME: _I2C_Pinmux_Option2           FR SIZE:   0           *
     637              ;*                                                             *
     638              ;* FUNCTION ENVIRONMENT                                        *
     639              ;*                                                             *
     640              ;* FUNCTION PROPERTIES                                         *
     641              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     642              ;***************************************************************
     643              
     644 000000b0       _I2C_Pinmux_Option2:
     645                      .dwcfi  cfa_offset, -2
     646                      .dwcfi  save_reg_to_mem, 26, 0
     647                      .dwcfi  save_reg_to_reg, 78, 26
     648                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     649 000000b0 7622   EALLOW
     650                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     651 000000b1 761F!         MOVW      DP,#_GpioCtrlRegs+76  ; [CPU_U] 
         000000b2 0001 
     652 000000b3 180C!         AND       @_GpioCtrlRegs+76,#65532 ; [CPU_] |313| 
         000000b4 FFFC 
     653                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     654 000000b5 1A06!         OR        @_GpioCtrlRegs+70,#5  ; [CPU_] |315| 
         000000b6 0005 
     655                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     656 000000b7 1A02!         OR        @_GpioCtrlRegs+66,#15 ; [CPU_] |317| 
         000000b8 000F 
     657                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     658 000000b9 761A   EDIS
     659                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     660 000000ba FF69          SPM       #0                    ; [CPU_] 
     661              $C$DW$47        .dwtag  DW_TAG_TI_branch
     662                      .dwattr $C$DW$47, DW_AT_low_pc(0x00)
     663                      .dwattr $C$DW$47, DW_AT_TI_return
     664 000000bb 0006          LRETR     ; [CPU_] 
     665                      ; return occurs ; [] 
     666                      .dwattr $C$DW$46, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   14

     667                      .dwattr $C$DW$46, DW_AT_TI_end_line(0x14b)
     668                      .dwattr $C$DW$46, DW_AT_TI_end_column(0x01)
     669                      .dwendentry
     670                      .dwendtag $C$DW$46
     671              
     672              ;**************************************************************
     673              ;* UNDEFINED EXTERNAL REFERENCES                              *
     674              ;**************************************************************
     675                      .global _CopyData
     676                      .global _GetWordData
     677                      .global _GetLongData
     678                      .global _I2caRegs
     679                      .global _CpuSysRegs
     680                      .global _DevCfgRegs
     681                      .global _GpioCtrlRegs
     682              
     683              ;***************************************************************
     684              ;* TYPE INFORMATION                                            *
     685              ;***************************************************************
     686              
     687              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     688                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
     689                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     690              $C$DW$48        .dwtag  DW_TAG_member
     691                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     692                      .dwattr $C$DW$48, DW_AT_name("VMAPS")
     693                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_VMAPS")
     694                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     695                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     696                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$49        .dwtag  DW_TAG_member
     698                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     699                      .dwattr $C$DW$49, DW_AT_name("MONPRIV")
     700                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_MONPRIV")
     701                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     702                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     703                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     704              $C$DW$50        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$50, DW_AT_name("ENPROT")
     707                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_ENPROT")
     708                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     709                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     710                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     711              $C$DW$51        .dwtag  DW_TAG_member
     712                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     713                      .dwattr $C$DW$51, DW_AT_name("rsvd1")
     714                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_rsvd1")
     715                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     716                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     717                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     718              $C$DW$52        .dwtag  DW_TAG_member
     719                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     720                      .dwattr $C$DW$52, DW_AT_name("rsvd2")
     721                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   15

     722                      .dwattr $C$DW$52, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     723                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     724                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     725                      .dwendtag $C$DW$T$20
     726              
     727              
     728              $C$DW$T$22      .dwtag  DW_TAG_union_type
     729                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
     730                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     731              $C$DW$53        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     733                      .dwattr $C$DW$53, DW_AT_name("all")
     734                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_all")
     735                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     737              $C$DW$54        .dwtag  DW_TAG_member
     738                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$20)
     739                      .dwattr $C$DW$54, DW_AT_name("bit")
     740                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_bit")
     741                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     742                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     743                      .dwendtag $C$DW$T$22
     744              
     745              
     746              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     747                      .dwattr $C$DW$T$23, DW_AT_name("CPU2RESCTL_BITS")
     748                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     749              $C$DW$55        .dwtag  DW_TAG_member
     750                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     751                      .dwattr $C$DW$55, DW_AT_name("RESET")
     752                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_RESET")
     753                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     754                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     756              $C$DW$56        .dwtag  DW_TAG_member
     757                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     758                      .dwattr $C$DW$56, DW_AT_name("rsvd1")
     759                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd1")
     760                      .dwattr $C$DW$56, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     761                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     763              $C$DW$57        .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     765                      .dwattr $C$DW$57, DW_AT_name("KEY")
     766                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_KEY")
     767                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     768                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     769                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     770                      .dwendtag $C$DW$T$23
     771              
     772              
     773              $C$DW$T$24      .dwtag  DW_TAG_union_type
     774                      .dwattr $C$DW$T$24, DW_AT_name("CPU2RESCTL_REG")
     775                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     776              $C$DW$58        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   16

     777                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$21)
     778                      .dwattr $C$DW$58, DW_AT_name("all")
     779                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     780                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     782              $C$DW$59        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$23)
     784                      .dwattr $C$DW$59, DW_AT_name("bit")
     785                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
     786                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     788                      .dwendtag $C$DW$T$24
     789              
     790              
     791              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     792                      .dwattr $C$DW$T$25, DW_AT_name("CPUSEL0_BITS")
     793                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     794              $C$DW$60        .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     796                      .dwattr $C$DW$60, DW_AT_name("EPWM1")
     797                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_EPWM1")
     798                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     799                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     800                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     801              $C$DW$61        .dwtag  DW_TAG_member
     802                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     803                      .dwattr $C$DW$61, DW_AT_name("EPWM2")
     804                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_EPWM2")
     805                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     806                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     807                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     808              $C$DW$62        .dwtag  DW_TAG_member
     809                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     810                      .dwattr $C$DW$62, DW_AT_name("EPWM3")
     811                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_EPWM3")
     812                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     813                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     815              $C$DW$63        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     817                      .dwattr $C$DW$63, DW_AT_name("EPWM4")
     818                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_EPWM4")
     819                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     820                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     821                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     822              $C$DW$64        .dwtag  DW_TAG_member
     823                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     824                      .dwattr $C$DW$64, DW_AT_name("EPWM5")
     825                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_EPWM5")
     826                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     827                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     828                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$65        .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$65, DW_AT_name("EPWM6")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   17

     832                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_EPWM6")
     833                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     834                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     835                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     836              $C$DW$66        .dwtag  DW_TAG_member
     837                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     838                      .dwattr $C$DW$66, DW_AT_name("EPWM7")
     839                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_EPWM7")
     840                      .dwattr $C$DW$66, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     841                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     843              $C$DW$67        .dwtag  DW_TAG_member
     844                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     845                      .dwattr $C$DW$67, DW_AT_name("EPWM8")
     846                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_EPWM8")
     847                      .dwattr $C$DW$67, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     848                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     850              $C$DW$68        .dwtag  DW_TAG_member
     851                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     852                      .dwattr $C$DW$68, DW_AT_name("EPWM9")
     853                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_EPWM9")
     854                      .dwattr $C$DW$68, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     855                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     857              $C$DW$69        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$69, DW_AT_name("EPWM10")
     860                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_EPWM10")
     861                      .dwattr $C$DW$69, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     862                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$70        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$70, DW_AT_name("EPWM11")
     867                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_EPWM11")
     868                      .dwattr $C$DW$70, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     869                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$71        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     873                      .dwattr $C$DW$71, DW_AT_name("EPWM12")
     874                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_EPWM12")
     875                      .dwattr $C$DW$71, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     876                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     878              $C$DW$72        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$72, DW_AT_name("rsvd1")
     881                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd1")
     882                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     883                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     884                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     885              $C$DW$73        .dwtag  DW_TAG_member
     886                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   18

     887                      .dwattr $C$DW$73, DW_AT_name("rsvd2")
     888                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_rsvd2")
     889                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     890                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     891                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     892                      .dwendtag $C$DW$T$25
     893              
     894              
     895              $C$DW$T$26      .dwtag  DW_TAG_union_type
     896                      .dwattr $C$DW$T$26, DW_AT_name("CPUSEL0_REG")
     897                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     898              $C$DW$74        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$21)
     900                      .dwattr $C$DW$74, DW_AT_name("all")
     901                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
     902                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     903                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     904              $C$DW$75        .dwtag  DW_TAG_member
     905                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$25)
     906                      .dwattr $C$DW$75, DW_AT_name("bit")
     907                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
     908                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     910                      .dwendtag $C$DW$T$26
     911              
     912              
     913              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     914                      .dwattr $C$DW$T$27, DW_AT_name("CPUSEL11_BITS")
     915                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     916              $C$DW$76        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$76, DW_AT_name("ADC1")
     919                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_ADC1")
     920                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     921                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$77        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$77, DW_AT_name("ADC2")
     926                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_ADC2")
     927                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     928                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$78        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$78, DW_AT_name("ADC3")
     933                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_ADC3")
     934                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     935                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$79        .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     939                      .dwattr $C$DW$79, DW_AT_name("ADC4")
     940                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_ADC4")
     941                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   19

     942                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     943                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     944              $C$DW$80        .dwtag  DW_TAG_member
     945                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     946                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
     947                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
     948                      .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     949                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     951              $C$DW$81        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$81, DW_AT_name("rsvd2")
     954                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd2")
     955                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     956                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     957                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     958                      .dwendtag $C$DW$T$27
     959              
     960              
     961              $C$DW$T$28      .dwtag  DW_TAG_union_type
     962                      .dwattr $C$DW$T$28, DW_AT_name("CPUSEL11_REG")
     963                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     964              $C$DW$82        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
     966                      .dwattr $C$DW$82, DW_AT_name("all")
     967                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
     968                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     970              $C$DW$83        .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$27)
     972                      .dwattr $C$DW$83, DW_AT_name("bit")
     973                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
     974                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     976                      .dwendtag $C$DW$T$28
     977              
     978              
     979              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     980                      .dwattr $C$DW$T$29, DW_AT_name("CPUSEL12_BITS")
     981                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     982              $C$DW$84        .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$84, DW_AT_name("CMPSS1")
     985                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_CMPSS1")
     986                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     987                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$85        .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$85, DW_AT_name("CMPSS2")
     992                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_CMPSS2")
     993                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     994                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$86        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   20

     997                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$86, DW_AT_name("CMPSS3")
     999                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CMPSS3")
    1000                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1001                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$87        .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$87, DW_AT_name("CMPSS4")
    1006                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CMPSS4")
    1007                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1008                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$88        .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$88, DW_AT_name("CMPSS5")
    1013                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_CMPSS5")
    1014                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1015                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$89        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$89, DW_AT_name("CMPSS6")
    1020                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_CMPSS6")
    1021                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1022                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$90        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$90, DW_AT_name("CMPSS7")
    1027                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_CMPSS7")
    1028                      .dwattr $C$DW$90, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1029                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1031              $C$DW$91        .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$91, DW_AT_name("CMPSS8")
    1034                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_CMPSS8")
    1035                      .dwattr $C$DW$91, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1036                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1037                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$92        .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$92, DW_AT_name("rsvd1")
    1041                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd1")
    1042                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1043                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1044                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$93        .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$93, DW_AT_name("rsvd2")
    1048                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_rsvd2")
    1049                      .dwattr $C$DW$93, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1050                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1051                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   21

    1052                      .dwendtag $C$DW$T$29
    1053              
    1054              
    1055              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1056                      .dwattr $C$DW$T$30, DW_AT_name("CPUSEL12_REG")
    1057                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1058              $C$DW$94        .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1060                      .dwattr $C$DW$94, DW_AT_name("all")
    1061                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_all")
    1062                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1064              $C$DW$95        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$29)
    1066                      .dwattr $C$DW$95, DW_AT_name("bit")
    1067                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_bit")
    1068                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1070                      .dwendtag $C$DW$T$30
    1071              
    1072              
    1073              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1074                      .dwattr $C$DW$T$31, DW_AT_name("CPUSEL14_BITS")
    1075                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1076              $C$DW$96        .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1078                      .dwattr $C$DW$96, DW_AT_name("rsvd1")
    1079                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd1")
    1080                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1081                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1083              $C$DW$97        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1085                      .dwattr $C$DW$97, DW_AT_name("Buffered_DAC12_1")
    1086                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_Buffered_DAC12_1")
    1087                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1088                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1089                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1090              $C$DW$98        .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$98, DW_AT_name("Buffered_DAC12_2")
    1093                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_Buffered_DAC12_2")
    1094                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1095                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1096                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$99        .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$99, DW_AT_name("Buffered_DAC12_3")
    1100                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_Buffered_DAC12_3")
    1101                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1102                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1103                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$100       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1106                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   22

    1107                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1108                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1109                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1110                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1111                      .dwendtag $C$DW$T$31
    1112              
    1113              
    1114              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1115                      .dwattr $C$DW$T$32, DW_AT_name("CPUSEL14_REG")
    1116                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1117              $C$DW$101       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1119                      .dwattr $C$DW$101, DW_AT_name("all")
    1120                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1121                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$102       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$31)
    1125                      .dwattr $C$DW$102, DW_AT_name("bit")
    1126                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1127                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1128                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1129                      .dwendtag $C$DW$T$32
    1130              
    1131              
    1132              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1133                      .dwattr $C$DW$T$33, DW_AT_name("CPUSEL1_BITS")
    1134                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1135              $C$DW$103       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$103, DW_AT_name("ECAP1")
    1138                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_ECAP1")
    1139                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1140                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1142              $C$DW$104       .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$104, DW_AT_name("ECAP2")
    1145                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_ECAP2")
    1146                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1147                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$105       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$105, DW_AT_name("ECAP3")
    1152                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_ECAP3")
    1153                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$106       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$106, DW_AT_name("ECAP4")
    1159                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_ECAP4")
    1160                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   23

    1162                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$107       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$107, DW_AT_name("ECAP5")
    1166                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_ECAP5")
    1167                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$108       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$108, DW_AT_name("ECAP6")
    1173                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_ECAP6")
    1174                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$109       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$109, DW_AT_name("rsvd1")
    1180                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd1")
    1181                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1182                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1184              $C$DW$110       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$110, DW_AT_name("rsvd2")
    1187                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd2")
    1188                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1189                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1190                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1191                      .dwendtag $C$DW$T$33
    1192              
    1193              
    1194              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1195                      .dwattr $C$DW$T$34, DW_AT_name("CPUSEL1_REG")
    1196                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1197              $C$DW$111       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
    1199                      .dwattr $C$DW$111, DW_AT_name("all")
    1200                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1201                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$112       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$33)
    1205                      .dwattr $C$DW$112, DW_AT_name("bit")
    1206                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1207                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1209                      .dwendtag $C$DW$T$34
    1210              
    1211              
    1212              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1213                      .dwattr $C$DW$T$35, DW_AT_name("CPUSEL2_BITS")
    1214                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1215              $C$DW$113       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   24

    1217                      .dwattr $C$DW$113, DW_AT_name("EQEP1")
    1218                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_EQEP1")
    1219                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1220                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$114       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1224                      .dwattr $C$DW$114, DW_AT_name("EQEP2")
    1225                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_EQEP2")
    1226                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1228                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$115       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$115, DW_AT_name("EQEP3")
    1232                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_EQEP3")
    1233                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1234                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1236              $C$DW$116       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$116, DW_AT_name("rsvd1")
    1239                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd1")
    1240                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1241                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$117       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$117, DW_AT_name("rsvd2")
    1246                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_rsvd2")
    1247                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1248                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1249                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1250                      .dwendtag $C$DW$T$35
    1251              
    1252              
    1253              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1254                      .dwattr $C$DW$T$36, DW_AT_name("CPUSEL2_REG")
    1255                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1256              $C$DW$118       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
    1258                      .dwattr $C$DW$118, DW_AT_name("all")
    1259                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_all")
    1260                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$119       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$35)
    1264                      .dwattr $C$DW$119, DW_AT_name("bit")
    1265                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_bit")
    1266                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1267                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1268                      .dwendtag $C$DW$T$36
    1269              
    1270              
    1271              $C$DW$T$37      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   25

    1272                      .dwattr $C$DW$T$37, DW_AT_name("CPUSEL3_BITS")
    1273                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1274              $C$DW$120       .dwtag  DW_TAG_member
    1275                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1276                      .dwattr $C$DW$120, DW_AT_name("rsvd1")
    1277                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd1")
    1278                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1279                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1281              $C$DW$121       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1283                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
    1284                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
    1285                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1286                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1287                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1288                      .dwendtag $C$DW$T$37
    1289              
    1290              
    1291              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1292                      .dwattr $C$DW$T$38, DW_AT_name("CPUSEL3_REG")
    1293                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1294              $C$DW$122       .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1296                      .dwattr $C$DW$122, DW_AT_name("all")
    1297                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1298                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$123       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$37)
    1302                      .dwattr $C$DW$123, DW_AT_name("bit")
    1303                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1304                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1306                      .dwendtag $C$DW$T$38
    1307              
    1308              
    1309              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1310                      .dwattr $C$DW$T$39, DW_AT_name("CPUSEL4_BITS")
    1311                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1312              $C$DW$124       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$124, DW_AT_name("SD1")
    1315                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_SD1")
    1316                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1317                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$125       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$125, DW_AT_name("SD2")
    1322                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_SD2")
    1323                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$126       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   26

    1327                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$126, DW_AT_name("rsvd1")
    1329                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd1")
    1330                      .dwattr $C$DW$126, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1331                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$127       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$127, DW_AT_name("rsvd2")
    1336                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2")
    1337                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1338                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1339                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1340                      .dwendtag $C$DW$T$39
    1341              
    1342              
    1343              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1344                      .dwattr $C$DW$T$40, DW_AT_name("CPUSEL4_REG")
    1345                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1346              $C$DW$128       .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    1348                      .dwattr $C$DW$128, DW_AT_name("all")
    1349                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_all")
    1350                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1351                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$129       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$39)
    1354                      .dwattr $C$DW$129, DW_AT_name("bit")
    1355                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_bit")
    1356                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1357                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1358                      .dwendtag $C$DW$T$40
    1359              
    1360              
    1361              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1362                      .dwattr $C$DW$T$41, DW_AT_name("CPUSEL5_BITS")
    1363                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1364              $C$DW$130       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$130, DW_AT_name("SCI_A")
    1367                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_SCI_A")
    1368                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1369                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$131       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$131, DW_AT_name("SCI_B")
    1374                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_SCI_B")
    1375                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1376                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$132       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$132, DW_AT_name("SCI_C")
    1381                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_SCI_C")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   27

    1382                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1383                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$133       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$133, DW_AT_name("SCI_D")
    1388                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_SCI_D")
    1389                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1390                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$134       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    1395                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    1396                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1397                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$135       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$135, DW_AT_name("rsvd2")
    1402                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd2")
    1403                      .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1404                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1405                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1406                      .dwendtag $C$DW$T$41
    1407              
    1408              
    1409              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1410                      .dwattr $C$DW$T$42, DW_AT_name("CPUSEL5_REG")
    1411                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    1412              $C$DW$136       .dwtag  DW_TAG_member
    1413                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    1414                      .dwattr $C$DW$136, DW_AT_name("all")
    1415                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_all")
    1416                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1417                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$137       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$41)
    1420                      .dwattr $C$DW$137, DW_AT_name("bit")
    1421                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_bit")
    1422                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1424                      .dwendtag $C$DW$T$42
    1425              
    1426              
    1427              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1428                      .dwattr $C$DW$T$43, DW_AT_name("CPUSEL6_BITS")
    1429                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    1430              $C$DW$138       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$138, DW_AT_name("SPI_A")
    1433                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_SPI_A")
    1434                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1435                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   28

    1437              $C$DW$139       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1439                      .dwattr $C$DW$139, DW_AT_name("SPI_B")
    1440                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_SPI_B")
    1441                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1442                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$140       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1446                      .dwattr $C$DW$140, DW_AT_name("SPI_C")
    1447                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_SPI_C")
    1448                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1449                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1451              $C$DW$141       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1454                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1455                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1456                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$142       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1460                      .dwattr $C$DW$142, DW_AT_name("rsvd2")
    1461                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd2")
    1462                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1463                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1464                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1465                      .dwendtag $C$DW$T$43
    1466              
    1467              
    1468              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1469                      .dwattr $C$DW$T$44, DW_AT_name("CPUSEL6_REG")
    1470                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    1471              $C$DW$143       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    1473                      .dwattr $C$DW$143, DW_AT_name("all")
    1474                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_all")
    1475                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$144       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$43)
    1479                      .dwattr $C$DW$144, DW_AT_name("bit")
    1480                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_bit")
    1481                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1482                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1483                      .dwendtag $C$DW$T$44
    1484              
    1485              
    1486              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1487                      .dwattr $C$DW$T$45, DW_AT_name("CPUSEL7_BITS")
    1488                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1489              $C$DW$145       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$145, DW_AT_name("I2C_A")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   29

    1492                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_I2C_A")
    1493                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1494                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$146       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$146, DW_AT_name("I2C_B")
    1499                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_I2C_B")
    1500                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1501                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$147       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$147, DW_AT_name("rsvd1")
    1506                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd1")
    1507                      .dwattr $C$DW$147, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1508                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$148       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$148, DW_AT_name("rsvd2")
    1513                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd2")
    1514                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1515                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1516                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1517                      .dwendtag $C$DW$T$45
    1518              
    1519              
    1520              $C$DW$T$46      .dwtag  DW_TAG_union_type
    1521                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL7_REG")
    1522                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1523              $C$DW$149       .dwtag  DW_TAG_member
    1524                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1525                      .dwattr $C$DW$149, DW_AT_name("all")
    1526                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    1527                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1529              $C$DW$150       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$45)
    1531                      .dwattr $C$DW$150, DW_AT_name("bit")
    1532                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    1533                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1535                      .dwendtag $C$DW$T$46
    1536              
    1537              
    1538              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1539                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL8_BITS")
    1540                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1541              $C$DW$151       .dwtag  DW_TAG_member
    1542                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1543                      .dwattr $C$DW$151, DW_AT_name("CAN_A")
    1544                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_CAN_A")
    1545                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1546                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   30

    1547                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1548              $C$DW$152       .dwtag  DW_TAG_member
    1549                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1550                      .dwattr $C$DW$152, DW_AT_name("CAN_B")
    1551                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_CAN_B")
    1552                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1553                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1555              $C$DW$153       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$153, DW_AT_name("rsvd1")
    1558                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd1")
    1559                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1560                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1561                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1562              $C$DW$154       .dwtag  DW_TAG_member
    1563                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1564                      .dwattr $C$DW$154, DW_AT_name("rsvd2")
    1565                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd2")
    1566                      .dwattr $C$DW$154, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1567                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1568                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1569                      .dwendtag $C$DW$T$47
    1570              
    1571              
    1572              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1573                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL8_REG")
    1574                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1575              $C$DW$155       .dwtag  DW_TAG_member
    1576                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
    1577                      .dwattr $C$DW$155, DW_AT_name("all")
    1578                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_all")
    1579                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1581              $C$DW$156       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$47)
    1583                      .dwattr $C$DW$156, DW_AT_name("bit")
    1584                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_bit")
    1585                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1587                      .dwendtag $C$DW$T$48
    1588              
    1589              
    1590              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1591                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL9_BITS")
    1592                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1593              $C$DW$157       .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1595                      .dwattr $C$DW$157, DW_AT_name("McBSP_A")
    1596                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_McBSP_A")
    1597                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1598                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1599                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1600              $C$DW$158       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   31

    1602                      .dwattr $C$DW$158, DW_AT_name("McBSP_B")
    1603                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_McBSP_B")
    1604                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1605                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1606                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1607              $C$DW$159       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1609                      .dwattr $C$DW$159, DW_AT_name("rsvd1")
    1610                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd1")
    1611                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1612                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1613                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1614              $C$DW$160       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1616                      .dwattr $C$DW$160, DW_AT_name("rsvd2")
    1617                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd2")
    1618                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1619                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1620                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1621                      .dwendtag $C$DW$T$49
    1622              
    1623              
    1624              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1625                      .dwattr $C$DW$T$50, DW_AT_name("CPUSEL9_REG")
    1626                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1627              $C$DW$161       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    1629                      .dwattr $C$DW$161, DW_AT_name("all")
    1630                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    1631                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$162       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$49)
    1635                      .dwattr $C$DW$162, DW_AT_name("bit")
    1636                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    1637                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1638                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1639                      .dwendtag $C$DW$T$50
    1640              
    1641              
    1642              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    1643                      .dwattr $C$DW$T$51, DW_AT_name("CPUSYSLOCK1_BITS")
    1644                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1645              $C$DW$163       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$163, DW_AT_name("HIBBOOTMODE")
    1648                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1649                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1650                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1651                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1652              $C$DW$164       .dwtag  DW_TAG_member
    1653                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1654                      .dwattr $C$DW$164, DW_AT_name("IORESTOREADDR")
    1655                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1656                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   32

    1657                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1659              $C$DW$165       .dwtag  DW_TAG_member
    1660                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1661                      .dwattr $C$DW$165, DW_AT_name("PIEVERRADDR")
    1662                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_PIEVERRADDR")
    1663                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1664                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1666              $C$DW$166       .dwtag  DW_TAG_member
    1667                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1668                      .dwattr $C$DW$166, DW_AT_name("PCLKCR0")
    1669                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_PCLKCR0")
    1670                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1671                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1673              $C$DW$167       .dwtag  DW_TAG_member
    1674                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1675                      .dwattr $C$DW$167, DW_AT_name("PCLKCR1")
    1676                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PCLKCR1")
    1677                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1678                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1679                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1680              $C$DW$168       .dwtag  DW_TAG_member
    1681                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1682                      .dwattr $C$DW$168, DW_AT_name("PCLKCR2")
    1683                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_PCLKCR2")
    1684                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1685                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1686                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$169       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$169, DW_AT_name("PCLKCR3")
    1690                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_PCLKCR3")
    1691                      .dwattr $C$DW$169, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1692                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1694              $C$DW$170       .dwtag  DW_TAG_member
    1695                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1696                      .dwattr $C$DW$170, DW_AT_name("PCLKCR4")
    1697                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_PCLKCR4")
    1698                      .dwattr $C$DW$170, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1699                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1700                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1701              $C$DW$171       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1703                      .dwattr $C$DW$171, DW_AT_name("PCLKCR5")
    1704                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_PCLKCR5")
    1705                      .dwattr $C$DW$171, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1706                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1707                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1708              $C$DW$172       .dwtag  DW_TAG_member
    1709                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1710                      .dwattr $C$DW$172, DW_AT_name("PCLKCR6")
    1711                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_PCLKCR6")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   33

    1712                      .dwattr $C$DW$172, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1713                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1714                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1715              $C$DW$173       .dwtag  DW_TAG_member
    1716                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1717                      .dwattr $C$DW$173, DW_AT_name("PCLKCR7")
    1718                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_PCLKCR7")
    1719                      .dwattr $C$DW$173, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1720                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1721                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1722              $C$DW$174       .dwtag  DW_TAG_member
    1723                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1724                      .dwattr $C$DW$174, DW_AT_name("PCLKCR8")
    1725                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_PCLKCR8")
    1726                      .dwattr $C$DW$174, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1727                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1728                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$175       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1731                      .dwattr $C$DW$175, DW_AT_name("PCLKCR9")
    1732                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_PCLKCR9")
    1733                      .dwattr $C$DW$175, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1734                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1736              $C$DW$176       .dwtag  DW_TAG_member
    1737                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1738                      .dwattr $C$DW$176, DW_AT_name("PCLKCR10")
    1739                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_PCLKCR10")
    1740                      .dwattr $C$DW$176, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1741                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1743              $C$DW$177       .dwtag  DW_TAG_member
    1744                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1745                      .dwattr $C$DW$177, DW_AT_name("PCLKCR11")
    1746                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_PCLKCR11")
    1747                      .dwattr $C$DW$177, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1748                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1749                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1750              $C$DW$178       .dwtag  DW_TAG_member
    1751                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1752                      .dwattr $C$DW$178, DW_AT_name("PCLKCR12")
    1753                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_PCLKCR12")
    1754                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1755                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1756                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1757              $C$DW$179       .dwtag  DW_TAG_member
    1758                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1759                      .dwattr $C$DW$179, DW_AT_name("PCLKCR13")
    1760                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_PCLKCR13")
    1761                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1762                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1763                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1764              $C$DW$180       .dwtag  DW_TAG_member
    1765                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1766                      .dwattr $C$DW$180, DW_AT_name("PCLKCR14")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   34

    1767                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_PCLKCR14")
    1768                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1769                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1770                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$181       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1773                      .dwattr $C$DW$181, DW_AT_name("PCLKCR15")
    1774                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_PCLKCR15")
    1775                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1776                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1777                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1778              $C$DW$182       .dwtag  DW_TAG_member
    1779                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1780                      .dwattr $C$DW$182, DW_AT_name("PCLKCR16")
    1781                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_PCLKCR16")
    1782                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1783                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1784                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1785              $C$DW$183       .dwtag  DW_TAG_member
    1786                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1787                      .dwattr $C$DW$183, DW_AT_name("SECMSEL")
    1788                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SECMSEL")
    1789                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1790                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1791                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1792              $C$DW$184       .dwtag  DW_TAG_member
    1793                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1794                      .dwattr $C$DW$184, DW_AT_name("LPMCR")
    1795                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_LPMCR")
    1796                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1797                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1798                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1799              $C$DW$185       .dwtag  DW_TAG_member
    1800                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1801                      .dwattr $C$DW$185, DW_AT_name("GPIOLPMSEL0")
    1802                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
    1803                      .dwattr $C$DW$185, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1804                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1805                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1806              $C$DW$186       .dwtag  DW_TAG_member
    1807                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1808                      .dwattr $C$DW$186, DW_AT_name("GPIOLPMSEL1")
    1809                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
    1810                      .dwattr $C$DW$186, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1811                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1812                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$187       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1815                      .dwattr $C$DW$187, DW_AT_name("rsvd1")
    1816                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd1")
    1817                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1818                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1819                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1820                      .dwendtag $C$DW$T$51
    1821              
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:14 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0780810                         PAGE   35

    1822              
    1823              $C$DW$T$52      .dwtag  DW_TAG_union_type
    1824                      .dwattr $C$DW$T$52, DW_AT_name("CPUSYSLOCK1_REG")
    1825                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1826              $C$DW$188       .dwtag  DW_TAG_member
    1827                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    1828                      .dwattr $C$DW$188, DW_AT_name("all")
    1829                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    1830                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1831                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1832              $C$DW$189       .dwtag  DW_TAG_member
    1833                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$51)
    1834                      .dwattr $C$DW$189, DW_AT_name("bit")
    1835                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    1836                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1838                      .dwendtag $C$DW$T$52
    1839              
    1840              
    1841              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    1842                      .dwattr $C$DW$T$57, DW_AT_name("CPU_SYS_REGS")
    1843                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x82)
    1844              $C$DW$190       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$52)
    1846                      .dwattr $C$DW$190, DW_AT_name("CPUSYSLOCK1")
    1847                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
    1848                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1849                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1850              $C$DW$191       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$53)
    1852                      .dwattr $C$DW$191, DW_AT_name("rsvd1")
    1853                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd1")
    1854                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1855                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1856              $C$DW$192       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    1858                      .dwattr $C$DW$192, DW_AT_name("HIBBOOTMODE")
    1859                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_HIBBOOTMODE")
    1860                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1861                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1862              $C$DW$193       .dwtag  DW_TAG_member
    1863                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$349)
    1864                      .dwattr $C$DW$193, DW_AT_name("IORESTOREADDR")
    1865                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_IORESTOREADDR")
    1866                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1867                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1868              $C$DW$194       .dwtag  DW_TAG_member
    1869                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$391)
    1870                      .dwattr $C$DW$194, DW_AT_name("PIEVERRADDR")
