TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:18 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("EmuKey")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_EmuKey")

     160                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     161 0000002f FF69          SPM       #0                    ; [CPU_] 
     162              $C$DW$13        .dwtag  DW_TAG_TI_branch
     163                      .dwattr $C$DW$13, DW_AT_low_pc(0x00)
     164                      .dwattr $C$DW$13, DW_AT_name("_c1brom_read_otp_bootpinconfig")
     165                      .dwattr $C$DW$13, DW_AT_TI_call
     166 00000030 7640!         LCR       #_c1brom_read_otp_bootpinconfig ; [CPU_] |75| 
         00000031 0000 
     167                      ; call occurs [#_c1brom_read_otp_bootpinconfig] ; [] |75| 
     168              $C$DW$14        .dwtag  DW_TAG_TI_branch
     169                      .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     170                      .dwattr $C$DW$14, DW_AT_name("_c1brom_decode_bootpins")
     171                      .dwattr $C$DW$14, DW_AT_TI_call
     172 00000032 7640!         LCR       #_c1brom_decode_bootpins ; [CPU_] |75| 
         00000033 0000 
     173                      ; call occurs [#_c1brom_decode_bootpins] ; [] |75| 
     174 00000034 9641          MOV       *-SP[1],AL            ; [CPU_] |75| 
     175                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     176 00000035 761F!         MOVW      DP,#_EmuKey           ; [CPU_U] 
         00000036 0000 
     177 00000037 5603          MOV       ACC,*-SP[1] << #8     ; [CPU_] |76| 
         00000038 0841 
     178 00000039 505A          ORB       AL,#0x5a              ; [CPU_] |76| 
     179 0000003a 9600!         MOV       @_EmuKey,AL           ; [CPU_] |76| 
     180 0000003b       $C$L4:    
     181                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     182 0000003b 761A   EDIS
     183                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     184 0000003c 9241          MOV       AL,*-SP[1]            ; [CPU_] |82| 
     185 0000003d 5203          CMPB      AL,#3                 ; [CPU_] |82| 
     186 0000003e ED05          BF        $C$L5,NEQ             ; [CPU_] |82| 
     187                      ; branchcc occurs ; [] |82| 
     188                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     189 0000003f FF69          SPM       #0                    ; [CPU_] 
     190              $C$DW$15        .dwtag  DW_TAG_TI_branch
     191                      .dwattr $C$DW$15, DW_AT_low_pc(0x00)
     192                      .dwattr $C$DW$15, DW_AT_name("_c1brom_read_otp_bootmode")
     193                      .dwattr $C$DW$15, DW_AT_TI_call
     194 00000040 7640!         LCR       #_c1brom_read_otp_bootmode ; [CPU_] |84| 
         00000041 0000 
     195                      ; call occurs [#_c1brom_read_otp_bootmode] ; [] |84| 
     196 00000042 9641          MOV       *-SP[1],AL            ; [CPU_] |84| 
     197 00000043       $C$L5:    
     198                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     199                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     200 00000043 FE82          SUBB      SP,#2                 ; [CPU_U] 
     201                      .dwcfi  cfa_offset, -2
     202 00000044 FF69          SPM       #0                    ; [CPU_] 
     203              $C$DW$16        .dwtag  DW_TAG_TI_branch
     204                      .dwattr $C$DW$16, DW_AT_low_pc(0x00)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE    5

     205                      .dwattr $C$DW$16, DW_AT_TI_return
     206 00000045 0006          LRETR     ; [CPU_] 
     207                      ; return occurs ; [] 
     208                      .dwattr $C$DW$8, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootRO
     209                      .dwattr $C$DW$8, DW_AT_TI_end_line(0x59)
     210                      .dwattr $C$DW$8, DW_AT_TI_end_column(0x01)
     211                      .dwendentry
     212                      .dwendtag $C$DW$8
     213              
     214              ;**************************************************************
     215              ;* UNDEFINED EXTERNAL REFERENCES                              *
     216              ;**************************************************************
     217                      .global _EmuKey
     218                      .global _EmuBMode
     219                      .global _c1brom_read_otp_bootpinconfig
     220                      .global _c1brom_read_otp_bootmode
     221                      .global _c1brom_decode_bootpins
     222                      .global _CpuSysRegs
     223              
     224              ;***************************************************************
     225              ;* TYPE INFORMATION                                            *
     226              ;***************************************************************
     227              
     228              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     229                      .dwattr $C$DW$T$20, DW_AT_name("CCR_BITS")
     230                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     231              $C$DW$17        .dwtag  DW_TAG_member
     232                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     233                      .dwattr $C$DW$17, DW_AT_name("VMAPS")
     234                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_VMAPS")
     235                      .dwattr $C$DW$17, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     236                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     237                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     238              $C$DW$18        .dwtag  DW_TAG_member
     239                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     240                      .dwattr $C$DW$18, DW_AT_name("MONPRIV")
     241                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_MONPRIV")
     242                      .dwattr $C$DW$18, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     243                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     244                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     245              $C$DW$19        .dwtag  DW_TAG_member
     246                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     247                      .dwattr $C$DW$19, DW_AT_name("ENPROT")
     248                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_ENPROT")
     249                      .dwattr $C$DW$19, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     250                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     251                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     252              $C$DW$20        .dwtag  DW_TAG_member
     253                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     254                      .dwattr $C$DW$20, DW_AT_name("rsvd1")
     255                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_rsvd1")
     256                      .dwattr $C$DW$20, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     257                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     258                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     259              $C$DW$21        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE    6

     260                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     261                      .dwattr $C$DW$21, DW_AT_name("rsvd2")
     262                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd2")
     263                      .dwattr $C$DW$21, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     264                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     265                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     266                      .dwendtag $C$DW$T$20
     267              
     268              
     269              $C$DW$T$22      .dwtag  DW_TAG_union_type
     270                      .dwattr $C$DW$T$22, DW_AT_name("CCR_REG")
     271                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     272              $C$DW$22        .dwtag  DW_TAG_member
     273                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$21)
     274                      .dwattr $C$DW$22, DW_AT_name("all")
     275                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_all")
     276                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     277                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     278              $C$DW$23        .dwtag  DW_TAG_member
     279                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$20)
     280                      .dwattr $C$DW$23, DW_AT_name("bit")
     281                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_bit")
     282                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     283                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     284                      .dwendtag $C$DW$T$22
     285              
     286              
     287              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     288                      .dwattr $C$DW$T$23, DW_AT_name("CPUSYSLOCK1_BITS")
     289                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     290              $C$DW$24        .dwtag  DW_TAG_member
     291                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     292                      .dwattr $C$DW$24, DW_AT_name("HIBBOOTMODE")
     293                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_HIBBOOTMODE")
     294                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     295                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     296                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     297              $C$DW$25        .dwtag  DW_TAG_member
     298                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     299                      .dwattr $C$DW$25, DW_AT_name("IORESTOREADDR")
     300                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_IORESTOREADDR")
     301                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     302                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     303                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     304              $C$DW$26        .dwtag  DW_TAG_member
     305                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     306                      .dwattr $C$DW$26, DW_AT_name("PIEVERRADDR")
     307                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_PIEVERRADDR")
     308                      .dwattr $C$DW$26, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     309                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     310                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     311              $C$DW$27        .dwtag  DW_TAG_member
     312                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     313                      .dwattr $C$DW$27, DW_AT_name("PCLKCR0")
     314                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_PCLKCR0")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE    7

     315                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     316                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     317                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     318              $C$DW$28        .dwtag  DW_TAG_member
     319                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     320                      .dwattr $C$DW$28, DW_AT_name("PCLKCR1")
     321                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_PCLKCR1")
     322                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     323                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     324                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     325              $C$DW$29        .dwtag  DW_TAG_member
     326                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     327                      .dwattr $C$DW$29, DW_AT_name("PCLKCR2")
     328                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_PCLKCR2")
     329                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     330                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     331                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     332              $C$DW$30        .dwtag  DW_TAG_member
     333                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     334                      .dwattr $C$DW$30, DW_AT_name("PCLKCR3")
     335                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_PCLKCR3")
     336                      .dwattr $C$DW$30, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     337                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     338                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     339              $C$DW$31        .dwtag  DW_TAG_member
     340                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     341                      .dwattr $C$DW$31, DW_AT_name("PCLKCR4")
     342                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_PCLKCR4")
     343                      .dwattr $C$DW$31, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     344                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     345                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     346              $C$DW$32        .dwtag  DW_TAG_member
     347                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     348                      .dwattr $C$DW$32, DW_AT_name("PCLKCR5")
     349                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_PCLKCR5")
     350                      .dwattr $C$DW$32, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     351                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     352                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     353              $C$DW$33        .dwtag  DW_TAG_member
     354                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     355                      .dwattr $C$DW$33, DW_AT_name("PCLKCR6")
     356                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_PCLKCR6")
     357                      .dwattr $C$DW$33, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     358                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     359                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     360              $C$DW$34        .dwtag  DW_TAG_member
     361                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     362                      .dwattr $C$DW$34, DW_AT_name("PCLKCR7")
     363                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_PCLKCR7")
     364                      .dwattr $C$DW$34, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     365                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     366                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     367              $C$DW$35        .dwtag  DW_TAG_member
     368                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     369                      .dwattr $C$DW$35, DW_AT_name("PCLKCR8")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE    8

     370                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_PCLKCR8")
     371                      .dwattr $C$DW$35, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     372                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     373                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     374              $C$DW$36        .dwtag  DW_TAG_member
     375                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     376                      .dwattr $C$DW$36, DW_AT_name("PCLKCR9")
     377                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_PCLKCR9")
     378                      .dwattr $C$DW$36, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     379                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     380                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     381              $C$DW$37        .dwtag  DW_TAG_member
     382                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     383                      .dwattr $C$DW$37, DW_AT_name("PCLKCR10")
     384                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_PCLKCR10")
     385                      .dwattr $C$DW$37, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     386                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     387                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     388              $C$DW$38        .dwtag  DW_TAG_member
     389                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     390                      .dwattr $C$DW$38, DW_AT_name("PCLKCR11")
     391                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_PCLKCR11")
     392                      .dwattr $C$DW$38, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     393                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     394                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     395              $C$DW$39        .dwtag  DW_TAG_member
     396                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     397                      .dwattr $C$DW$39, DW_AT_name("PCLKCR12")
     398                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_PCLKCR12")
     399                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     400                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     401                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     402              $C$DW$40        .dwtag  DW_TAG_member
     403                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     404                      .dwattr $C$DW$40, DW_AT_name("PCLKCR13")
     405                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_PCLKCR13")
     406                      .dwattr $C$DW$40, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     407                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     408                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     409              $C$DW$41        .dwtag  DW_TAG_member
     410                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     411                      .dwattr $C$DW$41, DW_AT_name("PCLKCR14")
     412                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_PCLKCR14")
     413                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     414                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     415                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     416              $C$DW$42        .dwtag  DW_TAG_member
     417                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     418                      .dwattr $C$DW$42, DW_AT_name("PCLKCR15")
     419                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_PCLKCR15")
     420                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     421                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     422                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     423              $C$DW$43        .dwtag  DW_TAG_member
     424                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE    9

     425                      .dwattr $C$DW$43, DW_AT_name("PCLKCR16")
     426                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_PCLKCR16")
     427                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     428                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     429                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     430              $C$DW$44        .dwtag  DW_TAG_member
     431                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     432                      .dwattr $C$DW$44, DW_AT_name("SECMSEL")
     433                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_SECMSEL")
     434                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     435                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     436                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     437              $C$DW$45        .dwtag  DW_TAG_member
     438                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     439                      .dwattr $C$DW$45, DW_AT_name("LPMCR")
     440                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_LPMCR")
     441                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     442                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     443                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     444              $C$DW$46        .dwtag  DW_TAG_member
     445                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     446                      .dwattr $C$DW$46, DW_AT_name("GPIOLPMSEL0")
     447                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
     448                      .dwattr $C$DW$46, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     449                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     450                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     451              $C$DW$47        .dwtag  DW_TAG_member
     452                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     453                      .dwattr $C$DW$47, DW_AT_name("GPIOLPMSEL1")
     454                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
     455                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     456                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     457                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     458              $C$DW$48        .dwtag  DW_TAG_member
     459                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     460                      .dwattr $C$DW$48, DW_AT_name("rsvd1")
     461                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd1")
     462                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     463                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     464                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     465                      .dwendtag $C$DW$T$23
     466              
     467              
     468              $C$DW$T$24      .dwtag  DW_TAG_union_type
     469                      .dwattr $C$DW$T$24, DW_AT_name("CPUSYSLOCK1_REG")
     470                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     471              $C$DW$49        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     473                      .dwattr $C$DW$49, DW_AT_name("all")
     474                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
     475                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     477              $C$DW$50        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$23)
     479                      .dwattr $C$DW$50, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   10

     480                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
     481                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     482                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     483                      .dwendtag $C$DW$T$24
     484              
     485              
     486              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     487                      .dwattr $C$DW$T$29, DW_AT_name("CPU_SYS_REGS")
     488                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x82)
     489              $C$DW$51        .dwtag  DW_TAG_member
     490                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$24)
     491                      .dwattr $C$DW$51, DW_AT_name("CPUSYSLOCK1")
     492                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_CPUSYSLOCK1")
     493                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     494                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     495              $C$DW$52        .dwtag  DW_TAG_member
     496                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$25)
     497                      .dwattr $C$DW$52, DW_AT_name("rsvd1")
     498                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd1")
     499                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     500                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     501              $C$DW$53        .dwtag  DW_TAG_member
     502                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$21)
     503                      .dwattr $C$DW$53, DW_AT_name("HIBBOOTMODE")
     504                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_HIBBOOTMODE")
     505                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     506                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     507              $C$DW$54        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$35)
     509                      .dwattr $C$DW$54, DW_AT_name("IORESTOREADDR")
     510                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_IORESTOREADDR")
     511                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     512                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     513              $C$DW$55        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$71)
     515                      .dwattr $C$DW$55, DW_AT_name("PIEVERRADDR")
     516                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_PIEVERRADDR")
     517                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     518                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     519              $C$DW$56        .dwtag  DW_TAG_member
     520                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$26)
     521                      .dwattr $C$DW$56, DW_AT_name("rsvd2")
     522                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_rsvd2")
     523                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     524                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     525              $C$DW$57        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$39)
     527                      .dwattr $C$DW$57, DW_AT_name("PCLKCR0")
     528                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_PCLKCR0")
     529                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     530                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     531              $C$DW$58        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$53)
     533                      .dwattr $C$DW$58, DW_AT_name("PCLKCR1")
     534                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PCLKCR1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   11

     535                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     536                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     537              $C$DW$59        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$55)
     539                      .dwattr $C$DW$59, DW_AT_name("PCLKCR2")
     540                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_PCLKCR2")
     541                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     542                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     543              $C$DW$60        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$57)
     545                      .dwattr $C$DW$60, DW_AT_name("PCLKCR3")
     546                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_PCLKCR3")
     547                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     548                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     549              $C$DW$61        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$59)
     551                      .dwattr $C$DW$61, DW_AT_name("PCLKCR4")
     552                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PCLKCR4")
     553                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     554                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     555              $C$DW$62        .dwtag  DW_TAG_member
     556                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$61)
     557                      .dwattr $C$DW$62, DW_AT_name("PCLKCR5")
     558                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PCLKCR5")
     559                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     560                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     561              $C$DW$63        .dwtag  DW_TAG_member
     562                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$63)
     563                      .dwattr $C$DW$63, DW_AT_name("PCLKCR6")
     564                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_PCLKCR6")
     565                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     566                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     567              $C$DW$64        .dwtag  DW_TAG_member
     568                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$65)
     569                      .dwattr $C$DW$64, DW_AT_name("PCLKCR7")
     570                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_PCLKCR7")
     571                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     572                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     573              $C$DW$65        .dwtag  DW_TAG_member
     574                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$67)
     575                      .dwattr $C$DW$65, DW_AT_name("PCLKCR8")
     576                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_PCLKCR8")
     577                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     578                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     579              $C$DW$66        .dwtag  DW_TAG_member
     580                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$69)
     581                      .dwattr $C$DW$66, DW_AT_name("PCLKCR9")
     582                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_PCLKCR9")
     583                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     584                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     585              $C$DW$67        .dwtag  DW_TAG_member
     586                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$41)
     587                      .dwattr $C$DW$67, DW_AT_name("PCLKCR10")
     588                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_PCLKCR10")
     589                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   12

     590                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     591              $C$DW$68        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$43)
     593                      .dwattr $C$DW$68, DW_AT_name("PCLKCR11")
     594                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_PCLKCR11")
     595                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     596                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     597              $C$DW$69        .dwtag  DW_TAG_member
     598                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$45)
     599                      .dwattr $C$DW$69, DW_AT_name("PCLKCR12")
     600                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_PCLKCR12")
     601                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     602                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     603              $C$DW$70        .dwtag  DW_TAG_member
     604                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$47)
     605                      .dwattr $C$DW$70, DW_AT_name("PCLKCR13")
     606                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_PCLKCR13")
     607                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     608                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     609              $C$DW$71        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$49)
     611                      .dwattr $C$DW$71, DW_AT_name("PCLKCR14")
     612                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_PCLKCR14")
     613                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     614                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     615              $C$DW$72        .dwtag  DW_TAG_member
     616                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$27)
     617                      .dwattr $C$DW$72, DW_AT_name("rsvd3")
     618                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd3")
     619                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     620                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     621              $C$DW$73        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$51)
     623                      .dwattr $C$DW$73, DW_AT_name("PCLKCR16")
     624                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_PCLKCR16")
     625                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     626                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     627              $C$DW$74        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$28)
     629                      .dwattr $C$DW$74, DW_AT_name("rsvd4")
     630                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd4")
     631                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     632                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     633              $C$DW$75        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$22)
     635                      .dwattr $C$DW$75, DW_AT_name("CCR")
     636                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_CCR")
     637                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     638                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     639              $C$DW$76        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$75)
     641                      .dwattr $C$DW$76, DW_AT_name("SECMSEL")
     642                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_SECMSEL")
     643                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     644                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   13

     645              $C$DW$77        .dwtag  DW_TAG_member
     646                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$37)
     647                      .dwattr $C$DW$77, DW_AT_name("LPMCR")
     648                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_LPMCR")
     649                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
     650                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     651              $C$DW$78        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$31)
     653                      .dwattr $C$DW$78, DW_AT_name("GPIOLPMSEL0")
     654                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIOLPMSEL0")
     655                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     656                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     657              $C$DW$79        .dwtag  DW_TAG_member
     658                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$33)
     659                      .dwattr $C$DW$79, DW_AT_name("GPIOLPMSEL1")
     660                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIOLPMSEL1")
     661                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
     662                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     663              $C$DW$80        .dwtag  DW_TAG_member
     664                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$77)
     665                      .dwattr $C$DW$80, DW_AT_name("TMR2CLKCTL")
     666                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_TMR2CLKCTL")
     667                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     668                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     669              $C$DW$81        .dwtag  DW_TAG_member
     670                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$27)
     671                      .dwattr $C$DW$81, DW_AT_name("rsvd5")
     672                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd5")
     673                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
     674                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     675              $C$DW$82        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$73)
     677                      .dwattr $C$DW$82, DW_AT_name("RESC")
     678                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_RESC")
     679                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     680                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     681                      .dwendtag $C$DW$T$29
     682              
     683              $C$DW$83        .dwtag  DW_TAG_TI_far_type
     684                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$29)
     685              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
     686                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$83)
     687              
     688              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     689                      .dwattr $C$DW$T$30, DW_AT_name("GPIOLPMSEL0_BITS")
     690                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     691              $C$DW$84        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$84, DW_AT_name("GPIO0")
     694                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO0")
     695                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     696                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     698              $C$DW$85        .dwtag  DW_TAG_member
     699                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   14

     700                      .dwattr $C$DW$85, DW_AT_name("GPIO1")
     701                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO1")
     702                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     703                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     705              $C$DW$86        .dwtag  DW_TAG_member
     706                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     707                      .dwattr $C$DW$86, DW_AT_name("GPIO2")
     708                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO2")
     709                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     710                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     711                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     712              $C$DW$87        .dwtag  DW_TAG_member
     713                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     714                      .dwattr $C$DW$87, DW_AT_name("GPIO3")
     715                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO3")
     716                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     717                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     718                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     719              $C$DW$88        .dwtag  DW_TAG_member
     720                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     721                      .dwattr $C$DW$88, DW_AT_name("GPIO4")
     722                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO4")
     723                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     724                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     725                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     726              $C$DW$89        .dwtag  DW_TAG_member
     727                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     728                      .dwattr $C$DW$89, DW_AT_name("GPIO5")
     729                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO5")
     730                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     731                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$90        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     735                      .dwattr $C$DW$90, DW_AT_name("GPIO6")
     736                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO6")
     737                      .dwattr $C$DW$90, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     738                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$91        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$91, DW_AT_name("GPIO7")
     743                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO7")
     744                      .dwattr $C$DW$91, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     745                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     746                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     747              $C$DW$92        .dwtag  DW_TAG_member
     748                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     749                      .dwattr $C$DW$92, DW_AT_name("GPIO8")
     750                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO8")
     751                      .dwattr $C$DW$92, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     752                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     753                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     754              $C$DW$93        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   15

     755                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     756                      .dwattr $C$DW$93, DW_AT_name("GPIO9")
     757                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO9")
     758                      .dwattr $C$DW$93, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     759                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     760                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     761              $C$DW$94        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     763                      .dwattr $C$DW$94, DW_AT_name("GPIO10")
     764                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO10")
     765                      .dwattr $C$DW$94, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     766                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     768              $C$DW$95        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$95, DW_AT_name("GPIO11")
     771                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO11")
     772                      .dwattr $C$DW$95, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     773                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     774                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     775              $C$DW$96        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$96, DW_AT_name("GPIO12")
     778                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO12")
     779                      .dwattr $C$DW$96, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     780                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     781                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     782              $C$DW$97        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     784                      .dwattr $C$DW$97, DW_AT_name("GPIO13")
     785                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO13")
     786                      .dwattr $C$DW$97, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     787                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     789              $C$DW$98        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     791                      .dwattr $C$DW$98, DW_AT_name("GPIO14")
     792                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO14")
     793                      .dwattr $C$DW$98, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     794                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     796              $C$DW$99        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$99, DW_AT_name("GPIO15")
     799                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO15")
     800                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     801                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     803              $C$DW$100       .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$100, DW_AT_name("GPIO16")
     806                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO16")
     807                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     808                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     809                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   16

     810              $C$DW$101       .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$101, DW_AT_name("GPIO17")
     813                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO17")
     814                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     815                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     816                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$102       .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$102, DW_AT_name("GPIO18")
     820                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO18")
     821                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     822                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     823                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     824              $C$DW$103       .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$103, DW_AT_name("GPIO19")
     827                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO19")
     828                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     829                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     830                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     831              $C$DW$104       .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$104, DW_AT_name("GPIO20")
     834                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO20")
     835                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     836                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     837                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     838              $C$DW$105       .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$105, DW_AT_name("GPIO21")
     841                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO21")
     842                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     844                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     845              $C$DW$106       .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$106, DW_AT_name("GPIO22")
     848                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO22")
     849                      .dwattr $C$DW$106, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     850                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     851                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$107       .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$107, DW_AT_name("GPIO23")
     855                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO23")
     856                      .dwattr $C$DW$107, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     857                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     858                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$108       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     861                      .dwattr $C$DW$108, DW_AT_name("GPIO24")
     862                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO24")
     863                      .dwattr $C$DW$108, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     864                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   17

     865                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     866              $C$DW$109       .dwtag  DW_TAG_member
     867                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     868                      .dwattr $C$DW$109, DW_AT_name("GPIO25")
     869                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO25")
     870                      .dwattr $C$DW$109, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     871                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     872                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     873              $C$DW$110       .dwtag  DW_TAG_member
     874                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     875                      .dwattr $C$DW$110, DW_AT_name("GPIO26")
     876                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO26")
     877                      .dwattr $C$DW$110, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     878                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     879                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     880              $C$DW$111       .dwtag  DW_TAG_member
     881                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     882                      .dwattr $C$DW$111, DW_AT_name("GPIO27")
     883                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO27")
     884                      .dwattr $C$DW$111, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     885                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     886                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     887              $C$DW$112       .dwtag  DW_TAG_member
     888                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     889                      .dwattr $C$DW$112, DW_AT_name("GPIO28")
     890                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO28")
     891                      .dwattr $C$DW$112, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     892                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     893                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     894              $C$DW$113       .dwtag  DW_TAG_member
     895                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     896                      .dwattr $C$DW$113, DW_AT_name("GPIO29")
     897                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO29")
     898                      .dwattr $C$DW$113, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     899                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     900                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$114       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$114, DW_AT_name("GPIO30")
     904                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO30")
     905                      .dwattr $C$DW$114, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     906                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     907                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     908              $C$DW$115       .dwtag  DW_TAG_member
     909                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
     910                      .dwattr $C$DW$115, DW_AT_name("GPIO31")
     911                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO31")
     912                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     913                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     914                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     915                      .dwendtag $C$DW$T$30
     916              
     917              
     918              $C$DW$T$31      .dwtag  DW_TAG_union_type
     919                      .dwattr $C$DW$T$31, DW_AT_name("GPIOLPMSEL0_REG")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   18

     920                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     921              $C$DW$116       .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
     923                      .dwattr $C$DW$116, DW_AT_name("all")
     924                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_all")
     925                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     927              $C$DW$117       .dwtag  DW_TAG_member
     928                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$30)
     929                      .dwattr $C$DW$117, DW_AT_name("bit")
     930                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_bit")
     931                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     933                      .dwendtag $C$DW$T$31
     934              
     935              
     936              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     937                      .dwattr $C$DW$T$32, DW_AT_name("GPIOLPMSEL1_BITS")
     938                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     939              $C$DW$118       .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     941                      .dwattr $C$DW$118, DW_AT_name("GPIO32")
     942                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO32")
     943                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     944                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     946              $C$DW$119       .dwtag  DW_TAG_member
     947                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     948                      .dwattr $C$DW$119, DW_AT_name("GPIO33")
     949                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO33")
     950                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     951                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     953              $C$DW$120       .dwtag  DW_TAG_member
     954                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     955                      .dwattr $C$DW$120, DW_AT_name("GPIO34")
     956                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO34")
     957                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     958                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     959                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     960              $C$DW$121       .dwtag  DW_TAG_member
     961                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
     962                      .dwattr $C$DW$121, DW_AT_name("GPIO35")
     963                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO35")
     964                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     965                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     966                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$122       .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
     969                      .dwattr $C$DW$122, DW_AT_name("GPIO36")
     970                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO36")
     971                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     972                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     974              $C$DW$123       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   19

     975                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
     976                      .dwattr $C$DW$123, DW_AT_name("GPIO37")
     977                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO37")
     978                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     979                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     980                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     981              $C$DW$124       .dwtag  DW_TAG_member
     982                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
     983                      .dwattr $C$DW$124, DW_AT_name("GPIO38")
     984                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO38")
     985                      .dwattr $C$DW$124, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     986                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     987                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     988              $C$DW$125       .dwtag  DW_TAG_member
     989                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
     990                      .dwattr $C$DW$125, DW_AT_name("GPIO39")
     991                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO39")
     992                      .dwattr $C$DW$125, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     993                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     994                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     995              $C$DW$126       .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$126, DW_AT_name("GPIO40")
     998                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO40")
     999                      .dwattr $C$DW$126, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1000                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1001                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1002              $C$DW$127       .dwtag  DW_TAG_member
    1003                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1004                      .dwattr $C$DW$127, DW_AT_name("GPIO41")
    1005                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO41")
    1006                      .dwattr $C$DW$127, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1007                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1008                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1009              $C$DW$128       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$128, DW_AT_name("GPIO42")
    1012                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO42")
    1013                      .dwattr $C$DW$128, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1014                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1016              $C$DW$129       .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$129, DW_AT_name("GPIO43")
    1019                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO43")
    1020                      .dwattr $C$DW$129, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1021                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$130       .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$130, DW_AT_name("GPIO44")
    1026                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO44")
    1027                      .dwattr $C$DW$130, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1028                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   20

    1030              $C$DW$131       .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$131, DW_AT_name("GPIO45")
    1033                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO45")
    1034                      .dwattr $C$DW$131, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1035                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1037              $C$DW$132       .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$132, DW_AT_name("GPIO46")
    1040                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO46")
    1041                      .dwattr $C$DW$132, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1042                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1044              $C$DW$133       .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1046                      .dwattr $C$DW$133, DW_AT_name("GPIO47")
    1047                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO47")
    1048                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1049                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$134       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$134, DW_AT_name("GPIO48")
    1054                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO48")
    1055                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1056                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1057                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$135       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$135, DW_AT_name("GPIO49")
    1061                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO49")
    1062                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1064                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$136       .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$136, DW_AT_name("GPIO50")
    1068                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO50")
    1069                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1071                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$137       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$137, DW_AT_name("GPIO51")
    1075                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO51")
    1076                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1078                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1079              $C$DW$138       .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$138, DW_AT_name("GPIO52")
    1082                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO52")
    1083                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1084                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   21

    1085                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1086              $C$DW$139       .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$139, DW_AT_name("GPIO53")
    1089                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO53")
    1090                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1091                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1092                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$140       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$140, DW_AT_name("GPIO54")
    1096                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO54")
    1097                      .dwattr $C$DW$140, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1099                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1100              $C$DW$141       .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$141, DW_AT_name("GPIO55")
    1103                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO55")
    1104                      .dwattr $C$DW$141, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1105                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1106                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1107              $C$DW$142       .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1109                      .dwattr $C$DW$142, DW_AT_name("GPIO56")
    1110                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO56")
    1111                      .dwattr $C$DW$142, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1112                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1113                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$143       .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$143, DW_AT_name("GPIO57")
    1117                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO57")
    1118                      .dwattr $C$DW$143, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1119                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1120                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1121              $C$DW$144       .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1123                      .dwattr $C$DW$144, DW_AT_name("GPIO58")
    1124                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO58")
    1125                      .dwattr $C$DW$144, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1126                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1127                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1128              $C$DW$145       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$145, DW_AT_name("GPIO59")
    1131                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO59")
    1132                      .dwattr $C$DW$145, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1134                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$146       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$146, DW_AT_name("GPIO60")
    1138                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO60")
    1139                      .dwattr $C$DW$146, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   22

    1140                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1141                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1142              $C$DW$147       .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$147, DW_AT_name("GPIO61")
    1145                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO61")
    1146                      .dwattr $C$DW$147, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1147                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1148                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$148       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$148, DW_AT_name("GPIO62")
    1152                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO62")
    1153                      .dwattr $C$DW$148, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1155                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$149       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$149, DW_AT_name("GPIO63")
    1159                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO63")
    1160                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1162                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1163                      .dwendtag $C$DW$T$32
    1164              
    1165              
    1166              $C$DW$T$33      .dwtag  DW_TAG_union_type
    1167                      .dwattr $C$DW$T$33, DW_AT_name("GPIOLPMSEL1_REG")
    1168                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1169              $C$DW$150       .dwtag  DW_TAG_member
    1170                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    1171                      .dwattr $C$DW$150, DW_AT_name("all")
    1172                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_all")
    1173                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$151       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$32)
    1177                      .dwattr $C$DW$151, DW_AT_name("bit")
    1178                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_bit")
    1179                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1181                      .dwendtag $C$DW$T$33
    1182              
    1183              
    1184              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    1185                      .dwattr $C$DW$T$34, DW_AT_name("IORESTOREADDR_BITS")
    1186                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1187              $C$DW$152       .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    1189                      .dwattr $C$DW$152, DW_AT_name("ADDR")
    1190                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ADDR")
    1191                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x16)
    1192                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$153       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   23

    1195                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$153, DW_AT_name("rsvd1")
    1197                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd1")
    1198                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1199                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1200                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1201                      .dwendtag $C$DW$T$34
    1202              
    1203              
    1204              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1205                      .dwattr $C$DW$T$35, DW_AT_name("IORESTOREADDR_REG")
    1206                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1207              $C$DW$154       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    1209                      .dwattr $C$DW$154, DW_AT_name("all")
    1210                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_all")
    1211                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1213              $C$DW$155       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$34)
    1215                      .dwattr $C$DW$155, DW_AT_name("bit")
    1216                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_bit")
    1217                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1219                      .dwendtag $C$DW$T$35
    1220              
    1221              
    1222              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1223                      .dwattr $C$DW$T$36, DW_AT_name("LPMCR_BITS")
    1224                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1225              $C$DW$156       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$156, DW_AT_name("LPM")
    1228                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_LPM")
    1229                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1230                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1231                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1232              $C$DW$157       .dwtag  DW_TAG_member
    1233                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1234                      .dwattr $C$DW$157, DW_AT_name("QUALSTDBY")
    1235                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_QUALSTDBY")
    1236                      .dwattr $C$DW$157, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    1237                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1239              $C$DW$158       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1241                      .dwattr $C$DW$158, DW_AT_name("rsvd1")
    1242                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd1")
    1243                      .dwattr $C$DW$158, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1244                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1246              $C$DW$159       .dwtag  DW_TAG_member
    1247                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1248                      .dwattr $C$DW$159, DW_AT_name("WDINTE")
    1249                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_WDINTE")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   24

    1250                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1251                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1253              $C$DW$160       .dwtag  DW_TAG_member
    1254                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1255                      .dwattr $C$DW$160, DW_AT_name("M0M1MODE")
    1256                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_M0M1MODE")
    1257                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1258                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1259                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1260              $C$DW$161       .dwtag  DW_TAG_member
    1261                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1262                      .dwattr $C$DW$161, DW_AT_name("rsvd2")
    1263                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd2")
    1264                      .dwattr $C$DW$161, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x0d)
    1265                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1266                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$162       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$162, DW_AT_name("IOISODIS")
    1270                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_IOISODIS")
    1271                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1272                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1273                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1274                      .dwendtag $C$DW$T$36
    1275              
    1276              
    1277              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1278                      .dwattr $C$DW$T$37, DW_AT_name("LPMCR_REG")
    1279                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1280              $C$DW$163       .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    1282                      .dwattr $C$DW$163, DW_AT_name("all")
    1283                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    1284                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1286              $C$DW$164       .dwtag  DW_TAG_member
    1287                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$36)
    1288                      .dwattr $C$DW$164, DW_AT_name("bit")
    1289                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    1290                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1292                      .dwendtag $C$DW$T$37
    1293              
    1294              
    1295              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1296                      .dwattr $C$DW$T$38, DW_AT_name("PCLKCR0_BITS")
    1297                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1298              $C$DW$165       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$165, DW_AT_name("CLA1")
    1301                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_CLA1")
    1302                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1303                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   25

    1305              $C$DW$166       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    1308                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    1309                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1310                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$167       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$167, DW_AT_name("DMA")
    1315                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_DMA")
    1316                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1317                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$168       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$168, DW_AT_name("CPUTIMER0")
    1322                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_CPUTIMER0")
    1323                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1324                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$169       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$169, DW_AT_name("CPUTIMER1")
    1329                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_CPUTIMER1")
    1330                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1331                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$170       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$170, DW_AT_name("CPUTIMER2")
    1336                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_CPUTIMER2")
    1337                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1338                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1339                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$171       .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$171, DW_AT_name("rsvd2")
    1343                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd2")
    1344                      .dwattr $C$DW$171, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1345                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1346                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$172       .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$172, DW_AT_name("HRPWM")
    1350                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_HRPWM")
    1351                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1352                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1353                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$173       .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$173, DW_AT_name("rsvd3")
    1357                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd3")
    1358                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1359                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:18 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\0529210                         PAGE   26

    1360                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1361              $C$DW$174       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$174, DW_AT_name("TBCLKSYNC")
    1364                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_TBCLKSYNC")
    1365                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1366                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1367                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$175       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1370                      .dwattr $C$DW$175, DW_AT_name("GTBCLKSYNC")
    1371                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GTBCLKSYNC")
