TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.1.3 *
       3              ;* Date/Time created: Tue Oct 01 15:27:19 2013                 *
       4              ;***************************************************************
       5                      .compiler_opts --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_model:data=large --o
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.1.3 Copyright (c) 1996-2012 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\work\grepos\device_support\device_support\f2837x\F2837x_bootROM_
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("CopyData")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_CopyData")

     638                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_AckUsbInterrupt")
     639                      .dwattr $C$DW$52, DW_AT_external
     640                      .dwattr $C$DW$52, DW_AT_TI_begin_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_boo
     641                      .dwattr $C$DW$52, DW_AT_TI_begin_line(0xc2)
     642                      .dwattr $C$DW$52, DW_AT_TI_begin_column(0x06)
     643                      .dwattr $C$DW$52, DW_AT_TI_max_frame_size(-2)
     644                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     645              
     646                      .dwfde $C$DW$CIE, _AckUsbInterrupt
     647              
     648              ;***************************************************************
     649              ;* FNAME: _AckUsbInterrupt              FR SIZE:   0           *
     650              ;*                                                             *
     651              ;* FUNCTION ENVIRONMENT                                        *
     652              ;*                                                             *
     653              ;* FUNCTION PROPERTIES                                         *
     654              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     655              ;***************************************************************
     656              
     657 000000dd       _AckUsbInterrupt:
     658                      .dwcfi  cfa_offset, -2
     659                      .dwcfi  save_reg_to_mem, 26, 0
     660                      .dwcfi  save_reg_to_reg, 78, 26
     661                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     662 000000dd 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_U] 
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   14

         000000de 0000 
     663 000000df 2801!         MOV       @_PieCtrlRegs+1,#256  ; [CPU_] |197| 
         000000e0 0100 
     664                      .dwpsn  file "C:/work/grepos/device_support/device_support/f2837x/F2837x_bootROM_dev/F2837x_bootROM/c
     665              $C$DW$53        .dwtag  DW_TAG_TI_branch
     666                      .dwattr $C$DW$53, DW_AT_low_pc(0x00)
     667                      .dwattr $C$DW$53, DW_AT_TI_return
     668 000000e1 0006          LRETR     ; [CPU_] 
     669                      ; return occurs ; [] 
     670                      .dwattr $C$DW$52, DW_AT_TI_end_file("C:/work/grepos/device_support/device_support/f2837x/F2837x_bootR
     671                      .dwattr $C$DW$52, DW_AT_TI_end_line(0xc9)
     672                      .dwattr $C$DW$52, DW_AT_TI_end_column(0x01)
     673                      .dwendentry
     674                      .dwendtag $C$DW$52
     675              
     676              ;**************************************************************
     677              ;* UNDEFINED EXTERNAL REFERENCES                              *
     678              ;**************************************************************
     679                      .global _CopyData
     680                      .global _AckEp0
     681                      .global _ReadReservedFn
     682                      .global _UsbIntHandler
     683                      .global _c1brom_enable_pie_in_boot
     684                      .global _ResetUsbDriver
     685                      .global _g_UsbRxDataLength
     686                      .global _g_UsbRxPacketLength
     687                      .global _GetWordData
     688                      .global _g_UsbRxBuffer
     689                      .global _GetLongData
     690                      .global _PieCtrlRegs
     691                      .global _ClkCfgRegs
     692                      .global _CpuSysRegs
     693                      .global _DevCfgRegs
     694                      .global _PieVectTable
     695              
     696              ;***************************************************************
     697              ;* TYPE INFORMATION                                            *
     698              ;***************************************************************
     699              
     700              $C$DW$T$293     .dwtag  DW_TAG_enumeration_type
     701                      .dwattr $C$DW$T$293, DW_AT_byte_size(0x01)
     702              $C$DW$54        .dwtag  DW_TAG_enumerator, DW_AT_name("USB_MORE_DATA"), DW_AT_const_value(0x00)
     703              $C$DW$55        .dwtag  DW_TAG_enumerator, DW_AT_name("USB_END_DATA"), DW_AT_const_value(0x01)
     704                      .dwendtag $C$DW$T$293
     705              
     706              $C$DW$T$294     .dwtag  DW_TAG_typedef, DW_AT_name("eDataEnd")
     707                      .dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$293)
     708                      .dwattr $C$DW$T$294, DW_AT_language(DW_LANG_C)
     709              
     710              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     711                      .dwattr $C$DW$T$20, DW_AT_name("AUXCLKDIVSEL_BITS")
     712                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     713              $C$DW$56        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     715                      .dwattr $C$DW$56, DW_AT_name("AUXPLLDIV")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   15

     716                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_AUXPLLDIV")
     717                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     718                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     720              $C$DW$57        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$57, DW_AT_name("rsvd1")
     723                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_rsvd1")
     724                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     725                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     726                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     727              $C$DW$58        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$58, DW_AT_name("rsvd2")
     730                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd2")
     731                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     732                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     733                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     734                      .dwendtag $C$DW$T$20
     735              
     736              
     737              $C$DW$T$22      .dwtag  DW_TAG_union_type
     738                      .dwattr $C$DW$T$22, DW_AT_name("AUXCLKDIVSEL_REG")
     739                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     740              $C$DW$59        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$21)
     742                      .dwattr $C$DW$59, DW_AT_name("all")
     743                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_all")
     744                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     746              $C$DW$60        .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     748                      .dwattr $C$DW$60, DW_AT_name("bit")
     749                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bit")
     750                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     752                      .dwendtag $C$DW$T$22
     753              
     754              
     755              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     756                      .dwattr $C$DW$T$23, DW_AT_name("AUXPLLCTL1_BITS")
     757                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     758              $C$DW$61        .dwtag  DW_TAG_member
     759                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     760                      .dwattr $C$DW$61, DW_AT_name("PLLEN")
     761                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_PLLEN")
     762                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     763                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     764                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     765              $C$DW$62        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     767                      .dwattr $C$DW$62, DW_AT_name("PLLCLKEN")
     768                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_PLLCLKEN")
     769                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     770                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   16

     771                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     772              $C$DW$63        .dwtag  DW_TAG_member
     773                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     774                      .dwattr $C$DW$63, DW_AT_name("rsvd1")
     775                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd1")
     776                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     777                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     778                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     779              $C$DW$64        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     781                      .dwattr $C$DW$64, DW_AT_name("rsvd2")
     782                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_rsvd2")
     783                      .dwattr $C$DW$64, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     784                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     785                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     786                      .dwendtag $C$DW$T$23
     787              
     788              
     789              $C$DW$T$24      .dwtag  DW_TAG_union_type
     790                      .dwattr $C$DW$T$24, DW_AT_name("AUXPLLCTL1_REG")
     791                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     792              $C$DW$65        .dwtag  DW_TAG_member
     793                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
     794                      .dwattr $C$DW$65, DW_AT_name("all")
     795                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_all")
     796                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     797                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     798              $C$DW$66        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$23)
     800                      .dwattr $C$DW$66, DW_AT_name("bit")
     801                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_bit")
     802                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     804                      .dwendtag $C$DW$T$24
     805              
     806              
     807              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     808                      .dwattr $C$DW$T$25, DW_AT_name("AUXPLLMULT_BITS")
     809                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     810              $C$DW$67        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$67, DW_AT_name("IMULT")
     813                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_IMULT")
     814                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x07)
     815                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$68        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$68, DW_AT_name("rsvd1")
     820                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd1")
     821                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     822                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     824              $C$DW$69        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   17

     826                      .dwattr $C$DW$69, DW_AT_name("FMULT")
     827                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_FMULT")
     828                      .dwattr $C$DW$69, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     829                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     830                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     831              $C$DW$70        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$70, DW_AT_name("rsvd2")
     834                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_rsvd2")
     835                      .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     836                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     838              $C$DW$71        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$71, DW_AT_name("rsvd3")
     841                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd3")
     842                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     843                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     844                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     845                      .dwendtag $C$DW$T$25
     846              
     847              
     848              $C$DW$T$26      .dwtag  DW_TAG_union_type
     849                      .dwattr $C$DW$T$26, DW_AT_name("AUXPLLMULT_REG")
     850                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     851              $C$DW$72        .dwtag  DW_TAG_member
     852                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$21)
     853                      .dwattr $C$DW$72, DW_AT_name("all")
     854                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
     855                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     856                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     857              $C$DW$73        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$25)
     859                      .dwattr $C$DW$73, DW_AT_name("bit")
     860                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
     861                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     863                      .dwendtag $C$DW$T$26
     864              
     865              
     866              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     867                      .dwattr $C$DW$T$27, DW_AT_name("AUXPLLSTS_BITS")
     868                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     869              $C$DW$74        .dwtag  DW_TAG_member
     870                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     871                      .dwattr $C$DW$74, DW_AT_name("LOCKS")
     872                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_LOCKS")
     873                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     874                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     875                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     876              $C$DW$75        .dwtag  DW_TAG_member
     877                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     878                      .dwattr $C$DW$75, DW_AT_name("SLIPS")
     879                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_SLIPS")
     880                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   18

     881                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$76        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$76, DW_AT_name("rsvd1")
     886                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_rsvd1")
     887                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     888                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     890              $C$DW$77        .dwtag  DW_TAG_member
     891                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     892                      .dwattr $C$DW$77, DW_AT_name("rsvd2")
     893                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_rsvd2")
     894                      .dwattr $C$DW$77, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     895                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     896                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     897                      .dwendtag $C$DW$T$27
     898              
     899              
     900              $C$DW$T$28      .dwtag  DW_TAG_union_type
     901                      .dwattr $C$DW$T$28, DW_AT_name("AUXPLLSTS_REG")
     902                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     903              $C$DW$78        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$21)
     905                      .dwattr $C$DW$78, DW_AT_name("all")
     906                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_all")
     907                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     909              $C$DW$79        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$27)
     911                      .dwattr $C$DW$79, DW_AT_name("bit")
     912                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_bit")
     913                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     915                      .dwendtag $C$DW$T$28
     916              
     917              
     918              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     919                      .dwattr $C$DW$T$29, DW_AT_name("CCR_BITS")
     920                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     921              $C$DW$80        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$80, DW_AT_name("VMAPS")
     924                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_VMAPS")
     925                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     926                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$81        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$81, DW_AT_name("MONPRIV")
     931                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_MONPRIV")
     932                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     933                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$82        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   19

     936                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$82, DW_AT_name("ENPROT")
     938                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_ENPROT")
     939                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     940                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$83        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$83, DW_AT_name("rsvd1")
     945                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd1")
     946                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
     947                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$84        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$84, DW_AT_name("rsvd2")
     952                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd2")
     953                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
     954                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     955                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     956                      .dwendtag $C$DW$T$29
     957              
     958              
     959              $C$DW$T$30      .dwtag  DW_TAG_union_type
     960                      .dwattr $C$DW$T$30, DW_AT_name("CCR_REG")
     961                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     962              $C$DW$85        .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
     964                      .dwattr $C$DW$85, DW_AT_name("all")
     965                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
     966                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$86        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$29)
     970                      .dwattr $C$DW$86, DW_AT_name("bit")
     971                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
     972                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     973                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     974                      .dwendtag $C$DW$T$30
     975              
     976              
     977              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     978                      .dwattr $C$DW$T$31, DW_AT_name("CLKCFGLOCK1_BITS")
     979                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     980              $C$DW$87        .dwtag  DW_TAG_member
     981                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     982                      .dwattr $C$DW$87, DW_AT_name("CLKSRCCTL1")
     983                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_CLKSRCCTL1")
     984                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     985                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     986                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     987              $C$DW$88        .dwtag  DW_TAG_member
     988                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     989                      .dwattr $C$DW$88, DW_AT_name("CLKSRCCTL2")
     990                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_CLKSRCCTL2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   20

     991                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     992                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     993                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     994              $C$DW$89        .dwtag  DW_TAG_member
     995                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     996                      .dwattr $C$DW$89, DW_AT_name("CLKSRCCTL3")
     997                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_CLKSRCCTL3")
     998                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     999                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1001              $C$DW$90        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1003                      .dwattr $C$DW$90, DW_AT_name("SYSPLLCTL1")
    1004                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1005                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1006                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1007                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1008              $C$DW$91        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$91, DW_AT_name("SYSPLLCTL2")
    1011                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1012                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1013                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$92        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$92, DW_AT_name("SYSPLLCTL3")
    1018                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1019                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1020                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1022              $C$DW$93        .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$93, DW_AT_name("SYSPLLMULT")
    1025                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1026                      .dwattr $C$DW$93, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$94        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$94, DW_AT_name("AUXPLLCTL1")
    1032                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1033                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$95        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
    1039                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
    1040                      .dwattr $C$DW$95, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1041                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$96        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$96, DW_AT_name("AUXPLLMULT")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   21

    1046                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1047                      .dwattr $C$DW$96, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1048                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1050              $C$DW$97        .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$97, DW_AT_name("SYSCLKDIVSEL")
    1053                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1054                      .dwattr $C$DW$97, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1055                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1056                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$98        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$98, DW_AT_name("AUXCLKDIVSEL")
    1060                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1061                      .dwattr $C$DW$98, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1064              $C$DW$99        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$99, DW_AT_name("PERCLKDIVSEL")
    1067                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1068                      .dwattr $C$DW$99, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1069                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1071              $C$DW$100       .dwtag  DW_TAG_member
    1072                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1073                      .dwattr $C$DW$100, DW_AT_name("rsvd2")
    1074                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd2")
    1075                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1076                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$101       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1080                      .dwattr $C$DW$101, DW_AT_name("LOSPCP")
    1081                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_LOSPCP")
    1082                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1083                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$102       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1087                      .dwattr $C$DW$102, DW_AT_name("rsvd3")
    1088                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd3")
    1089                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1090                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1091                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1092                      .dwendtag $C$DW$T$31
    1093              
    1094              
    1095              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1096                      .dwattr $C$DW$T$32, DW_AT_name("CLKCFGLOCK1_REG")
    1097                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1098              $C$DW$103       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1100                      .dwattr $C$DW$103, DW_AT_name("all")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   22

    1101                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1102                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$104       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$31)
    1106                      .dwattr $C$DW$104, DW_AT_name("bit")
    1107                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1108                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1110                      .dwendtag $C$DW$T$32
    1111              
    1112              
    1113              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1114                      .dwattr $C$DW$T$33, DW_AT_name("CLKSEM_BITS")
    1115                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1116              $C$DW$105       .dwtag  DW_TAG_member
    1117                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1118                      .dwattr $C$DW$105, DW_AT_name("SEM")
    1119                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_SEM")
    1120                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1121                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$106       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    1126                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    1127                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1128                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1130              $C$DW$107       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$107, DW_AT_name("KEY")
    1133                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_KEY")
    1134                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1135                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1136                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1137                      .dwendtag $C$DW$T$33
    1138              
    1139              
    1140              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1141                      .dwattr $C$DW$T$34, DW_AT_name("CLKSEM_REG")
    1142                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1143              $C$DW$108       .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
    1145                      .dwattr $C$DW$108, DW_AT_name("all")
    1146                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_all")
    1147                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$109       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$33)
    1151                      .dwattr $C$DW$109, DW_AT_name("bit")
    1152                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_bit")
    1153                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1155                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   23

    1156              
    1157              
    1158              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1159                      .dwattr $C$DW$T$35, DW_AT_name("CLKSRCCTL1_BITS")
    1160                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1161              $C$DW$110       .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1163                      .dwattr $C$DW$110, DW_AT_name("OSCCLKSRCSEL")
    1164                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    1165                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1166                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1167                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1168              $C$DW$111       .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    1171                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    1172                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1173                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1174                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1175              $C$DW$112       .dwtag  DW_TAG_member
    1176                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1177                      .dwattr $C$DW$112, DW_AT_name("INTOSC2OFF")
    1178                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTOSC2OFF")
    1179                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1180                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1181                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1182              $C$DW$113       .dwtag  DW_TAG_member
    1183                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1184                      .dwattr $C$DW$113, DW_AT_name("XTALOFF")
    1185                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_XTALOFF")
    1186                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1187                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1188                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$114       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$114, DW_AT_name("WDHALTI")
    1192                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_WDHALTI")
    1193                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1194                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1196              $C$DW$115       .dwtag  DW_TAG_member
    1197                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1198                      .dwattr $C$DW$115, DW_AT_name("rsvd2")
    1199                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd2")
    1200                      .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1201                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$116       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$116, DW_AT_name("rsvd3")
    1206                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd3")
    1207                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1208                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1209                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1210                      .dwendtag $C$DW$T$35
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   24

    1211              
    1212              
    1213              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1214                      .dwattr $C$DW$T$36, DW_AT_name("CLKSRCCTL1_REG")
    1215                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1216              $C$DW$117       .dwtag  DW_TAG_member
    1217                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
    1218                      .dwattr $C$DW$117, DW_AT_name("all")
    1219                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1220                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$118       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$35)
    1224                      .dwattr $C$DW$118, DW_AT_name("bit")
    1225                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1226                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1228                      .dwendtag $C$DW$T$36
    1229              
    1230              
    1231              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1232                      .dwattr $C$DW$T$37, DW_AT_name("CLKSRCCTL2_BITS")
    1233                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1234              $C$DW$119       .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1236                      .dwattr $C$DW$119, DW_AT_name("AUXOSCCLKSRCSEL")
    1237                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    1238                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1239                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1240                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1241              $C$DW$120       .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1243                      .dwattr $C$DW$120, DW_AT_name("CANABCLKSEL")
    1244                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CANABCLKSEL")
    1245                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1246                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1247                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1248              $C$DW$121       .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1250                      .dwattr $C$DW$121, DW_AT_name("CANBBCLKSEL")
    1251                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    1252                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1253                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1254                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1255              $C$DW$122       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    1258                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
    1259                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    1260                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1261                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1262              $C$DW$123       .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1264                      .dwattr $C$DW$123, DW_AT_name("rsvd2")
    1265                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   25

    1266                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1267                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1268                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1269                      .dwendtag $C$DW$T$37
    1270              
    1271              
    1272              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1273                      .dwattr $C$DW$T$38, DW_AT_name("CLKSRCCTL2_REG")
    1274                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1275              $C$DW$124       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    1277                      .dwattr $C$DW$124, DW_AT_name("all")
    1278                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1279                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1281              $C$DW$125       .dwtag  DW_TAG_member
    1282                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$37)
    1283                      .dwattr $C$DW$125, DW_AT_name("bit")
    1284                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1285                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1287                      .dwendtag $C$DW$T$38
    1288              
    1289              
    1290              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1291                      .dwattr $C$DW$T$39, DW_AT_name("CLKSRCCTL3_BITS")
    1292                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1293              $C$DW$126       .dwtag  DW_TAG_member
    1294                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1295                      .dwattr $C$DW$126, DW_AT_name("XCLKOUTSEL")
    1296                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    1297                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1298                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1299                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1300              $C$DW$127       .dwtag  DW_TAG_member
    1301                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1302                      .dwattr $C$DW$127, DW_AT_name("rsvd1")
    1303                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd1")
    1304                      .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1305                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1306                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1307              $C$DW$128       .dwtag  DW_TAG_member
    1308                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1309                      .dwattr $C$DW$128, DW_AT_name("rsvd2")
    1310                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_rsvd2")
    1311                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1312                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1313                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1314                      .dwendtag $C$DW$T$39
    1315              
    1316              
    1317              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1318                      .dwattr $C$DW$T$40, DW_AT_name("CLKSRCCTL3_REG")
    1319                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1320              $C$DW$129       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   26

    1321                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    1322                      .dwattr $C$DW$129, DW_AT_name("all")
    1323                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_all")
    1324                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$130       .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$39)
    1328                      .dwattr $C$DW$130, DW_AT_name("bit")
    1329                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_bit")
    1330                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1331                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1332                      .dwendtag $C$DW$T$40
    1333              
    1334              
    1335              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1336                      .dwattr $C$DW$T$43, DW_AT_name("CLK_CFG_REGS")
    1337                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x32)
    1338              $C$DW$131       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$34)
    1340                      .dwattr $C$DW$131, DW_AT_name("CLKSEM")
    1341                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_CLKSEM")
    1342                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1343                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1344              $C$DW$132       .dwtag  DW_TAG_member
    1345                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
    1346                      .dwattr $C$DW$132, DW_AT_name("CLKCFGLOCK1")
    1347                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    1348                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1349                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$133       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$41)
    1352                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    1353                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    1354                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1355                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1356              $C$DW$134       .dwtag  DW_TAG_member
    1357                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$36)
    1358                      .dwattr $C$DW$134, DW_AT_name("CLKSRCCTL1")
    1359                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    1360                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1361                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$135       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$38)
    1364                      .dwattr $C$DW$135, DW_AT_name("CLKSRCCTL2")
    1365                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    1366                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1367                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1368              $C$DW$136       .dwtag  DW_TAG_member
    1369                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$40)
    1370                      .dwattr $C$DW$136, DW_AT_name("CLKSRCCTL3")
    1371                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    1372                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1373                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$137       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$278)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   27

    1376                      .dwattr $C$DW$137, DW_AT_name("SYSPLLCTL1")
    1377                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    1378                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1379                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1380              $C$DW$138       .dwtag  DW_TAG_member
    1381                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$280)
    1382                      .dwattr $C$DW$138, DW_AT_name("SYSPLLCTL2")
    1383                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    1384                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1385                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1386              $C$DW$139       .dwtag  DW_TAG_member
    1387                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$282)
    1388                      .dwattr $C$DW$139, DW_AT_name("SYSPLLCTL3")
    1389                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    1390                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1391                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$140       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$284)
    1394                      .dwattr $C$DW$140, DW_AT_name("SYSPLLMULT")
    1395                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_SYSPLLMULT")
    1396                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1397                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1398              $C$DW$141       .dwtag  DW_TAG_member
    1399                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$286)
    1400                      .dwattr $C$DW$141, DW_AT_name("SYSPLLSTS")
    1401                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SYSPLLSTS")
    1402                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1403                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1404              $C$DW$142       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$24)
    1406                      .dwattr $C$DW$142, DW_AT_name("AUXPLLCTL1")
    1407                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    1408                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1409                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1410              $C$DW$143       .dwtag  DW_TAG_member
    1411                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$41)
    1412                      .dwattr $C$DW$143, DW_AT_name("rsvd2")
    1413                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd2")
    1414                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1415                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1416              $C$DW$144       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$26)
    1418                      .dwattr $C$DW$144, DW_AT_name("AUXPLLMULT")
    1419                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_AUXPLLMULT")
    1420                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1421                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1422              $C$DW$145       .dwtag  DW_TAG_member
    1423                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$28)
    1424                      .dwattr $C$DW$145, DW_AT_name("AUXPLLSTS")
    1425                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_AUXPLLSTS")
    1426                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1427                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1428              $C$DW$146       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$274)
    1430                      .dwattr $C$DW$146, DW_AT_name("SYSCLKDIVSEL")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   28

    1431                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    1432                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1433                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1434              $C$DW$147       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$22)
    1436                      .dwattr $C$DW$147, DW_AT_name("AUXCLKDIVSEL")
    1437                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    1438                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1439                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1440              $C$DW$148       .dwtag  DW_TAG_member
    1441                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$175)
    1442                      .dwattr $C$DW$148, DW_AT_name("PERCLKDIVSEL")
    1443                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    1444                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1445                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1446              $C$DW$149       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$292)
    1448                      .dwattr $C$DW$149, DW_AT_name("XCLKOUTDIVSEL")
    1449                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    1450                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1451                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1452              $C$DW$150       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$42)
    1454                      .dwattr $C$DW$150, DW_AT_name("rsvd3")
    1455                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd3")
    1456                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1457                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$151       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$133)
    1460                      .dwattr $C$DW$151, DW_AT_name("LOSPCP")
    1461                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_LOSPCP")
    1462                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1463                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1464              $C$DW$152       .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$139)
    1466                      .dwattr $C$DW$152, DW_AT_name("MCDCR")
    1467                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_MCDCR")
    1468                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1469                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1470              $C$DW$153       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$290)
    1472                      .dwattr $C$DW$153, DW_AT_name("X1CNT")
    1473                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_X1CNT")
    1474                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1475                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1476                      .dwendtag $C$DW$T$43
    1477              
    1478              $C$DW$154       .dwtag  DW_TAG_TI_far_type
    1479                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$43)
    1480              $C$DW$T$304     .dwtag  DW_TAG_volatile_type
    1481                      .dwattr $C$DW$T$304, DW_AT_type(*$C$DW$154)
    1482              
    1483              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1484                      .dwattr $C$DW$T$44, DW_AT_name("CPU2RESCTL_BITS")
    1485                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   29

    1486              $C$DW$155       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1488                      .dwattr $C$DW$155, DW_AT_name("RESET")
    1489                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_RESET")
    1490                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1491                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1493              $C$DW$156       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$156, DW_AT_name("rsvd1")
    1496                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd1")
    1497                      .dwattr $C$DW$156, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1498                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1500              $C$DW$157       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1502                      .dwattr $C$DW$157, DW_AT_name("KEY")
    1503                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_KEY")
    1504                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1505                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1506                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1507                      .dwendtag $C$DW$T$44
    1508              
    1509              
    1510              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1511                      .dwattr $C$DW$T$45, DW_AT_name("CPU2RESCTL_REG")
    1512                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    1513              $C$DW$158       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    1515                      .dwattr $C$DW$158, DW_AT_name("all")
    1516                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    1517                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1519              $C$DW$159       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$44)
    1521                      .dwattr $C$DW$159, DW_AT_name("bit")
    1522                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    1523                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1524                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1525                      .dwendtag $C$DW$T$45
    1526              
    1527              
    1528              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1529                      .dwattr $C$DW$T$46, DW_AT_name("CPUSEL0_BITS")
    1530                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    1531              $C$DW$160       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$160, DW_AT_name("EPWM1")
    1534                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_EPWM1")
    1535                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$161       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$161, DW_AT_name("EPWM2")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   30

    1541                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_EPWM2")
    1542                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$162       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$162, DW_AT_name("EPWM3")
    1548                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_EPWM3")
    1549                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1550                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$163       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$163, DW_AT_name("EPWM4")
    1555                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_EPWM4")
    1556                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$164       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$164, DW_AT_name("EPWM5")
    1562                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_EPWM5")
    1563                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1564                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$165       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1568                      .dwattr $C$DW$165, DW_AT_name("EPWM6")
    1569                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_EPWM6")
    1570                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1571                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$166       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$166, DW_AT_name("EPWM7")
    1576                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_EPWM7")
    1577                      .dwattr $C$DW$166, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1578                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1579                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$167       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$167, DW_AT_name("EPWM8")
    1583                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_EPWM8")
    1584                      .dwattr $C$DW$167, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1585                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$168       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$168, DW_AT_name("EPWM9")
    1590                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_EPWM9")
    1591                      .dwattr $C$DW$168, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$169       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   31

    1596                      .dwattr $C$DW$169, DW_AT_name("EPWM10")
    1597                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_EPWM10")
    1598                      .dwattr $C$DW$169, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$170       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$170, DW_AT_name("EPWM11")
    1604                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_EPWM11")
    1605                      .dwattr $C$DW$170, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$171       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$171, DW_AT_name("EPWM12")
    1611                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_EPWM12")
    1612                      .dwattr $C$DW$171, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$172       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$172, DW_AT_name("rsvd1")
    1618                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd1")
    1619                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1620                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$173       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$173, DW_AT_name("rsvd2")
    1625                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd2")
    1626                      .dwattr $C$DW$173, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1627                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1628                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1629                      .dwendtag $C$DW$T$46
    1630              
    1631              
    1632              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1633                      .dwattr $C$DW$T$47, DW_AT_name("CPUSEL0_REG")
    1634                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    1635              $C$DW$174       .dwtag  DW_TAG_member
    1636                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    1637                      .dwattr $C$DW$174, DW_AT_name("all")
    1638                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_all")
    1639                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1640                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1641              $C$DW$175       .dwtag  DW_TAG_member
    1642                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$46)
    1643                      .dwattr $C$DW$175, DW_AT_name("bit")
    1644                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_bit")
    1645                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1646                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1647                      .dwendtag $C$DW$T$47
    1648              
    1649              
    1650              $C$DW$T$48      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   32

    1651                      .dwattr $C$DW$T$48, DW_AT_name("CPUSEL11_BITS")
    1652                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    1653              $C$DW$176       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1655                      .dwattr $C$DW$176, DW_AT_name("ADC1")
    1656                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADC1")
    1657                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1658                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1659                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1660              $C$DW$177       .dwtag  DW_TAG_member
    1661                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1662                      .dwattr $C$DW$177, DW_AT_name("ADC2")
    1663                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADC2")
    1664                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1665                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1666                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1667              $C$DW$178       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$178, DW_AT_name("ADC3")
    1670                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADC3")
    1671                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1672                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1674              $C$DW$179       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$179, DW_AT_name("ADC4")
    1677                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADC4")
    1678                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1679                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$180       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$180, DW_AT_name("rsvd1")
    1684                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd1")
    1685                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1686                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1687                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1688              $C$DW$181       .dwtag  DW_TAG_member
    1689                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1690                      .dwattr $C$DW$181, DW_AT_name("rsvd2")
    1691                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd2")
    1692                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1693                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1694                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1695                      .dwendtag $C$DW$T$48
    1696              
    1697              
    1698              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1699                      .dwattr $C$DW$T$49, DW_AT_name("CPUSEL11_REG")
    1700                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    1701              $C$DW$182       .dwtag  DW_TAG_member
    1702                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    1703                      .dwattr $C$DW$182, DW_AT_name("all")
    1704                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    1705                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   33

    1706                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$183       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$48)
    1709                      .dwattr $C$DW$183, DW_AT_name("bit")
    1710                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    1711                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1713                      .dwendtag $C$DW$T$49
    1714              
    1715              
    1716              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1717                      .dwattr $C$DW$T$50, DW_AT_name("CPUSEL12_BITS")
    1718                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    1719              $C$DW$184       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1721                      .dwattr $C$DW$184, DW_AT_name("CMPSS1")
    1722                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_CMPSS1")
    1723                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1724                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1726              $C$DW$185       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1728                      .dwattr $C$DW$185, DW_AT_name("CMPSS2")
    1729                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_CMPSS2")
    1730                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1731                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1732                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1733              $C$DW$186       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1735                      .dwattr $C$DW$186, DW_AT_name("CMPSS3")
    1736                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_CMPSS3")
    1737                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1738                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1739                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1740              $C$DW$187       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1742                      .dwattr $C$DW$187, DW_AT_name("CMPSS4")
    1743                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_CMPSS4")
    1744                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1745                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1746                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$188       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1749                      .dwattr $C$DW$188, DW_AT_name("CMPSS5")
    1750                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_CMPSS5")
    1751                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1752                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1753                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1754              $C$DW$189       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1756                      .dwattr $C$DW$189, DW_AT_name("CMPSS6")
    1757                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_CMPSS6")
    1758                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1759                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1760                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   34

    1761              $C$DW$190       .dwtag  DW_TAG_member
    1762                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1763                      .dwattr $C$DW$190, DW_AT_name("CMPSS7")
    1764                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CMPSS7")
    1765                      .dwattr $C$DW$190, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1766                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1767                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1768              $C$DW$191       .dwtag  DW_TAG_member
    1769                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1770                      .dwattr $C$DW$191, DW_AT_name("CMPSS8")
    1771                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_CMPSS8")
    1772                      .dwattr $C$DW$191, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1773                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1774                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1775              $C$DW$192       .dwtag  DW_TAG_member
    1776                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1777                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    1778                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    1779                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1780                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1781                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1782              $C$DW$193       .dwtag  DW_TAG_member
    1783                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1784                      .dwattr $C$DW$193, DW_AT_name("rsvd2")
    1785                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd2")
    1786                      .dwattr $C$DW$193, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1787                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1788                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1789                      .dwendtag $C$DW$T$50
    1790              
    1791              
    1792              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1793                      .dwattr $C$DW$T$51, DW_AT_name("CPUSEL12_REG")
    1794                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    1795              $C$DW$194       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    1797                      .dwattr $C$DW$194, DW_AT_name("all")
    1798                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_all")
    1799                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$195       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$50)
    1803                      .dwattr $C$DW$195, DW_AT_name("bit")
    1804                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_bit")
    1805                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1807                      .dwendtag $C$DW$T$51
    1808              
    1809              
    1810              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1811                      .dwattr $C$DW$T$52, DW_AT_name("CPUSEL14_BITS")
    1812                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    1813              $C$DW$196       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1815                      .dwattr $C$DW$196, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   35

    1816                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd1")
    1817                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1818                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1819                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1820              $C$DW$197       .dwtag  DW_TAG_member
    1821                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1822                      .dwattr $C$DW$197, DW_AT_name("Buffered_DAC12_1")
    1823                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_Buffered_DAC12_1")
    1824                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1825                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1826                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1827              $C$DW$198       .dwtag  DW_TAG_member
    1828                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1829                      .dwattr $C$DW$198, DW_AT_name("Buffered_DAC12_2")
    1830                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_Buffered_DAC12_2")
    1831                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1832                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1833                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1834              $C$DW$199       .dwtag  DW_TAG_member
    1835                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1836                      .dwattr $C$DW$199, DW_AT_name("Buffered_DAC12_3")
    1837                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_Buffered_DAC12_3")
    1838                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1839                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1840                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1841              $C$DW$200       .dwtag  DW_TAG_member
    1842                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1843                      .dwattr $C$DW$200, DW_AT_name("rsvd2")
    1844                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd2")
    1845                      .dwattr $C$DW$200, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1846                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1847                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1848                      .dwendtag $C$DW$T$52
    1849              
    1850              
    1851              $C$DW$T$53      .dwtag  DW_TAG_union_type
    1852                      .dwattr $C$DW$T$53, DW_AT_name("CPUSEL14_REG")
    1853                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x02)
    1854              $C$DW$201       .dwtag  DW_TAG_member
    1855                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    1856                      .dwattr $C$DW$201, DW_AT_name("all")
    1857                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_all")
    1858                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1859                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1860              $C$DW$202       .dwtag  DW_TAG_member
    1861                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$52)
    1862                      .dwattr $C$DW$202, DW_AT_name("bit")
    1863                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_bit")
    1864                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1866                      .dwendtag $C$DW$T$53
    1867              
    1868              
    1869              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    1870                      .dwattr $C$DW$T$54, DW_AT_name("CPUSEL1_BITS")
TMS320C2000 Assembler PC v6.1.3 Tue Oct 01 15:27:19 2013

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
C:\Users\a0272466\AppData\Local\Temp\1062410                         PAGE   36

    1871                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    1872              $C$DW$203       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    1874                      .dwattr $C$DW$203, DW_AT_name("ECAP1")
    1875                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_ECAP1")
    1876                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1877                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1878                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1879              $C$DW$204       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1881                      .dwattr $C$DW$204, DW_AT_name("ECAP2")
    1882                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ECAP2")
    1883                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1884                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1885                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1886              $C$DW$205       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    1888                      .dwattr $C$DW$205, DW_AT_name("ECAP3")
    1889                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_ECAP3")
    1890                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
